{
    "Floods: Nigerian govt lists most affected states": "The Nigerian government has categorised states into three based on the extent of flooding in the states this year. The Minister of the Federal Captial Territory, Nyesom Wike, disclosed this Thursday while briefing State House journalists at the end of the National Economic Council (NEC) meeting. Mr Wike said a special committee set up by NEC did the grouping after it went round the country to assess the impact of floods. “The states in group ‘A’ are those with over 15 points. The most affected States are Anambra, Bauchi, Bayelsa, Benue, Borno, Kogi, Nasarawa, Niger, Rivers, Enugu, Kano, Oyo, Yobe, Zamfara “Those in group ‘B’, those with 10-15 points, are Cross River, Delta, Jigawa, Kwara, and Ondo while those in category ‘C’ with less than 10 points are Katsina, Abia, Adamawa, Akwa Ibom, Bauchi, Ebonyi, Edo, Ekiti, Gombe, Imo, Kaduna, Katsina, Kebbi, Lagos, Ogun, Osun, Plateau, Sokoto, Taraba, FCT.” He said the council directed the National Emergency Management Agency (NEMA) to immediately provide intervention to the affected states. “NEC resolved to develop a roadmap for intervention and directed the National Emergency Management Agency (NEMA) to provide immediate intervention on relief materials to the affected states,” he said. The minister said the NEC would develop a road map in collaboration with the Chairman of the Nigerian Governors Forum to address the incessant flooding. PREMIUM TIMES has reported floods in many states leading to some deaths and loss of properties. On Thursday, the meteorological agency, NiMet, urged Nigerians to expect more floods in some states due to the volume of rainfall expected. While more floods are still expected this year, the situation has been relatively better than last year when over 600 people died and over 1.4 million were displaced due to floods. After Mr Wike’s address, the Senior Special Assistant to the President on Media and Communications, Stanley Nkwocha, gave details of balances in the nation’s excess crude and other accounts as follows: Excess Crude Account, $473,754.57; Stabilization Account, N34,936,868,803.58 (34.9 billion); Development of Natural Resources, N128,330,636,441.14 (128.3 billion). Support PREMIUM TIMES' journalism of integrity and credibility Good journalism costs a lot of money. Yet only good journalism can ensure the possibility of a good society, an accountable democracy, and a transparent government. For continued free access to the best investigative journalism in the country we ask you to consider making a modest support to this noble endeavour.  By contributing to PREMIUM TIMES, you are helping to sustain a journalism of relevance and ensuring it remains free and available to all. TEXT AD: Call Willie - +2348098788999",
    "UPDATED: Fuel Subsidy Removal: AGF warns labour unions against planned strike": "The Attorney-General of the Federation (AGF), Lateef Fagbemi, has cautioned labour unions against the indefinite strike they plan to embark on to protest the hardships associated with petrol subsidy removal. The labour unions comprising the Nigeria Labour Congress (NLC) and the Trade Union Congress (TUC) had, on Tuesday, declared their plan to embark on the indefinite nationwide strike on 3 October. The AGF, who doubles as the Minister of Justice, issued the warning on behalf of the federal government against the strike in a letter he addressed to the unions’ lawyer, Femi Falana. In the letter dated 26 September but made public on Thursday by Modupe Ogundoro, director of press at the Federal Ministry of Justice, the minister reminded the labour unions of a subsisting court order issued in a pending suit at the industrial court concerning the dispute. Mr Fagbemi said the proposed strike “is in clear violation of the pending interim injunctive order granted on 5 June 2023, restraining both Nigeria Labour Congress and Trade Union Congress from embarking on any industrial action.” The AGF highlighted the developments leading to the latest threat by the labour unions to go on a nationwide strike. He referenced the exchange of correspondence between his ministry and Mr Falana’s law firm “before and after the nationwide ‘action/protest’ declared by the NLC on 2 August 2023.” “Whilst your clients had maintained that the nationwide protest by NLC is in furtherance of its constitutional right to embark on protests, the Ministry has repeatedly advised on the need to advise your clients to refrain from resorting to self-help and taking actions capable of undermining subsisting orders of a court of competent jurisdiction,” Mr Fagbemi, a Senior Advocate of Nigeria (SAN), wrote. The labour unions had been battling with the federal government since President Bola Tinubu announced the removal of the petrol subsidy at his inauguration on 29 May. Since then, the unions have issued a series of threats to embark on strike action. A judge of the National Industrial Court in Abuja, Olufunke Anuwe, at the instance of the Federal Ministry of Justice, issued an order on 5 June, two days before the NLC and the TUC planned to embark on a nationwide strike on 7 June. The judge reaffirmed the order on 19 June, further restraining the labour unions from going on strike. In August, the federal government filed a contempt suit at the National Industrial Court in Abuja after a protest the union leaders organised to further press the government to address the negative impacts of the fuel subsidy removal. The government said the protest was in violation of the 5 June order of the court. But the justice ministry later withdrew the contempt suit, citing the intervention of President Tinubu to give room for further negotiation with the union leaders. But negotiations have failed to yield the desired results, prompting the unions to declare on Tuesday another plan to embark on strike.  The subsidy removal has triggered an astronomical increase in petrol pump prices with the attendant rising cost of living in the country. But Mr Fagbemi, in his communication to the unions’ lawyer, urged them to shelve the planned strike to afford “parties more room for further mutual engagements, for a holistic and sustainable resolution of all outstanding issues on this matter in the overall national interest.”",
    "Fuel scarcity looms as NUPENG begins mobilisation for labour unions’ strike": "The Nigerian Union of Petroleum and Natural Gas (NUPENG) on Thursday directed its members to commence full mobilisation to ensure compliance with the directive of the Nigerian labour unions to embark on an indefinite strike. Members of NUPENG include the influential Petroleum Tanker Drivers (PTD) whose members drive the petrol and diesel tankers that distribute the products from Lagos, where they are imported, across Nigeria. Virtually all the diesel and petrol used in Nigeria are imported and then distributed by road with tankers. A NUPENG strike could thus cripple the distribution of petrol and diesel across Nigeria and thus lead to a crisis in the sector and cripple the economy. NUPENG’s strike notice was contained in a statement jointly signed by its President, Williams Akhoreha, and General Secretary Afolabi Olawale, on Thursday. The Trade Union Congress (TUC) and the Nigeria Labour Congress (NLC) had on Tuesday said they will embark on an indefinite strike from 3 October over the prevailing hardship due to the removal of subsidy on petrol. The TUC said, “The strike is to demonstrate our resolve for a truly independent Nigeria; to take our destinies in our own hands and rescue our nation.” In a statement on Thursday, NUPENG said the government had demonstrated a high insensitivity and lack of respect and regard for organized labour and the Nigerian masses. “Consequent upon the joint resolution of the National Executive Council of the Nigeria Labour Congress and Trade Union Congress as the outcome of the joint National Executive Council meeting of the two Labour federations, held on 26 September 2023, we wish to inform all our members in the formal and informal sectors of the Nigeria Oil and Gas Industry and alert the general public that the rank and file members of our union are hereby directed to commence full mobilization and ensure unwavering compliance with the directive of the two Labour Centres to all affiliate Industrial Unions to embark on a nationwide industrial action from midnight of 3rd October 2023,” it said. It explained that the leadership of NUPENG found it so disturbing and unfortunate, that the federal government of Nigeria and other tiers of governments “are so insensitive to the excruciating and debilitating socio/economic pains Nigerians are passing through as a result of very harsh and sudden economic policies taken by this administration without any accompanying socio/economic policies to ameliorate and cushion the immediate effects and impacts those difficult and harsh policies are having on the citizenry.” It added: “Further worrisome to us is the apparent lack of regard and respect to the cries and yearnings of Organised Labour, Civil Society Organisations and the general public by this administration. “It appears the administration is arrogantly taking the goodwill and the tolerance level of the workers and Nigerians in general for granted. This arrogance is demonstrated clearly and loudly by the ways and manners of meetings with organized labour and outcomes of such meetings are taken with levity and disrespect. “The Nigeria Union of Petroleum and Natural Gas Workers (NUPENG) is aware of the huge impacts a 24-hour industrial action by organized labour can have on businesses and the socio/economic lives of the nation, unfortunately, the government’s actions and inactions are inextricably forcing the organized labour to take this very hard and painful route of last resort to demand for needful socio/economic policies to ameliorate and cushion the debilitating and dehumanizing living conditions of Nigerians generally. “Beyond any reasonable doubt, the government has demonstrated a high insensitivity and lack of respect and regard to organized labour and the Nigerian masses. “Therefore, it is in the light of the above, that NUPENG as a responsive and responsible affiliate Union of the Nigeria Labour Congress (NLC), will fully comply with the resolution of the joint NEC meeting and we hereby direct the leaders in the four (4) Zonal Councils of our great Union to mobilize all our members in the formal and informal sectors to shut down services effective 3rd October, 2023. “All NUPENG members, including the Petroleum Tanker Drivers (PTD), Petrol Stations Workers (PSW), Liquefied Petroleum Gas Retailers (LPGAR) and all other allied workers in the value chain of petroleum products distribution must comply with this directive from midnight of Tuesday, 3rd October 2023.  “All Branches and Units of our Union are to take note and ensure full compliance by setting up Compliance and Monitoring Teams in all operational locations. Our Solidarity remains constant, for the Union makes us strong.” President Bola Tinubu had on 29 May announced the removal of fuel subsidy. The development led to hardship for many Nigerians with its attendant increase in the prices of goods and services.",
    "Lawyer recounts how he was assaulted at SSS office": "A lawyer, Douglas Ogbankwa, has recounted how he was assaulted by officers of the Lagos State command of the State Security Service (SSS), where he had accompanied a client to answer a case. Mr Ogbankwa, who is also the Director of Strategic Communications of African Bar Association, narrated his ordeal which he said left him in a lingering fear for his life, in a thread of tweets he shared via his X (formerly Twitter) handle on Tuesday. “I am presently scared for my life as the man holding the gun said if I come to the DSS Office again, they will gun me down,” the lawyer wrote of his traumatic experience at the SSS office. DSS, which stands for the Department of State Service, is the spy agency’s self-chosen name contrary to the State Security Service (SSS), given it by its enabling law. In the episode that began with his dogged efforts to defend the interest of his client, according to Mr Ogbankwa, the officers of the agency rained slaps on him and dragged him on the floor before sending him into an underground cell. According to him, he was abused after his insistence to be present while his client put down his statement. According to him, the Administration of Criminal Justice (ACJ) Act 2015 entitles him as a lawyer to be with a client while making a statement to a law enforcement agency. “I visited the DSS Office with my client and we were at the Waiting Room when two different ladies at intervals wanted to take my client to go and make a statement without my presence. I protested that I needed to be present by the provisions of the ACJA,” he wrote. Mr Ogbankwa said his insistence to join his client in writing his statement drew the anger of the Principal Staff Officer (PSO), Operations and Intelligence of the agency. He said the official, decked in a blue native attire but whose name he did not give, shouted at him and ordered him to back out. “It was at this point, I informed him that I was not a Kindergarten pupil that should be pushed around, because he was very uncouth, rude and aggressive. He then said I should leave the Office and I told him, the DSS Office is an Agency of the Federal Government and I was a freeborn, who should be able to access the same at reasonable hours of the day. “It was then I asked my client that we should leave. We were leaving when the PSO Operations and Intelligence asked that they should lock the gate that I was under arrest. “I informed him that being assertive is not a crime, but a right as we are in a free society,” he stated. The lawyer said the official’s reaction afterwards was to land a slap on his face, followed by a flood of over seven slaps from other officers who swooped on him on their boss’ order. He wrote: “He slapped me immediately and asked his boys to bundle me into an Underground cell. I was dragged on the floor, cleared from my leg; I received over 7 slaps and blows. “I stood up and informed them that they were no longer doing SSS Business, but their personal business as I do not know the State Command Officers to act this way. This PSO Operations and Intelligence is new and lawyers have really suffered in his hand.”  He said his assailant scorned his threat to ensure the Nigerian President heard of their misconduct. He said they responded by saying “they are the President’s boys”. “One of them even said they will kill me here and nothing will happen.”",
    "Biden appoints Nigerian Americans to Advisory Council": "US President Joe Biden has appointed two Nigerian Americans to the President’s Advisory Council on African Diaspora Engagement. Chinenye Ogwumike and Osagie Imasogie are among the 12 members appointed to the council within the Department of State. “These 12 leaders have all played important roles in strengthening United States-Africa relations and shaping United States foreign policy toward Africa,” US Secretary of State Antony Blinken said, adding that they reflect the diversity of the African diaspora from African American and African immigrant communities. He said he would rely on their advice and counsel on how to strengthen cultural, social, political, and economic ties between African communities and the African diaspora. Abike Dabiri, chairperson of the Nigerians in Diaspora Commission, while congratulating the duo said their appointment serves as a source of inspiration for not only Nigerians but also Africans at large. In a statement by the commission’s spokesperson, Abdur-Rahman Balogun, Mrs Dabiri described the appointment as a highly positive and welcomed development. Ms Ogwumike is a two-time WNBA All-Star with the Los Angeles Sparks. She is also a full-time sports commentator on ESPN and an NBA analyst. She achieved the WNBA Rookie of the Year award in 2014 and holds a degree in International Relations from Stanford University. In 2020, she achieved the historic milestone of becoming the first Black woman to host a daily national sports talk radio show. Mr Imasogie is the Chairman of Quoin Advisors and an SEC/FINRA registered Broker-Dealer. He co-founded PIPV Capital, a private equity firm that has invested over $1 billion in life sciences. With a diverse career, including senior roles at pharmaceutical giants like GSK, Smithkiline Beecham, and DuPont Merek, he has also been a Price Waterhouse Corporate Finance Partner and an attorney. He is a trustee of the University of Pennsylvania and chairman of the Board of the University of Pennsylvania Carey Law School. He received master of law degrees from the London School of Economics and the University of Pennsylvania Carey Law School. Mr Imasogie is a member of the New York State Bar. Support PREMIUM TIMES' journalism of integrity and credibility Good journalism costs a lot of money. Yet only good journalism can ensure the possibility of a good society, an accountable democracy, and a transparent government.  For continued free access to the best investigative journalism in the country we ask you to consider making a modest support to this noble endeavour. By contributing to PREMIUM TIMES, you are helping to sustain a journalism of relevance and ensuring it remains free and available to all. TEXT AD: Call Willie - +2348098788999",
    "Impeachment: Lawyers disagree as Ondo lawmakers ignore court order on move against deputy governor": "Lawyers in Ondo State have weighed in on the process going on in the state House of Assembly for the impeachment of the state’s deputy governor, Lucky Aiyedatiwa. The House of Assembly, led by Olamide Oladiji, served Mr Aiyedatiwa with a notice of 14 allegations and has directed the chief judge to set up a seven-member panel of inquiry to investigate the allegations. This was despite Mr Aiyedatiwa obtaining a court order restraining the House on the matter, pending the determination of his case, for which hearing the court has fixed 9 October. Is the House right in insisting on proceeding with the process despite the court order? What do residents of the state think about the effort to kick Mr Aiyedatiwa out of office? PREMIUM TIMES spoke with some lawyers in the state. Two constitutional lawyers, Jiti Ogunye, and Femi Emodamori, faulted the steps that Mr Aiyedatiwa have taken towards stopping the impeachment process. The two lawyers chided the deputy governor for running to the courts when he was yet to be served the impeachment notice. They argued that Mr Aiyedatiwa abused the court process when he sought to stop the procedure even before the commencement of the process. Speaking on a programme on Television Continental (TVC), Mr Ogunye described the deputy governor’s action as a clear violation of the constitution. He said Mr Aiyedatiwa approaching the Federal High Court instead of the state high court, and suing the governor, House of Assembly and the chief judge, were wrong. Mr Ogunye said the deputy governor should submit himself and answer the allegations levelled against him. “The issue of principle here is that there is a route under Section 188 of the Constitution. That route says that in seven days you should receive a notice served by the Speaker on the holder of the office, be it governor or deputy governor. Within 14 days, a vote is taken, if two-thirds pass the matter, it goes to the chief judge of the state within seven days and then a panel is set up within three months and the report comes in,” Mr Ogunye said. “After the report comes in, if the report says no misconduct has been committed, the matter ends there. If it says misconduct is proven, then the person is impeached. That’s the process. And so, if at the tail-end the process is not followed, the holder of the office has a recourse to have him restored to power. “The second one is the federalist principle which is very dear to me. You are a deputy governor of a state, you have a state high court, you are suing everybody in that state, including the chief judge of that state, and you are taking them to a federal government court? That offends my federalist principle,” he said. Mr Emodamori on his part, argued that if the state assembly follows section 188, sub-section 1-9, no court as stipulated in section 10, has the power to intervene. ”It is only when there are pure breaches of the law that the court may intervene. Now, His Excellency hasn’t even been served, the notice. It was initiated by 11 members of the House, more than one-third required, he didn’t wait to be served.  “The law says it should be served within seven days. He rushed to court the following day that he had not been served, saying it was a violation of his rights. Then I have just seen another suit filed by my respected colleague, Ebun-olú Adegboruwa, and I have read the processes. “He’s alleging violation of his own right to fair hearing that he’s not been served. That it’s within social media even when section 188 says he should be served within seven days and it’s not yet seven days.",
    "Brain Drain: In one week three doctors die in Lagos hospital, colleagues kick": "Last week, within the space of five days three senior medical doctors at Alimosho General Hospital (ALGH), Igando, in Lagos, died under what some of their colleagues described as demeaning circumstances. The three medical practitioners, identified simply as Messers Otukoya, Aluko and Shuaib, were principal medical officers at the Lagos State-owned health facility. The development, which has thrown their colleagues under the umbrella of the Lagos State chapter of the Medical Guild and the Nigerian Medical Association (NMA) into mourning, has been blamed on the negative impacts of the exodus of Nigerian healthcare workers abroad. The Medical Guild in a statement issued over the development said the circumstances leading to the demise of the doctors “might have been related to chronic illnesses believed to be aggravated by stress.” In its reaction to the development, the Medical Guild declared a three-day mourning period across the Lagos State Health System in a statement Monday signed by the Chairman and Secretary, Sa’eid Ahmad, and Moruf Awodun, respectively. The association also issued a 48-hour ultimatum to Governor Babajide Sanwo-Olu to convene a “meaningful engagement” with the Medical Guild on all welfare matters affecting doctors in Lagos State, decrying the impact of brain drain in the health sector. The group also noted in the statement that the general welfare and well-being of doctors and other health workers in the state has for long been a subject of “relentless discussions”. “The devastating phenomenon of brain drain, and its attendant work overload for the doctors remaining onshore, and the negative consequences of severe manpower shortage has been repeatedly emphasised,” the statement reads in parts. “The Medical Guild, only 10 days ago forwarded a concise but wide-covering Position Paper to Mr Governor, centred on the need to Declare a State of Emergency in the Health sector and activate immediate palliative, medium and long-term welfare incentives for the doctors and health workers in the state.” Meanwhile, as part of its resolutions on the development, the association directed its members to embark on a three-day mourning period, even as it instructed the colleagues of the late doctors at Alimosho General Hospital (ALGH) where they had practised till their death to embark on skeletal services. The association said, “All elective procedures are to be rescheduled within this period.” “Only emergencies are expected to be attended to. This is in deference to the deep psychological state surviving colleagues in that centre must be going through, and as a mark of respect for these fallen heroes,” it noted. Some patients who were unaware of the development and visited the hospital were asked to return home. Meanwhile, when PREMIUM TIMES contacted the Lagos State Ministry of Health for comment, its spokesman, Tunbosun Ogunbanwo, said the government has since been on the matter. In a telephone interview with PREMIUM TIMES Wednesday, the Chairman of the Medical Guild, Mr Ahmad, confirmed that the state government had acknowledged the 48-hour ultimatum issued by the body to address the poor welfare situation of healthcare workers in the state.  “There is no strike. We have only given an ultimatum for the commencement of meaningful engagement, and we have received an official invitation to meet with the government this week,” Mr Ahmad said. “It is that meeting that will determine our next action as we have our congress coming up this Saturday.”",
    "Mobile cyber threats rising in Nigeria, others – Report": "Africa has become one of the hotspots of mobile cyber threats in the world, according to new research published Thursday by Kaspersky, a global cybersecurity and digital privacy company. The report indicates that threats to mobile devices increased in the second quarter of 2023.",
    "NiMet lists Nigerian states to experience heavy rainfall in next three days": "From the early hours of Friday, the Nigerian Meteorological Agency (NiMet) says, “extreme heavy rainfall” is expected over parts of Taraba and Adamawa states. NiMet forecasts “heavy and moderate rainfall” in parts of Borno, Gombe, Yobe, Plateau, Kaduna, Jigawa, Kano, Cross River, Akwa Ibom, Abia, Imo, Rivers, Bayelsa, Anambra, Delta and Enugu. During the forecast period, 24 hours of accumulated rainfall is very likely, NiMet noted, adding that the extreme heavy rainfall can cause flash flooding, riverine flooding, soil erosion, thunder and lightning, and strong winds. The forecast shows that this extreme rainfall can result in large-scale displacement of people due to floods, outbreaks of waterborne diseases, damages to infrastructure (roads, bridges, …), loss of lives, injuries, reduction of visibility, interruption of vehicular traffic. To avoid these hazards, NiMet calls for civil protection service and Disaster Risk Management (DRM) authorities to activate contingency plans for disaster preparedness and emergency response (awareness, assistance to victims, search & rescue operations), and be in close touch with National Hydrological Meteorological Services (NHMS) for further accuracy at the national level. In the multi-hazard high impact forecast issued on Thursday, NiMet said low to moderate rainfall is expected over places in Bauchi, FCT, Edo, Kogi, Benue, and Kano state. Other parts of the country will experience little or no risk of hydrometeorological hazard, NiMet said. It also forecasts “some chances of high temperature (38 – 41oC) over parts of Borno and Yobe State” on Friday. Elsewhere in the country, there is little or no chance of temperature-related hazards due to the low to moderate temperatures that are anticipated, the agency said. On Saturday, NiMet envisaged heavy and moderate rainfall over parts of Adamawa, Taraba, Jigawa, Bauchi, Katsina, Kano, Zamfara, Niger, Kaduna, Kwara, Kogi, Nasarawa, Edo, Delta, Osun, Ogun, Ondo, Ekiti and the FCT. There are also prospects of low to moderate rainfall in parts of Yobe, Bauchi, Sokoto, Kebbi, Ogun, Kano, Imo, Bayelsa, and Delta state. “There are slim chances of moderately high temperatures especially over parts of Lagos, Ogun and Delta State,” the advisory read. “Elsewhere in the country, there is little or no chance of temperature-related hazards due to the low to moderate temperatures that are anticipated.” On Sunday, according to NiMet, there could be moderate rainfall over parts of Sokoto, Zamfara, Taraba, Adamawa, Edo, Delta, Ondo, Ekiti, Osun, Ogun, Lagos, Oyo, Kwara and Niger State Meanwhile, low to moderate rainfall is expected over places in Sokoto, Zamfara, Kogi, Kebbi, Kano, and Taraba state. There is little or no risk of hydrometeorological hazard in other parts of the country, NiMet said.  In the same vein, there is little or no chance of temperature-related hazards due to the low to moderate temperatures that are anticipated on Sunday. Between Friday and Sunday, NiMet said, there are chances of very strong winds to affect the extreme northern parts of the country (Niger, Kebbi, Zamfara, Sokoto, Katsina, Kano, Jigawa, Kaduna, Bauchi, Yobe, and Borno States).",
    "Election tribunal upholds Gov. Uba Sani’s victory": "The governorship election petition tribunal sitting in Kaduna has upheld the victory of Uba Sani, the governor of Kaduna State, in the 18 March governorship election in the state. Mr Sani was the candidate of the All Progressives Congress (APC). His election was challenged by the first runner-up, Isah Ashiru of the Peoples Democratic Party (PDP). The three-member panel led by Victor Oviawe declared that the PDP and its candidate could not validate their claim that the election was rigged. The verdict was announced via Zoom on Thursday. According to Channels Television, whose reporting crew was granted physical access to the court, in a split judgement of two to one, the panel’s lead justice dismissed the petition on the ground that the pre-hearing notice was filed out of time and therefore deemed to be abandoned. The tribunal chairman and another member held that the appeal brought by the PDP and Mr Ashiru wasn’t meritorious because the filing of the pre-hearing notice “was abandoned and out of time, and therefore had dealt the entire petition a fatal blow.” However, the tribunal noted that if the petition had not been dismissed for lack of merit, it would have ordered a supplementary election in 22 polling units within 90 days. Mr Sani polled 730,001 votes to defeat his closest rival Mr Ashiru who scored 719,196 votes. The Labour Party (LP) candidate, Jonathan Asake, came a distant third with 58,283 votes, while Suleiman Hunkuyi of the New Nigerian Peoples Party (NNPP) scored 21,405 votes. While the LP and NNPP accepted the outcome of the election, the PDP and its candidate rejected the results, alleging that the Independent National Electoral Commission declared the wrong candidate the winner. The PDP and Mr Ashiru alleged that there were massive irregularities and manipulation of results in favour of Mr Sani in some local governments. They insisted that Mr Sani did not score the highest number of valid votes cast in the election and ought not to have been returned the winner of the election. At the last sitting of the court on 3 September, all parties presented their final written addresses before the tribunal, with APC’s legal team led by a former Attorney General of the Federation and Minister of Justice, Bayo Ojo, arguing that the petitioners had in fact helped to prove that his client won the election free and fair. He pointed in particular to the admission of one of the petitioner’s witnesses, Bonett Gwazah, a senior system analyst in the VR/ICT department of the INEC in Kaduna State. The PDP, however, argued that two conflicting election results emerged from INEC.  The party’s legal team led by Oluwole Iyamu, SAN, accused INEC of manipulating the election results in favour of Mr Sani. In a statement, the governor’s spokesperson, Mohammed Shehu, said Mr Sani lauded the judgement describing it as a win for democracy and a validation of the people’s will and above all, God’s decree.",
    "Gov Obaseki responds to deputy governor’s apology": "Governor Godwin Obaseki of Edo State has responded to an apology from his deputy, Philip Shaibu, over a face-off between them. There has been a face-off between Messrs Obaseki and Shaibu after the deputy governor asked a court to stop an alleged plot by the governor to remove him from office. Mr Obaseki had denied the allegation and subsequently accused Mr Shaibu of manipulating the youth council election in Edo State because of his (Shaibu’s) interest to contest for the 2024 governorship election in the state. The feud between the two appeared to have gotten messier in August when the governor sacked Mr Shaibu’s aides after the deputy governor staged a walkout during a colloquium in the state. The deputy governor had staged the walkout after his media aides and security details were denied entry at the colloquium organised by the state government to mark the 60th anniversary of the Midwest Referendum in the state. The governor, in the heat of the feud, relocated the deputy governor’s office out of the Government House. In a fresh twist last week, Mr Shaibu, the embattled deputy governor, tendered a public apology to the governor over the face-off. “I use this medium to appeal to Mr Governor, if there is anything that I don’t know that I have done, please forgive me so that we can develop our state together,” Mr Shaibu said while addressing reporters in Benin, the state capital. “We have just one year to go. We have been the envy of the entire country. So, Mr governor, if there is anything you feel that I have done, please I am sorry. I need us to work together to finish well and strong,” the deputy governor added. In a statement on Thursday, Mr Obaseki, said he had noted the “public apology” from his deputy, stressing that the apology followed “an aberrant behaviour that contradicts” what people of the state stand for. The governor recalled how Mr Shaibu “needlessly filed unfounded petitions in Nigerian courts” restraining him (Obaseki), the state assembly and security agencies from “a non-existent” impeachment process against the deputy governor. He accused the deputy governor of repeatedly breaching protocol, carrying out unwarranted and unprovoked attacks in the media against him as well as the state government. “The media frenzy as a result of the above and more, provided an impression of crises that has been precarious and distasteful to Edo people in the state and across the world,” Mr Obaseki said. The governor, however, said he had decided to forgive the deputy governor for his actions following the apology. “Although these unwarranted provocations caused me severe personal discomfort, as a person of faith, I am under obligation to accept this apology because as they say, ‘to err is human, to forgive is divine.’  “In good faith, I trust that the public apology as expressed by the deputy governor is genuine and followed by contrite steps to improve his conflict resolution skills,” he said. Mr Obaseki enjoined the deputy governor to guide his “proxies” to act in accordance with his “piety.”",
    "Fuel Subsidy: NEC urges labour to shelve strike": "The National Economic Council (NEC) has urged the Nigeria Labour Congress (NLC) and the Trade Union Congress (TUC) not to abandon dialogue in their quest for better welfare for their members. The Council also appealed to the unions to suspend its planned nationwide indefinite strike schedule to start on 3 October. Governor Caleb Mutfwang of Plateau State stated this while briefing State House Correspondents at the end of the NEC meeting on Thursday in Abuja. He said that the nation was at a very critical moment in its history, adding that some state governors took over such labour crises when they assumed office in May. According to him, some states just resolved the crises and it will be unfair for the labour to return to another industrial action. The governor said that the proposed industrial action would have immense effect on the economy of both the states and the federal government. He said that the NEC expressed genuine concern about the situation in the country and appealed for calm and patience among Nigerians. “The National Economic Council (NEC) deliberated on the planned indefinite strike by the National leadership of the Nigeria Labour Congress (NLC) to proceed on an indefinite strike on 3 October, 2023. “The council noted further the implications of the planned strike on the economy and the nation and thus urge members to continue to engage with the leadership of their respective states. “It appeals to them to suspend the action and to continue on the path of dialogue with the federal government. This is the appeal of the council.” He said that the council appreciated the concerns raised by the NLC to have those issues address, adding that NEC also appealed for time to address the concerns of labour. “We also believe that President Bola Tinubu will be addressing the nation on 1 October, and some of the concerns of labour will be appropriately addressed in the president’s speech. “It is therefore important to note that it’s a federation issue, so whatever happens the labour is represented in all the 36 states and the Federal Capital Territory (FCT). “And NEC is appealing that discussion should continue at the state levels because there will be peculiarities as to the issues to be addressed concerning the demands of labour and therefore dialogue is the way to go.” (NAN)  Support PREMIUM TIMES' journalism of integrity and credibility Good journalism costs a lot of money. Yet only good journalism can ensure the possibility of a good society, an accountable democracy, and a transparent government. For continued free access to the best investigative journalism in the country we ask you to consider making a modest support to this noble endeavour. By contributing to PREMIUM TIMES, you are helping to sustain a journalism of relevance and ensuring it remains free and available to all. TEXT AD: Call Willie - +2348098788999"
}