{
    "Kaduna tribunal declares Gov'ship election inconclusive": "The Governorship Election Petition Tribunal sitting in Kaduna has declared the Kaduna governorship election inconclusive.\nThe petition was filed by the Peoples Democratic Party’s candidate, Isah Mohammed Ashiru against Uba Sani of the All Progressives Congress in the 2023 governorship election held in the state on March 18, 2023.\nIn a split decision of a ratio of 2:1, the three-man tribunal panel led by Justice Victor Oviawe declared that the election was inconclusive and thus directed that a supplementary election should be held by the Independent National Electoral Commission within 90 days.\nThe PUNCH reports that the Peoples Democratic Party had headed to the tribunal to challenge the election of Uba Sani as the sitting Governor of Kaduna State.   Related News   Kaduna tribunal rejects Sani’s motion to dismiss Ashiru, PDP’s petition  Tribunal to deliver judgement on Kaduna gov poll virtually  BREAKING: Ebonyi PDP vows to appeal tribunal's judgment   \nThe PDP had baked its arguments on the grounds of alleged irregularities and electoral fraud, deposing that its candidate (PDP candidate), Isa Mohammed Ashiru, won the election.\nThe tribunal ruled further that INEC is to conduct election in seven wards, four local govts, 24 polling units consisting of 16,300 registered voters.\nDuring the hearing of the petition, the PDP and Ashiru called 24 witnesses and presented claims and documents to prove their case.      \nThe PUNCH had earlier reported that the tribunal will deliver the judgement virtually (on Zoom).",
    "Leah Sharibu: Recent reports confusing, disheartening, unsubstantiated rumours - Parents": "Parents of Leah Sharibu on Thursday broke their silence on the insinuations concerning the marital status and whereabouts of their daughter describing such thoughts as both confusing and disheartening.\nThey wondered why they should believe unsubstantiated rumors and scant information that “local security sources made this revelation in a report.”\nThe spokesperson for the parents and President of Leah Foundation, Dr Gloria Puldu, made the clarification in a statement she sent to The PUNCH, following insinuations that Sharibu already had two children and had married another man after reportedly divorcing her first husband.\nWhile calling on President Bola Tinubu to act fast, they recalled that till he left office on May 29 2023, President Muhammadu Buhari did not act on the promise he made to free Leah Sharibu two years after her abduction, adding that the international community had abandoned Leah and others still being held captive. \n“The global community seems to have forgotten Leah’s plight (and other girls like her) and allowed Nigeria to devolve into the chaos that it is currently in. No one is demanding accountability or transparency from Nigeria, but continues to give billions of dollars in aid and relief. Leah remains a captive to a militant religious group within Nigeria without any apparent knowledge of her whereabouts”, they said.\nLeah Sharibu was one of the 110 female students of the Government Girls’ Science and Technical College, Dapchi, Yobe State, who were abducted on February 19, 2018, by Boko Haram terrorists.\nWhile others were released by the terrorists following negotiations, Leah, then 14 year-old, is still being held captive because she refused to renounce her Christian faith.      \nThe PUNCH reported that there were insinuations that Leah Sharibu held by members of Islamic State West Africa Province has “remarried” another terrorists’ commander, after purportedly securing a divorce from the first ‘husband’ forced on her.\nLeah, after the purported divorce from one Abdulrahman, it was alleged, was remarried to another ISWAP commander in the Lake Chad area named Ali Abdallah.  Related News   Leah Sharibu has been married thrice — Activist  Rivers APC expresses shock over Tinubu's appointment of PDP members  Tinubu begs US court not to release privileged documents   \nBut her parents described the allegations as confusing and disheartening.\nThe statement by Puldu reads, “Recent reports on Leah Sharibu, the young girl taken captive by ISWAP terrorists over five years ago, is both confusing and disheartening. It’s confusing because there have been unsubstantiated rumours and scant information regarding the whereabouts of Leah. There were a few reports by those who were released or had escaped claiming that she might have been married off and given birth to two children. No pictures, audio or video has ever surfaced and, If anything, these were assumptions based on her age and condition of captivity.\n“Why should we believe, “Local security sources made this revelation in a report”? If they have intelligence on Leah’s whereabouts and any information, then where are the Nigerian armed forces? Why isn’t the government involved in securing her release?\n“It’s disheartening because only so often do we hear anything on Leah Sharibu. On the two-year anniversary of Leah’s capture, President Buhari said that, “…we redouble our efforts for Leah’s return, we can never allow the terrorists to divide us…”. Nathan and Rebecca Sharibu are asking what happened to that promise? Buhari left office without fulfilling that promise of rescuing our daughter, Leah. Our family remains grief-stricken by our daughter’s capture and ongoing imprisonment, even as the Nigerian government has been unsuccessful in securing her release.\n“In March 2020, Leah’s father, Nathan Sharibu pleaded, ‘I have not heard anything from federal, state and local governments since my daughter was abducted. I am even confused now. I need your assistance to put pressure on the Federal Government to do something about the release of my daughter.’        \nPuldu said it had been so sad that abductions of students were still ongoing even in the new administration of President Bola Tinubu.\nShe said, “About a week ago we woke up to the news of students abducted from Zamfara. This is very shameful and disheartening to Nigerian parents. Despite the terrible economic hardship, parents still have to grapple with the safety of their children in school. We are calling again with a very strong and loud voice on the current government led by President Bola Ahmed Tinubu to please wake up to its very primary responsibility of safety and protection of the lives and properties of Nigerian citizens.\n“We demand the rescue of Leah Sharibu and all others who had in captivity in the hands of terrorists.”",
    "Poorly paid, bruised and gagged,  Nigerian referees breathe new life": "In this special report ABIODUN ADEWALE takes a look at the plight of Nigerian referees who have been victimised while doing their jobs in the domestic league\nAt the mention of Nigerian referees, two perceptions easily come to mind.\nIn the first instance, they are largely perceived as one of the ‘enemies’, if not the principal ‘enemy’ of Nigerian football.\nOn the other hand, they are pathetically seen as the ‘victims’ of the dangers of Nigerian football. Depending on who you ask, either of the perspectives would be proven beyond reasonable doubts. \nAn average Nigerian league player or coach has the most horrible stories to tell about referees in all the tiers of the country’s league, but ironically, a lot of them maintain relationships with these refs off the field of play.\nFootball administrators are also on either side of the divide, depending on how mutual their relationships with the men in the middle is. For the fans, they can only watch from afar and wonder why certain things they can’t comprehend happen in the game they love so much. And when results don’t go their way, they vent their anger on the refs, inflicting serious injuries on them, in some cases.\nFrom the Nigeria Professional Football League to the Nigeria Women’s Football League and the lower tiers of the men and women’s game in the country, there are different circumstances that have shaped these perspectives.      \nAs a result of being perceived as enemies of their teams by overzealous fans, Nigerian refs have been assaulted on many occasions due to circumstances beyond their control, thus making them the victims and enemies of the game at the same time. It is hard to recall any situation where the referees have been applauded openly as much as they are given the stick.\nFirst experience \nWhile the crazy culture of assaulting referees has been a long-time occurrence in the Nigerian leagues, our correspondent first witnessed it in 2015 at the Ondo State Sports Complex in Akure, during an NPFL game between Sunshine Stars and Lobi Stars.\nIt was the run-in to the end of the season and Sunshine were on course for the title as well as a return to the continent. Needing a win to keep up their neck-and-neck race with Enyimba and Warri Wolves, the Akure side were frustrated by their resilient visitors, who struck them against the run of play to take a 3-2 lead with time fast running out.\nWith about 10 minutes left on the clock, projectiles began to fly onto the pitch after what the fans perceived as unfavourable officiating towards their darling team. The home fans made the atmosphere uneasy and it became impossible for the centre ref and his assistants to continue the game, much to the anger of the fans.\nSunshine Stars players, perhaps aware of the consequences of such acts, went round the stands to appeal to their fans, but their pleas fell on deaf ears. Eventually, the game did not continue as the officials were stranded on the pitch, leaving them at the mercy of unruly fans, who were bent on dealing blows and sticks on them. The referee and his assistants had to be wheeled away in a vehicle thought to belong to the then chairman of the Ondo State Football Agency, Akin Akinbobola, which was driven straight onto the pitch and the sticks that could have landed on the officials landed on the car instead.\nThe last 10 minutes of the game was played in Abuja and Sunshine Stars were subsequently banned to the Teslim Balogun Stadium in Lagos for the remainder of the season.        \nRefs beaten again in Akure\nNot the NPFL this time around but a Nationwide League One game between Akure City and Hammola FC from Osun State in 2022. In what would have been described as a good outing for the away side, who got a 2-1 victory over their hosts, the outcome of the game set up the officials for beating as locals perceived them as biased against the home team.\nJust before full time, the fans converged on the side of the pitch, with various items they could lay their hands on, threatened all cameramen to stop recording and pounced on the centre ref and one of his assistants, who ran across the pitch helplessly.\nPlayers and officials of the home team were as surprised as their visitors and the actions of their unruly fans cost them their slot in the NLO.\nRegular victims\nIn 2019, during the Nigeria Professional Football League Super 6 playoffs at the Agege Township Stadium in Lagos, Kano Pillars captain Rabiu Ali was in the middle of one of the biggest assaults on match officials after charging towards referee Adebimpe Quadri over what he perceived as biased officiating against his team.\nHis action fuelled the rage of the fans, who wielded sticks against the helpless officials. Although the player later denied abusing or attacking the referee, Ali was eventually banned for 12 games and Pillars fined N8m by the then League Management Company.      \nBefore the playoffs in 2019, the Nigeria Referees Association, threatened a boycott of games if their security at match venues was not guaranteed. This came after an attack on a ref, Bethel Nwanesi, during an NPFL match-day three game between Remo Stars and Bendel Insurance in Sagamu.\n“The weekly reports of attacks on referees at the match venues whenever home teams fail to win on their grounds since the 2018/2019 league commenced may have caused a change in the association’s approach,” the NRA said.\n“Recall that the sore point witnessed so far in the top Nigeria league that is in week three is the `one week, one attack on referee’ incidents.\n“In the week one match in Jos, Plateau, Plateau United vs Ifeanyi Uba FC, the referees were beaten blue and back by supporters of the home side because they drew at home. We also urge football authorities in the country to wade into the matter because the association is on the verge of asking its members to keep away from the league to avoid being killed by rampaging supporters,”\nthe NRA added.\nPerhaps that NRA’s statement was seen as a mere threat and truly they didn’t boycott matches. Rather, the only thing that changed was the pattern of attacks as it continued through 2020, 2021 and 2022.\nIn 2023, there has been at least two cases of assaults on match officials, which resulted in docking of accrued points and goals from the erring clubs after investigation by the authorities.  \nBayelsa United were the first club to be caught in the web of the Interim Management Committee of the NPFL after an assistant ref Ebenezer Ojeleye was attacked during their match against Doma United.\nBayelsa United later identified the perpetrator as Joseph Zidougha, popularly known as ‘One Man Riot’, but they were found guilty of breaching the frameworks of the league and subsequently had three points and three goals deducted from their accrued tally.\nTowards the end of the regular season as well, Plateau United were also found wanting of security breaches during their 2-1 loss to Remo at the New Jos Stadium. Aside from points deduction, a fine of N2.5m was imposed on the club.\nNotorious lower leagues\nPerhaps due to sanctions that are meted out to teams in the NPFL over fans trouble, there is usually a level of diplomacy that comes with burying it after it happens – although the punishment of fines and suspended points deduction didn’t totally prevent it from happening until recently.\nHowever, the lower leagues in the country are notorious for assaulting match officials with three barbaric cases in the 2023 Nigeria National League alone.\nEarlier this year, Smart City and Crown FC were charged by the Nigeria National League following the unruly behaviour of their fans, which led to an assault on referee Oni Stephen and his assistants. In a viral video which was obtained by our correspondent, the fans of Smart City made their way onto the pitch, assaulting match officials, inflicting bodily injuries and stealing items from them after the ref sent off one of their players, Tunde Adejokun.      \nIn another instance this year, a match official from Kano State, Shaarani Guza, lost his teeth after he was assaulted by irate fans of Yobe Desert Stars during their match-day five encounter with DMD FC of Borno. Yobe were fined N3m and forfeited three points and three goals from their accrued points in Group A4 of the Northern Conference of the NNL as a punishment.\nThe most recent and uncivilised incident in the lower league was at Awka, Anambra State, during a game between Edel FC and Giant Brillars, where the ref Charwal Wilfred, from Delta State, had his head broken, his assistants Asoluku Ihuoma from Imo State and Uhuegbu Femi of Delta State sustained varying degrees of injuries as well. The match commissioner Oyekezie Ekene from Enugu State was also not spared during the ugly incident allegedly spearheaded by Edel players.\nBlame game\nBefore the fans can tag refs as enemies of the game, the people directly affected by their decisions are the players and they also have harrowing tales of how they had been affected by poor officiating, even if they have also been caught in the web of leading attacks on referees.\n“One of the reasons Wikki Tourists didn’t survive relegation last season was due to poor officiating. So many crucial decisions went against us in different matches and there was no probe whatsoever,” Wikki forward, Fu’ad Ekelojuoti, told our correspondent.\nAfter their 2-2 draw against Enyimba in the opening game of the 2022/23 NPFL Super 6 playoffs, Remo captain Junior Nduka could not hide his anger after the champions were awarded a penalty for a foul he claimed to have committed outside the box.\n“I believe everyone saw this one on live TV, yes it was a foul but that was outside the box,” Nduka fumed.        \n“I have seen all types of officiating, in the NNL where I played a year ago, there was this away game we went for and we had the game under control, but then the referee frustrated us to ensure we lost because his life was at stake,” former 3SC striker Anthony Okachi also told The PUNCH.\n“Even in the NPFL people talk about how the home team always win. Then when I go for away games I feel like we are just going to honour the game. I can’t state all the really crazy decisions I have witnessed because there are so many.”\nFor the fans, no member of their group will charge  at an official.\n“We know ourselves and we are usually in uniform during our matches. None of us can do that because such can easily be pinned on the club. Our job is to support and entertain, which we do with passion. These acts are carried out by the so-called stadium boys that we cannot really tag as fans,” Tunde Adeboboye, the chairman of the supporters’ club of Sunshine Stars, told our correspondent.\nRefs horrible experiences\nAssaults have brought near death and traumatic situations for the men in the middle and most of the experiences point in the same direction; they are always at the mercy of the home fans, especially in the no-coverage areas of the stadium. According to them, not even live television coverage guarantees their safety.\n“The fact that a match is streamed live does not even factor into the protection of referees. This is because there is no coverage of what happens in the tunnels and even dressing rooms at half time. A lot has been reported by journalists, but you will only report what you see,” an active NPFL ref, who spoke on condition of anonymity, told The PUNCH.      \n“Ahmadu Bello Stadium in Kaduna is notorious for this, a referee was almost killed there in 2022, in a game between Niger Tornadoes and Lobi Stars. The match did not continue. The same thing happened during Jigawa Golden Stars versus Rivers United and Kano pillars versus Plateau United, all in Kaduna,” he said.  Related News   15 teams for 2021 Coal City Football League  Sierra Leone pro football league gets first female coach   \nA retired FIFA-badged referee, Henry Ogunyanmodi, narrated how he was assaulted in the dressing room during a live NPFL game in 2013/2014.\n“It happened to me in 2014 during a league game in Uyo between Akwa United and Warri Wolves. Interestingly, it was a live match and everything seemed to be going on well until halftime. In fact, Akwa United were leading 2-0. But surprisingly, when we got to the dressing room, they started beating us,” Ogunyanmodi told our correspondent.\n“Nobody knew what happened in the dressing room, so I decided we won’t continue the game because of our safety. After I observed the tunnel properly, I ran onto the pitch and I drew attention to the incident.\n“The second half of the game was played in Katsina and Akwa incurred the cost for the away team as well. I also remember that two of our colleagues had been victims there before. One retired FIFA female referee Felicia and another were beaten at the same venue before.”\nEven while the home team was in control of the game, Ogunyanmodi insisted that it is natural to suspect the home when such an incident happens because the state football associations of the home teams are supposed to provide adequate security. If there will be any breach, it will be as a result of their negligence or compromise.\nRefs’ deaths      \nAfter passing through all these difficulties to get their job done, there are instances where referees don’t make it back home, not because they were killed by fans but sadly because of road accidents caused by long journeys.\nIn February this year, an Imo State referee, Dr. Kingsley Eneogwe, died in a road accident on the Abuja-Kogi-Enugu road after returning from a match-day five game between Nasarawa United and Plateau United in Kaduna.\nWhy always refs?\nAmid all the patterns associated with the safety of refs while carrying out their jobs, sometimes the urge for soul searching will call for the question; ‘why would anyone even beat a referee?’\nThe popular opinion is that, most times, they are bribed by the home team to turn results in their favour, thereby leaving the away team at the mercy of poor officiating. But in contrast, assaults are allegedly carried out by the home fans.\nThe PUNCH gathered that refs under the then LMC were owed indemnities for several seasons, leading to an arrangement in which home teams took care of their fees like transportation, accommodation and even feeding.\nThe inability of the defunct League Management Company to fulfil its financial obligations to the men in the middle further cemented the notion that refs were at the mercy of home teams or even the highest bidders.      \n“No, referees are not being offered money. Would you offer money to a man you know cannot change the outcome of a match? Poor officiating is definitely not about money, it’s either about security, poor understanding of the laws of the game, lack of equipment for referees and poor physical, emotional and mental form,” Olalekan Daramola, an NPFL referee, told The PUNCH.\nAccording to Ogunyanmodi, in cases where home teams offer incentives in the guise of augmenting transportation or any form of allowances, it is more dangerous to reject such money than to accept it.\n“The mentality is that when you refuse, you have connived with the away team. And whether you accept or not, the away team will also suspect you. Due to the situation we had then, they are the one that will house you in a hotel and feed you. They are always with you. So, they will think you have something against them if you refuse,” Ogunyanmodi said.\nHe maintained that safety becomes an issue as soon as money is involved.\n“Regardless of the inadequate situation of the league body then, no referee will ever ask clubs for money. It is not possible, but it is the clubs who put us in difficult situations with their money,” he said.\nFor the sake of neutrality, the state football associations are supposed to be in charge of arrangements such as security, transportation and accommodation of the referees.\n“The state football associations are in charge of accommodation and feeding of the referees. But the FA is resident with the home team. Until we get to a point that home teams won’t know the whereabouts of designated officials for their games, that is when these notions will disappear,” Ogunyanmodi added.      \nDaramola rates the performances of the whistle men highly.\n“Officiating in the NPFL since I have been in the league has been relatively good. Sometimes at par with even the English Premier League. However, we have had some instances where there are some bad officiating, mostly caused by poor understanding of the laws of the game,” he said.\nEvidently, the results over the past three seasons have an average of at least one away win and three draws per week. A statistic that was hard to come by in the NPFL years ago. Also, match-day one of last season produced four away wins, while two other teams got invaluable draws away from home.\nFIFA, CAF shun refs\nIn recent years, there has been public outcry within the football sector about the inability of Nigerian refs to officiate in African and world football. As a successful footballing nation, the expectations of enthusiasts is to see Nigerian officials go as far as Nigerian football stars, but they have been overlooked for major duties in Africa and at the global level.\nOn this, Ogunyanmodi told to our correspondent that the problem was internal. He claimed the promotion and projection of refs for international tournaments and even getting the FIFA badge had been characterised by politics, a situation he said led to his early retirement from officiating.\n“My mates in other countries are still actively officiating, but I am retired. Not long after I got the FIFA badge, it was stripped off  me due to ethnicity. Surprisingly, it was handed to another person from the south west on the claims that the badge was not supposed to come to Ondo State when it came,” Ogunyanmodi lamented.      \nPresident of the Nigeria Referees Association, Sanni Zubairu, explained that there had been a gap in that area, which the body is now trying to adequately fill.\n“In terms of performance, Nigerian referees are equal to any referee in the world. We have been watching and projecting the younger referees, some of them are now badged as FIFA referees and we have been moving on with them. There is a sort of gap between the ones we had before and now, and that is what we are trying to fill up,” Zubairu told The PUNCH.\nNFF wants to install VAR\nGlobal football globally hinges on technology and one of the most important reasons for that is to reduce controversy to the barest minimum. World football body FIFA introduced the goal line technology in 2012 and more recently, the Video Assistant Referee, which gives the men in the middle the benefit of replays and reversal of decisions.\nBefore these two technologies, there were other basic communication technologies for refs that Nigeria is yet to invest on. In order to improve the performances of these officials, it becomes necessary to provide them with all the necessary support that will aid their work.\nEarlier this year, the Nigeria Football Federation boss, Ibrahim Gusau, announced that the body would build VARs in selected stadiums across the country, a proposal the NRA is already anticipating its implementation.\n“Football is now being played with technology and we must move with the pace of the world as well. If the NFF provides VARs in some centres, it will help the performances of our referees as well,” NRA president, Zubairu, said.      \n“On our own, according to our plans, we will ensure the adequate training of our referees to meet up with the best global practices.”\nImproved conditions? \nBefore the start of the abridged 2022/23 season, Chairman of the Interim Management Committee of the NPFL, Gbenga Elegbeleye, revealed that the defunct League Management Company owed referees to the tune of N500m.\nAs a result, the IMC created a new structure for the payment of referees’ indemnities through their partners.\n“Their money is calculated by the distance they travel to their match venues. We spend close to 10m on match officials every match-day. The least amount a ref can earn is N200,000 or N150,000 per match for transport and feeding,” an official of GTI Group, strategic partners of the NPFL, told our correspondent.\n“All the officials have their accommodations paid for, 48 hours before they arrive at their match venue. As they take off, they get their money and they know where they will lodge. We pay accommodation straight to the hotel, while feeding and transport allowances are paid in cash before they (refs) leave for their match venues.  Things have changed, it’s not like before.\n“The total money we spend on match days is between N9m and N10m and we pay all the FAs that are hosting matches for logistics. They don’t have anything to do with referees, match commissioners or assessors.”      \nThis move by the IMC is attested to by NRA boss Zubairu and Daramola.\n“Before the start of the season, NFF president Gusau met with us and gave us his assurances, particularly about the welfare and security of referees, and I can say that we saw it manifest last season,” Zubairu said.\n“The indemnities are being paid, most times days before you even go for your match. It makes it easy for referees to prepare for matches, referees don’t need to look around for money for transportation,” Daramola said.\nAside from the improved welfare of the referees, the IMC did not hesitate to slam punishments on clubs, just as it did not hesitate to punish any referee that was found wanting for questionable calls.\nThe IMC deducted three points and three goals each from Bayelsa United, Remo Stars, Wikki Tourists and Plateau United over reports of violence against match officials during their matches. After investigation, Remo and Wikki were spared but Bayelsa and Plateau didn’t escape the hammer.\nIn the case of referees, the committee of the NFF in January suspended Ndubuisi Ukah (Imo), Otuwho Morrison (Delta) and Faro Abdulrahman (Lagos) for questionable officiating.\nBut the questions remain — will the Nigerian football faithful ever trust the country’s refs to diligently carry out their duties without fear or favour? And how soon will these defenceless middle men be protected from irate thugs, who in the guise of fans, bruise and brutalise them because results don’t go their?      \nWhen this happens, then they will certainly be assured that rather than sow tears and sweat and reap blood, sorrow and deaths, they can earn a living in a safe environment where they will reap joy and meaningful lifestyles.",
    "Covenant, UI, FUTA emerge top universities in Nigeria": "Covenant University, University of Ibadan and the Federal University of Technology, Akure have secured top ranking in Nigeria according to Times Higher Education’s 2024 rating.\nAnalysis of the latest ranking showed that Covenant University is among the top 1,000 universities in the world.\nThough ranked first in Nigeria, Covenant University is placed within the global 801-1000 range.\nCovenant University, a private-owned institution, stands at the top spot in Nigeria, while the University of Ibadan followed in second and FUTA emerged third. \nThe University of Lagos and the University of Bayero emerged fourth and fifth in Nigeria, respectively.\n   Related News   FUTA student sets new record for longest speech marathon  Student’s death: NANS accuses FUTA of negligence  FUTA mourns as students protest death of colleague   \nThe Ranking Web said the World University ranking includes 1,904 universities across 108 countries and regions.      \n“The Times Higher World University ranking includes 1,904 universities across 108 countries and regions.\n \n“The table is based on our new WUR 3.0 methodology, which is carefully calibrated performance indicators that measure an institution’s performance across five areas; teaching, research environment, research quality, industry and international outlook.”\nOthers universities that achieve the top ranking is Nigeria include the University of Ilorin, University of Nigeria, Nsukka, Afe Babalola University, University of Benin, Federal Univ of Agric, Abeokuta, Ladoke Akintola University of Technology, Lagos State University, Nnamdi Azikiwe University, Obafemi Awolowo University, University of Port Harcourt.\nAmong the 15 top universities, nine are located in the South West, two in the South East, two in the South South, one in the North West and one in the North Central.",
    "[UPDATED] Chicago academic record: Atiku files reply to Tinubu's review application": "The legal team of the Peoples Democratic Party presidential candidate, Atiku Abubakar, has filed a motion to challenge President Bola Tinubu’s plea for Chicago State University not to release privileged documents in his academic records.\nThe Special Adviser to Atiku on Public Communications, Phrank Shaibu, disclosed to The PUNCH that the legal team had up to 48 hours to respond to the motion in the US court.\n Atiku had earlier secured an order for the CSU to make the President’s academic records available to his legal team.\nA magistrate, Jeffrey Gilbert, had last week ordered Tinubu’s alma mater to provide all relevant and non-privileged documents to the applicant within two days. \nAtiku is currently challenging the victory of the former Lagos State governor at the 2023 presidential poll and his recent affirmation by an election petition court in Nigeria.\nThe documents sought by the PDP candidate, through his counsel, Angela Liu, include the record of admission and acceptance at the university, dates of attendance including degrees, awards, and honours attained by the former governor of Lagos State at the university, among others.\nBut as the deadline given by Gilbert drew nearer on Thursday, Tinubu’s lawyers approached a United States District judge, Nancy Maldonado, arguing that the earlier decision by the former (Gilbert) needed to be reviewed by a district judge.      \nThe request for a review and delay of the order till Monday was eventually granted by the US district judge.  Related News   Nigeria moving to era of concrete roads, says Umahi  Ministers to face quarterly performance review  Tinubu, Nigerians await your power sector plan   \nTinubu’s application, filed by his lawyers, Oluwole Afolabi and Christopher Charmichael, advanced two reasons.\nFirst was that his academic records in issue are not useful in Nigerian courts as claimed by Atiku because the Nigerian election proceedings and the Nigerian courts have explicitly been unreceptive to the discovery.\nThe second reason given was that Atiku’s request is unduly intrusive because it allows Applicant (Atiku) to conduct a fishing expedition into intervenor’s private, confidential, and protected educational records.\n When asked on Wednesday to confirm if Atiku has filed the suit as he earlier threatened in Monday, Shaibu reassured our correspondent that the former vice president would submit the motion before midnight.\nHe said, “I am sure you have seen his application. We are working on our response. We have up till midnight today (Wednesday) to respond to them. And we will.”\nOn when they expect the court to rule over the matter, Shaibu stated that “It is after we have responded to the court, that it will fix the date and inform the parties.”        \nWhen contacted for reaction, Coordinator of Tinubu Presidential Legal Team, Babatunde Ogala, who spoke via phone from his base in the United States told, The PUNCH he would rather not speak on the development.\n“As I told you earlier, I am still on vacation,” he said.",
    "Varsity graduate attempts suicide over withheld results": "A graduate of Ambrose Ali University, Ekpoma, Edo State, identified as Precious Ogbeide, has attempted suicide over the alleged university’s refusal to issue him and several other students their results after they graduated from school in 2018.\nOur correspondent learnt that Ogbeide, whose parents claimed he had been battling depression due to his inability to be issued his results after spending five years in the school, started to stab himself with pieces of a bottle he had broken.\nSome aggrieved students of the school had lamented the inability to receive their degree results after spending five years undergoing the programme, claiming that the situation had demoralised them.\nAccording to them, they are facing a bleak future as a result of the development. \nPUNCH Metro learnt from the aggrieved students that the tertiary institution had been promising them that the backlog of results would be cleared and students who were yet to be mobilised for the National Youth Service Corps scheme would be settled.\nHowever, a source, who was privy to Monday’s incident, told our correspondent that Ogbeide became frustrated and decided to end his life over the matter.\nThe source, who craved anonymity, said, “I received a call at about 3:30 pm on Monday that Ogbeinde had been rushed to the hospital. I was told he had been showing signs of depression and that they had tried to help in every possible way they could.        Related News   Edo varsity graduates protest non-release of results five years after  Ambrose Alli varsity, ASUU differ on mass sacking  Police didn't arrest our lecturers for cultism, Ambrose Alli varsity says   \n“The mother told me that he just stood up all of a sudden with a bottle and smashed it on the floor. They told me it was a slip. But he started to pierce his neck and body with the pieces of the broken bottle.\n“It was the efforts of his relative present at the time of the incident that overpowered him before he was rushed to the hospital where he is currently receiving treatment.\n“He said he was tired of everything. He said he had not been able to face his parents and family members after going to school for five years without any result to show for it.\n“He could not get a job because they kept asking him to provide his certificate. He said any time he met those who could help him get a job, they would tell him to wait for his result. He was just fed up with the whole thing and became frustrated that his future was on hold.”\nMeanwhile, the school, through the Head of Corporate Communications and Protocol, Mike Aladenika, had told PUNCH Metro that the students affected by certificate and result issues might have had issues with some courses during their time in school.\n“If you had graduated and done all you were asked to do while you were a student, you would not have problems with your results.\n“Some of the students who did not take cognizance of the deficiencies they had with their courses are the ones facing these challenges,” Aladenika stated.",
    "Food prices jump by 31%, says NBS": "Ebonyi and Abia states led as food prices jumped by 31 per cent within in 12 months from July 2022 to July 2023.\nThis is according to an analysis of the ‘Selected Food Price Watch,’ a report published on a monthly basis by the National Bureau of Statistics.\nThe selected food items include staples such as rice(1kg), beans(1kg), bread (500g), tomatoes, beef, wheat (2kg), garri(1kg) and palm oil (1 bottle).\nAccording to the reports, the highest food price increase was recorded in the price of yam, which jumped by 42 per cent, from N389.75 in July 2022 20 N539.41 in 2023. \nThis was closely followed by the price of one kilogram of rice, which increased from N467.80 to N653.49 within 12 months.\nIn the same vein, the price of palm oil went up by 35 per cent, from N890.67 to N1208.62 during the period in review.  Related News   FG earned N4.3tn from oil in 2021 – Report  Global debt hit $307tn in H1 – IIF  ‘Imported food prices rise by 89% in four years’   \nOther staple foods which contributed to the food price hike included Garri (1kg), which increased by 33 per cent, from N323.17 to N429.89. 500g of sliced bread also increased from N486.27 to N651.78 (+34 per cent).      \nA kilogram of tomato (N446.81 to N557.96), Wheat (2kg) (N1094.72 to N1419.14), and Beef (N2118.84 to N2758.13), also accounted for some of the staple food items which recorded significant price spikes.\nFurther analysis of the report showed that South-Eastern states, led by Abia and Ebonyi recorded the highest food prices during the twelve-month period.\nOn the other hand, states within the North Central (Kogi, Niger, Benue) recorded the lowest food prices during this time.\nIn its latest Consumer Price Index, a report which measures inflation, the NBS had said food inflation rate in August, which was 29.34 per cent, was the primary factor which pushed headline inflation from 24.08 in July to 25.80 in August.\nThe NBS said, “The rise in food inflation on a year-on-year basis was caused by increases in prices of oil and fat, bread and cereals, fish, fruit, meat, vegetables and potatoes, yam and other tubers, vegetable, milk, cheese and eggs.",
    "Women demand more roles in maritime sector": "Women are often relegated to the back bench, especially in the maritime sector with the notion that they do not possess the physical and mental strength to wade through the rigours associated with the business. ANOZIE EGOLE writes that the women folk are ready to compete with their male counterparts for leading roles in the industry\nOftentimes, women are considered as weaker vessels and as such, not fit enough to handle some jobs or contracts, especially in the maritime sector. This explains the fact that in the Nigerian maritime industry today, women actively involved in the clearing processes are less than 20 per cent of the total licensed agents in the sector. Most of them operating around the ports axis are the ones, involved in point-of-sales services, sales of recharge cards, food vendors, and phone calls among others.\nThis can be attributed to how society perceives women to be people who do not really have the physical strength or mental capabilities to carry out some tasks even though in the real sense of it, there is practically nothing a man can do that a woman cannot do.\nFindings have also shown that the recent development in the maritime sector shows that most ship-owners do not like having female seafarers on board their vessels, a development that has left many qualified female seafarers jobless while their male counterparts are allowed to work even when some of them may not be as qualified as some of the females. \nMeanwhile, findings have shown that most women have proven to be more diligent and committed to assigned duties and responsibilities than their male counterparts when given the opportunity.\nSome of the challenges the maritime sector is facing could be a result of women not being given the opportunity to contribute their quota in the industry.\nIn a recent chat with the PUNCH in Lagos, the Nigerian Chapter Chairperson of Women in Maritime Africa, Mrs. Rollen Macfoy, spoke on the need for women to also be given equal opportunity in the sector like their male counterparts.      \nShe appealed to the new Minister of Marine and Blue Economy, Adegboyega Oyetola, to ensure capacity building for women and consider the women in his appointments, adding that by so doing, women will be more productive to drive the sector forward.\nMacfoy laments that African women in maritime are not being encouraged and so they are very few. ‘’We are women of substance, we are courageous and we are experienced in different areas or sectors in this industry. We want to tell our new minister that we are ready to cooperate with him and put our shoulders on the wheel with him to drive this new ministry. We also want to crave his indulgence to consider women in his appointments, being gender sensitive.”  Related News   Trucker blames hoodlums for 65% drop in haulage  Nigeria, Korea collaborate on shipbuilding  70% global trade done through maritime – FG   \nFight with ship-owners\nAt the 2023 Lagos International Maritime Week, the Vice President of the Female Seafarers Association of Nigeria, Damilola Adebimpe, raised the alarm on the level of denials the women face in the sector.\nAdebimpe who was represented at the event by Louis Njoku, said the opportunities are not always there for women to function like their male counterparts in the sector.\nShe said, “Some Nigerian ship-owners do not take female seafarers. That is what we are trying to do; we are trying so much to speak to ship-owners to let them know that a woman is the same thing as a woman. What men are doing these days can’t be compared to what women can achieve. The ships themselves are not built in such a way to allow women. They will tell you they only have facilities for males; there are no facilities for women so we can’t take women. So it is a great challenge and that is what we are facing but we keep advocating, we will keep talking until our voices are heard,” She said.\nMacfoy, however, reiterated the need for women empowerment in the sector to be able to function optimally.        \n“For WIMA, we are a gender advocacy group and we engage in mainstream participation and we cannot do this without empowerment. Just a few days ago, one of us had issues about license renewal which will cost her N1m. We rallied round her and raised N2m for her to travel to the Philippines for that purpose. On her return back to Nigeria, we also facilitated how she got a job.\nMacfoy also disclosed that her association is offering scholarship to children in secondary schools that want to pursue a career in maritime. ‘’And we have been instrumental to many of them entering the Maritime Academy of Nigeria, Oron, and Oceanography. I personally visit Oceanography to sensitize them.”\nOn the other hand, the Nigerian Chapter Chairperson of Women in Shipping and Transport Africa, Eunice Ezeoke, advocated for women to take the leading positions in different government agencies, especially in the maritime sector.\nShe said, “On the issue of women advocating for the clearing of the waterside, I have nothing against that however, there is a cost to that. At WISTA, one of the challenges we are having is that everything we do we sponsor it by ourselves. It is not easy for women to undertake such projects that would have been sponsored by the local, state, or federal government. And even some government agencies. The function of women especially in a professional association like this is not just to clean the waterways. We want to be policymakers, we want to be in boardrooms, and we want to head agencies and corporate organisations. We can also speak and would also want to be on the other side of the table. So we must take note of that. While we are cleaning the beaches and the environments, we would also want to be in the board room as well.” Ezeoke concluded.",
    "Marketers urge FG to address rising gas prices": "The Nigerian Association of Liquefied Petroleum Gas Marketers has called on the Federal Government to find ways to ensure stability of gas prices and make it available to the common Nigerians. The NALPGAM National President, Abideen Olatunbosun, made this call during the 36th annual general meeting/conference of the association, with the theme, ‘Expanding gas utilisation beyond imagination’, in Ibadan, Oyo State, on Tuesday. He explained that if nothing was done to the increase in price, gas would soon be a commodity for the few rich. Olatunbosun said, “It is very vital for me to say that the galloping hike in the price of gas in recent times stands as a big challenge to LPG marketers. The government need to find ways to ensure the stability of gas price as well as make gas available to the common Nigerians. If nothing is done to the increase in price, gas will soon be a commodity for the few rich in our society.” “As a country, we need to improve on our gas utilisation level. If we adopt gas, it will save our forest, improve quality of our lifestyle and the economy will grow. The hike in price of gas is a concern to all.” In his lecture, the Guest Speaker, Prof Sunday Isehunwa of the Department of Petroluem Engineering, Faculty of Technology, University of Ibadan, identified changes in demand, changes in supply, natural gas production and consumption, changes in price and electricity pricing as some challenges facing LPG market in the country.",
    "It was not our intent to offend Osimhen- Napoli": "Napoli has released an official statement on the video released by the club’s official TikTok page which was interpreted by many people as a ‘mockery’ of Nigerian star striker, Victor Osimhen.\nPunch Online reports that Osimhen in the early hours of Wednesday morning deleted Napoli-related posts on his Instagram page after a contentious ‘mockery’ video was posted by the Serie A club’s verified TikTok handle on Tuesday.\nMany netizens, since the video was posted and later deleted by Napoli on Tuesday, knocked the team and demanded an apology from the Italian side.\nReacting, the club on Thursday, as posted by sports journalist Fabrizio Romano said, “Calcio Napoli, wishing to avoid any exploitation of the issue, point out that we never wanted to offend or mock Victor Osimhen, who is a treasure of this club.\n\n\n  \n“As proof of that, during the summer training retreat, the Club firmly rebuffed every offer that was received for the striker’s transfer abroad.  Related News   Osimhen ends 485 minutes goals drought  Serie A: Osimhen stars in Napoli's 4-1 win over Udinese   Osimhen will do his best for Napoli - coach Garcia   \n“Social media, in particular TikTok, has always used an expressive form of language with a light heart and creativity, without wanting to, as in the case with Osimhen as protagonist, have any intention of insult or derision.\n“In any case, if Victor perceived any offence towards him, this was not what the club intended,” the statement said.      \nPrior to that, Osimhen’s agent, Roberto Calenda, on Tuesday stated that they could take legal action against Napoli.\nHowever, Osimhen was on the scoresheet when the club beat Udinese 4-1 at the Estadio Diego Maradona Stadium on Wednesday.",
    "'Kobe Bryant clone' hailed as missing piece for Jordan at Asian Games": "Former Brooklyn Nets starter Rondae Hollis-Jefferson was hailed as the “missing piece” for Jordan at the Asian Games on Thursday, with the “Kobe Bryant clone” hitting a game-high 17 points against Bahrain.\nThe American was naturalised in time to play for his adopted homeland at the World Cup last month, where his 39-point barrage against New Zealand sparked chants of “Kobe, Kobe, Kobe” from the crowd in Manila.\nUS media dubbed him a “Kobe Bryant clone”, not only for his playing style but also because he wore the same number 24 shirt that the late Bryant sported for the Los Angeles Lakers.\nSome say that the 28-year-old even looks like Bryant.\n\n\n  \n“I think he was the missing piece for our team,” said center Ahmad Al-Dwairi after Hollis-Jefferson starred with a 17 points, four rebounds and two assists to help Jordan beat Bahrain 84-60 in a group game in Hangzhou.\n“We know his career, we can talk about his career, he’s played at the highest level.\n“So we knew that he would be good for our team, not only in offence, he’s also one of the best defenders in our team.      \n“He’s impacting the whole team, leading the team, talking to each player outside the court, inside the court. So he’s doing everything for the team,” he added.  Related News   Appoint more S’Court justices,  raise pay, NBA tells FG  NBA demands immediate appointment of Supreme Court justices  Why Portable performed at our 2023 conference - NBA   \nA 2015 first-round draft pick, Hollis-Jefferson spent six years in the NBA, mostly with the Nets but also with the Toronto Raptors and Portland Trail Blazers.\nHe moved overseas in 2021 to ply his trade in the Turkish, Puerto Rican and Philippine leagues over the past two seasons.\nHollis-Jefferson said he was determined to help Jordan win gold.\n“They gave me a chance (to become naturalised) and I want to help them win. I want to help them get a gold medal,” he said.\n“I love it, I love the fans coming here to show support, the atmosphere is amazing,” he added of Hangzhou. “They love basketball, and I’m appreciative.”\nJordan next play the Philippines on Saturday.        \nAFP",
    "First start, first goal!": "•Iwobi scores as Fulham edge Norwich\nAlex Iwobi scored on his first start for Fulham as Marco Silva’s side beat Norwich City to reach the Carabao Cup fourth round.\nThe Nigeria midfielder finished off a fine team move in the second half after Carlos Vinicius’ first-half opener at Craven Cottage.\nNorwich had more shots on target and reduced the deficit through a debut strike from Borja Sainz, but the Championship side could not find a goal to take the tie to penalties.\n\n\n  \nVinicius put Fulham ahead on 12 minutes with a close-range finish from Willian’s free-kick for his second goal in three games.\nThe Brazilian almost doubled the lead for Silva’s side just before the break, but his first-time finish from Fode Ballo-Toure’s pass was dragged just wide.\nAs Norwich lost possession in their own half, Fulham worked their way around the Canaries’ box and Iwobi eventually scored their second in the 72nd minute with a tidy finish into the bottom corner from Harry Wilson’s lay-off.      \nJackson hands Chelsea win\nA Nicolas Jackson goal saw Chelsea beat Brighton in an intense game to reach the Carabao Cup fourth round at Stamford Bridge.\nThese two sides have dealt with each other a lot in the past 12 months with 10 members of staff having moved to Chelsea for around £200m – and the match carried an extra edge than you’d usually get at this stage of the competition.\nJackson’s winning strike came in the 50th minute after a good move.\nIan Maatsen played the ball to the excellent Cole Palmer – impressive on his first start – who put the ball through Jan Paul van Hecke’s legs for Jackson to sweep home into the bottom corner.\nSolly March had the chance to get Brighton level late in the second half when he was left unmarked but his header was straight at former Seagulls keeper Robert Sanchez.\nJackson’s goal was the first Chelsea had scored for four matches and gave them a much-needed victory as boss Mauricio Pochettino looks to get his project moving in the right direction.          Related News   \nRamsdale impresses in Arsenal win\nAaron Ramsdale returned to the Arsenal starting line-up as Reiss Nelson’s goal sent the Gunners into the Carabao Cup fourth round at Brentford’s expense.\nMikel Arteta has opted to start David Raya ahead of Ramsdale in the last three games.\nBut the England international caught the eye on his return with a crucial second-half save from Yoane Wissa.\nNelson struck what proved to be the winner after just eight minutes, firing in after a poor back-pass.\nRamsdale had started the season as Arsenal’s first-choice goalkeeper, but Arteta caused a stir by replacing him with Raya for the 1-0 win against Everton on 17 September.\nIt was a quiet start for him as Brentford struggled to create opportunities in a first half where they didn’t manage a shot on goal.      \nBut the hosts were much improved after the break and Ramsdale was called upon to superbly push Wissa’s shot on to the post before the rebound was cleared.\nSzoboszlai stunner in Reds win\nDominik Szoboszlai’s stunning second-half strike helped Liverpool come from behind to beat Leicester City in the Carabao Cup third round.\nKasey McAteer gave Leicester the lead just three minutes in as the Championship team hit their Premier League hosts on the counter-attack.\nLiverpool pushed hard for a leveller and, after being denied by Conor Coady’s goalline clearance, Cody Gakpo was the man who got it with a well-taken finish just after half-time.\nSzoboszlai edged them ahead when, moments after being introduced as a second-half substitute, he arrowed an unstoppable shot in off the crossbar.",
    "TIME Features ASUS Among the 2023 World’s Best Companies": "ASUS has announced that it has been included in TIME magazine’s list of the World’s Best Companies for 2023. ASUS was ranked among the top 300 out of 5,000 companies evaluated worldwide and was acknowledged for its exceptional performance in the three key categories of employee satisfaction, revenue growth, and sustainability.\nASUS is also notably one of only four Taiwanese companies on this year’s list,which was compiled by TIME in partnership with Statista.\n“We would like to thank TIME for recognizing our efforts as a leading global technology solutions brand,” said S.Y. Hsu, co-CEO of ASUS. “We are committed to relentlessly transforming our company into a more agile and synergistic organization and to becoming the world’s most admired innovative technology enterprise in the new digital era.”\nThe award also serves as testament to the company’s continued efforts to reduce its environmental impact and dedication to sustainability in the four key areas of Climate Action, Circular Economy, Responsible Manufacturing, and Value Creation. \nEmphasizing this relentless pursuit of sustainability, ASUS co-CEO Samson Hu added,“We are honored to receive this prestigious recognition from TIME. ASUS is committed to sustainability and has expended considerable efforts on this endeavor. We strive to build a holistic green supply chain as we continue to make significant strides towards our 2050 Net Zero goal to create a cleaner, greener future.”\nConsistent international validation \nThe ASUS commitment to continuously creating incredible experiences that enhance the lives of people every where has consistently received global validation. In addition to Time’s recognition, ASUS was named one of Fortune’s World’s Most Admired Companies for the eighth time in 2023. The company was also ranked among the Forbes World’s Best Employers 2022 list for a third straight year and named as Interbrand’s Best Global Taiwan Brand in 2022 for the ninth time.\nA key factor in the company’s outstanding performance is its workforce of over 15,000 employees, including 5,000 world-class R&D and design professionals, who embody the ASUS spirit of always being in search of incredible.      \nTough competition\nThe list of the World’s Best Companies is created by the prestigious US-based TIME magazine.Through extensive and in-depth market research and data analysis, the list seeks to rank the world’s most outstanding companies across all industries. Initially, 5,000 companies are evaluated using more than 15 different criteria, including the three main categories of employee satisfaction, revenue growth, and sustainability. Only 750 companies make it onto the World’s Best Companies list.\nThe detailed methodology and criteria for the list can be found at http://time.com/worlds-best-companies-2023\nASUS is a global technology leader that provides the world’s most innovative and intuitive devices, components and solutions to deliver incredible experiences that enhance the lives of people everywhere. With its team of 5,000 in-house R&D experts, ASUS is world-renowned for continuously reimagining today’s technologies for tomorrow, garners more than 11 awards every day for quality, innovation and design, and is ranked among Fortune’s World’s Most Admired Companies."
}