{
    "Labour faults FG’s meeting, insists on indefinite strike": "The National Deputy President of the Trade Union Congress, Tommy Etim, said nothing would stop the strike, noting that Nigerian workers were disenchanted with the Federal Government.\nHe stated that the unions had given the government sufficient time to address their demands, stressing that the workers would not allow themselves to be deceived any longer.\nEtim told The PUNCH on Wednesday that any fresh meeting was pointless and asked Nigerians to brace for the long-drawn walkout.\n‘’The government had been given more than enough time to meet our demands but they did nothing. The strike has been fixed, nothing will stop it and if they (FG) like, they can go to court as usual. The only thing that can stop the strike is if they meet all our demands,’’ he stated. \nAsked what Nigerians should expect during the industrial action, the labour leader added, ‘’It will not just be a total shutdown of the nation, it is going to be the mother of all strikes. Do you know that they are even planning to sack 17,000 workers in this period when Nigerians are suffering great hardships?’’\nAlso, a top official of the NLC while speaking on the proposed strike, said, “The issues are straightforward, NLC’s joint communiqué was very clear. NLC has declared an indefinite nationwide strike which is to begin on October 3, 2023, and nothing will make us not to start unless the government does everything we have said they should do.’’\nAsked if the unions would shelve their plan if invited to a meeting by FG, the union leader noted, ‘’No meeting or promise that would make us stop; the only thing that would make us stop is the fulfilment of all those demands, nothing else.”      \nFuel scarcity, blackout\nMeanwhile, Nigerians may have to brace for fuel scarcity and nationwide blackout from Tuesday as the Nigeria Union of Petroleum and Natural Gas workers and the National Union of Electricity Employees have vowed to join the indefinite strike declared by the NLC and TUC.\nAlso, the health workers said that they would not be available to attend to patients at the hospitals while the judiciary staff disclosed that the courts would be shut down nationwide.\nSenior officials of NUPENG and NUEE told our correspondent on Wednesday that the unions would ground petrol and electricity supply once the strike begins.\nNUPENG’s National President, Williams Akporeha, said the union would implement every instruction issued by the NLC, adding that it was non-negotiable for NUPENG to join the strike.\nOn Tuesday, the NLC and TUC announced an indefinite strike with effect from October 3, to protest the alleged failure of the Federal Government to provide post-subsidy palliatives for workers and implement policies that could alleviate the sufferings of the masses after the removal of the fuel subsidy.\nAfter the 21-day ultimatum given by the NLC lapsed last week, the National President of the NLC, Joe Ajaero, had lamented that none of the demands put before the government had been addressed.        \nResponding to a question on whether NUPENG would join the proposed strike, Akporeha said, “We are an affiliate of NLC and we will follow their directives to the letter.”\nThe NLC has over 40 affiliate unions, while the TUC has about 30 and the affiliates often participate in industrial actions called by the parent associations.\nAlso confirming the resolve of NUEE to comply with the strike directive, the acting General Secretary of the union, Dominic Igwebuike, said the association would ground power supply if the government fails to avert the proposed walkout.\n“NUEE is an affiliate of NLC and we are complying with the directive of the congress by joining the strike from Tuesday. Workers in various electricity companies are our members.\n“So, we are ready to join the strike and our circular communicated that to our members. So, electricity workers are right now getting set to join the strike and this will lead to a massive shutdown of the power sector,” he stated.\nIgwebuike had earlier said though the power sector employees were regarded as essential workers, they would still join the proposed strike.\nHe noted, “People in the power sector are also Nigerians. There is no different market for people working in the essential services sectors. We all go to the same markets, pay school fees, buy fuel and face the same challenges. So we are Nigerians too.”      \nHe explained that the September 5 and 6 walkout did not ground all the power stations because it was a warning strike, but stressed that the major strike beginning from October 3 would culminate in a complete shutdown of the country’s electricity grid.\nIgwebuike urged the Federal Government to listen to the demands of the labour unions in order to avert the impending hardship that the proposed industrial action would bring upon Nigerians.\nSpeaking in the same tone, the healthcare workers under the aegis of the Joint Health Sector Unions and the National Association of Nigeria Nurses and Midwives said they will join the planned nationwide strike.\nHealth workers\nThe acting National Vice Chairman of JOHESU, Dr Obinna Ogbonna, disclosed this to our correspondent on Wednesday.\n Ogbonna said the health workers in the affiliates of the TUC and NLC would not report for work during the strike period.\nThe PUNCH reports that JOHESU is the umbrella body of health workers’ unions and associations, including the Medical and Health workers’ Union of Nigeria, the Nigerian Union of Allied Health Professionals, the Non-Academic Staff Union of Universities and Associated Institution, the Senior Staff Association of Universities, Teaching Hospitals and Associated Institutions, and the Assembly of Healthcare Professional Associations.  \nOgbonna stated, “We will join the strike fully and strongly because there was a circular released in the month of July 2023, by the National Salaries, Incomes and Wages Commission.  Related News   JUST IN: Labour Party backs NLC, TUC proposed strike  NURTW blames NLC for internal crisis  NLC, TUC to ground activities nationwide from Oct 3   \n‘’It has to do with the upward review of Consolidated Health Salary Structure and Consolidated Medical Salary Structure and it stated that it will be implemented from June 2023, and the reason why it was so was because of the biting economic situation, but up till this moment, it has not been implemented.\n“The palliatives that are meant to be done for us in the health sector have not been done. So, why are we not going to join the strike?”\nOgbonna noted that health services would be paralysed in government-owned facilities.\n“We will only render skeletal services, especially to those in the Intensive Care Units,” he said.\nCorroborating him, the National President of the NUAHP, Kamal Ibrahim, said the members of his union will also participate in the nationwide strike.\n“We will be joining the strike and it is for the good of the people,” he added.      \nAs members of the NLC, the Judiciary Staff Union of Nigeria said its members will join the strike action.\nThe treasurer of the union, Musa Alonge, argued that the issues the NLC was canvassing affected its members.\nHe said, “We are an affiliate of the NLC and we cannot deny that. What they are agitating for affects us. We are going where the NLC goes on this matter.”\nMeanwhile, the spokesperson of the Ministry of Labour and Employment, Olajide Oshundun, in a statement signed on Wednesday evening addressed reports that the President, Bola Tinubu, would roll out wage awards and palliatives for workers on Independence Day. He said, “For the benefit of doubt, it is important to stress that the Director of Information at the Ministry of Labour does not speak for the President nor is he involved in writing his speech to warrant him making any categorical statement on its content.\n“If and when the minister schedules a meeting with Labour, the public will be adequately notified through verified channels.”\nIn a related development, the leadership of the Labour Party has thrown its weight behind the planned industrial action, saying the Presidency has been insensitive to the plight of Nigerian workers.\nAmong other things, the NLC and the TUC were asking for wage awards, implementation of palliatives, tax exemptions and allowances to public sector workers and a review of the minimum wage.        \n Reacting to the proposed strike in a statement titled, ‘Workers strike: Labour Party identifies with Nigerian workers’ on Wednesday, National Publicity Secretary of LP, Obiora Ifoh, said the workers have shown enough patience and understanding.\n Ifoh also added that the leadership of the party was in support of any legitimate means to press for better welfare for Nigerian workers.\nThe party, therefore, said it fully supported the resolution of the NLC and TUC to embark on an industrial action.\n He said, “We have followed with keen interest, in the last four months, various meetings between Organised Labour and various government bodies including president of the Senate, the Presidency and the ministers of labour as well as all the efforts made by the Labour leadership to get the government to understand the magnitude of sufferings its policies have thrown Nigerian workers into since the enthronement of this administration.\n“We are not in any way surprised at the government’s apparent indifference, insensitivity, intransigence, and recalcitrant posture towards the genuine demands of the Labour bodies because their usurpation of power was not sanctioned by both the workers and generality of Nigerians.\n “Nigerians went to the polls with clear conviction of the government they wanted but this was denied them through institutional conspiracy. Today, Nigerian workers are being punished for taking a stand during the February 25 presidential election.\n‘’Labour Party is also aware of the sordid conditions which workers, the majority of them being our members, are subjected to, where many go to the office on a Monday and are forced by the prevailing economic challenges to sleep in their offices all through to Friday before returning home.      \n“We are also using this medium to inform all our members and supporters to stock their homes with their necessary needs ahead of a long-drawn mass action until victory is ascertained. No retreat, no surrender.”\nSpeaking on the planned strike in an interview on Arise TV on Wednesday, the National President of the TUC, Festus Osifo, asked the President Bola Tinubu-led Federal Government to account for the amount it claimed to have saved from the removal of subsidy on Premium Motor Spirit popularly known as petrol. Osifo said this during an interview on Arise Television.\nIn July 2023, the government noted that it saved more than N1 trillion following the removal of fuel subsidy.\nTinubu said the revenue saved would be used for the benefit of Nigerians.\n“In a little over two months, we have saved over a trillion naira that would have been squandered on the unproductive fuel subsidy which only benefitted smugglers and fraudsters. That money will now be used more directly and more beneficially for you and your families,” Tinubu said.\nOsifo explained that since the government announced that N1trn had been saved, there was no reason for the government to continue to obtain loans.\n“The President and commander in chief on its own came and said the country has saved N1 trillion. The Federal Government went everywhere to announce that if the subsidy is removed, it’s going to save substantial money.      \n“And so, we don’t expect them to go everywhere and start borrowing money. They told us they are going to save money. So where is the money that you have saved and how have they deployed this money?,’’ he queried.",
    "Chicago academic record: Atiku plans fresh suit against Tinubu": "The legal team of the Peoples Democratic Party presidential candidate, Atiku Abubakar, is planning to file a motion to challenge President Bola Tinubu’s plea for Chicago State University not to release privileged documents in his academic records.\nThe Special Adviser to Atiku on Public Communications, Phrank Shaibu, disclosing to The PUNCH that the legal team had up to 48 hours to respond to the motion in the US court.\n Atiku had earlier secured an order for CSU to make the president’s academic records available to his legal team.\nA magistrate, Jeffrey Gilbert, had last week ordered Tinubu’s alma mater to provide all relevant and non-privileged documents to the applicant within two days. \nAtiku is currently challenging the victory of the former Lagos State governor at the 2023 presidential poll and his recent affirmation by an election petition court in Nigeria.\nThe documents sought by the PDP candidate, through his counsel, Angela Liu, include the record of admission and acceptance at the university, dates of attendance including degrees, awards, and honors attained by the former governor of Lagos State at the university, among others.\nBut as the deadline given by Gilbert drew nearer on Thursday, Tinubu’s lawyers approached Maldonado, arguing that the earlier decision by Gilbert needed to be reviewed by a district judge.      \nThe request for a review and delay of the order till Monday was eventually granted by the US district judge.  Related News   Nigeria moving to era of concrete roads, says Umahi  Ministers to face quarterly performance review  Tinubu, Nigerians await your power sector plan   \nTinubu’s application, filed by his lawyers, Oluwole Afolabi and Christopher Charmichael, advanced two reasons.\nFirst was that his academic records in issue are not useful in Nigerian courts as claimed by Atiku because the Nigerian election proceedings and the Nigerian courts have explicitly been unreceptive to the discovery.\nThe second reason given was that Atiku’s request is unduly intrusive because it allows Applicant (Atiku) to conduct a fishing expedition into intervenor’s private, confidential, and protected educational records.\n When asked on Wednesday to confirm if Atiku has filed the suit as he earlier threatened in Monday, Shaibu reassured our correspondent that the former vice president would submit the motion before midnight.\nHe said, “I am sure you have seen his application. We are working on our response. We have up till midnight today (Wednesday) to respond to them. And we will.”\nOn when they expect the court to rule over the matter, Shaibu stated that “It is after we have responded to the court, that it will fix the date and inform the parties.”        \nWhen contacted for reaction, Coordinator of Tinubu Presidential Legal Team, Babatunde Ogala, who spoke via phone from his base in the United States told, The PUNCH he would rather not speak on the development.\n“As I told you earlier, I am still on vacation,” he said.",
    "Varsity graduate attempts suicide over withheld results": "A graduate of Ambrose Ali University, Ekpoma, Edo State, identified as Precious Ogbeide, has attempted suicide over the alleged university’s refusal to issue him and several other students their results after they graduated from school in 2018.\nOur correspondent learnt that Ogbeide, whose parents claimed he had been battling depression due to his inability to be issued his results after spending five years in the school, started to stab himself with pieces of a bottle he had broken.\nSome aggrieved students of the school had lamented the inability to receive their degree results after spending five years undergoing the programme, claiming that the situation had demoralised them.\nAccording to them, they are facing a bleak future as a result of the development. \nPUNCH Metro learnt from the aggrieved students that the tertiary institution had been promising them that the backlog of results would be cleared and students who were yet to be mobilised for the National Youth Service Corps scheme would be settled.\nHowever, a source, who was privy to Monday’s incident, told our correspondent that Ogbeide became frustrated and decided to end his life over the matter.\nThe source, who craved anonymity, said, “I received a call at about 3:30 pm on Monday that Ogbeinde had been rushed to the hospital. I was told he had been showing signs of depression and that they had tried to help in every possible way they could.        Related News   Edo varsity graduates protest non-release of results five years after  Ambrose Alli varsity, ASUU differ on mass sacking  Police didn't arrest our lecturers for cultism, Ambrose Alli varsity says   \n“The mother told me that he just stood up all of a sudden with a bottle and smashed it on the floor. They told me it was a slip. But he started to pierce his neck and body with the pieces of the broken bottle.\n“It was the efforts of his relative present at the time of the incident that overpowered him before he was rushed to the hospital where he is currently receiving treatment.\n“He said he was tired of everything. He said he had not been able to face his parents and family members after going to school for five years without any result to show for it.\n“He could not get a job because they kept asking him to provide his certificate. He said any time he met those who could help him get a job, they would tell him to wait for his result. He was just fed up with the whole thing and became frustrated that his future was on hold.”\nMeanwhile, the school, through the Head of Corporate Communications and Protocol, Mike Aladenika, had told PUNCH Metro that the students affected by certificate and result issues might have had issues with some courses during their time in school.\n“If you had graduated and done all you were asked to do while you were a student, you would not have problems with your results.\n“Some of the students who did not take cognizance of the deficiencies they had with their courses are the ones facing these challenges,” Aladenika stated.",
    "Ondo woman kills husband with pestle, flees": "The Ondo State Police Command on Wednesday said it would soon arrest a middle-aged woman, Mrs Tayelolu Solomon, for allegedly killing her husband, Mr Felix Solomon.\n Tayelolu was reported to have hit her 67-year-old husband with a pestle on Saturday at the GRA area of Ondo town in Ondo State when the deceased was asleep.\nPrior to the incident, it was gathered that the couple had been having a lingering crisis.\nThe son of the deceased, Ibukun Solomon, who witnessed the incident, confirmed that his mother allegedly hit the head of his father with the pestle while he was sleeping and ran away, saying the couple had quarrelled some hours earlier. \nHe narrated, “My mother killed my father with a pestle in my presence and took to her heels. She used the pestle to hit his head when he was asleep.\n“Earlier on the fateful day, a minor argument had ensued between them that resulted in a fight. After the fight, my father went to lie on the chair and my mother hit his head with the pestle.  Related News   Court remands man who attempted suicide in police custody  Man drags Delta hospital, others to court over wife's death  Impeachment: Akeredolu should remove saboteurs not deputy - Lawyer   \n“He became unconscious in the process and fell down from where he was sleeping. My mother used the pestle to hit my father’s head three times and he later died.      \n“When my mother saw that my father was already unconscious, she hid the pestle at the back of our house and ran away. I alerted some of the residents, who rushed my father to the hospital.\n“But he later died. His corpse has been deposited at the morgue. My mother had three children for my father and I’m the last child.”\nThe state Police Public Relation Officer of the command, Mrs Funmilayo Odunlami, who confirmed the incident, said, the command would soon arrest the suspect.\nShe said the deceased was quickly rushed to the hospital where he gave up the ghost.\n“The incident happened last week when the couple had a fight but the suspect is currently at large. We are already on her trail,” the PPRO stated.",
    "Napoli row: Piers Morgan wants Osimhen at Arsenal": "English TV personality Piers Morgan has urged Nigerian striker Victor Osimhen to join Premier League side Arsenal, following his sour relationship with Italian Serie A champions Napoli.\nThe Napoli striker is currently at loggerheads with the Italian outfit following a video posted on the club’s TikTok account mocking him for his penalty miss against Bologna on Sunday.\nIn the wake of the event, the striker on Wednesday snubbed his teammates while arriving at the team’s hotel ahead of their game against Udinese. His agent Roberto Calenda also threatened to take legal action against Napoli for the disparaging video.\nThe tense relationship between the player and Napoli will likely rewaken interests in Osimhen from clubs who had tried to get his signature in the summer, and Morgan quickly took advantage of the situation to remind him about the Gunners.\n\n\n  \n“Don’t take this terrible treatment @victorosimhen9 – come to Arsenal instead,” Morgan wrote on X.\nArsenal are said to need a striker following their not-too-impressive start to the Premier League campaign and have been linked with Brentford star Ivan Toney.  Related News   The Victors: Two strikers, different stories  Di Lorenzo blames Osimhen over outburst  PUNCHWoman, Osimhen, others shortlisted for Future Africa Awards   \nMeanwhile, Saudi Arabian clubs will lead the pursuit of Osimhen should he push for a move away from Napoli in January after his agent threatened legal action against the club over the controversial TikTok videos.      \nReal Madrid are also interested in the Nigerian as the Spanish giants seek reinforcements in attack after Karim Benzema’s departure.\nThe 24-year-old was linked with a move to the Premier League last summer with Manchester United and Chelsea showing strong interest in his services.\nOsimhen was also linked with a whopping €200m move to Saudi club Al Hilal, which didn’t also materialise while it is understood that the Super Eagles forward is still negotiating a contract extension with the 2022/2023 Serie A champions.\nOsimhen scored 26 goals in the Serie A last season to guide Napoli to their first league title in 33 years.",
    "Mohbad: I'm ready to return  if my safety is guaranteed - Naira Marley": "Nigerian singer, Azeez Fashola aka Naira Marley has said he is ready to return to Nigeria to clear his name over his alleged involvement in the death of his former label signee, Mohbad.\nNaira Marley made the disclosure on Wednesday during an interview session with Social Media influencer, Reno Omokri.\nSince the death of Mohbad, there has been social media outrage after several videos surfaced of the late singer accusing Naira Marley of masterminding his gang-beating\nAgain, the label boss who granted his first interview since the saga said there’s a lot of mob poisoned by the media against his person and stressed that he’ll return to the country if the police guarantees his safety. \n\n“If the security agencies can guarantee my safety, I will be in Nigeria for investigations”\n– Naira Marley pic.twitter.com/NyKX0zq2tH  Related News   We were resolving our issues before MohBad died, Naira Marley addresses assault claims  Mohbad: Naira Marley vows to clear name, ready to assist police investigation  Mohbad: Coroner's inquest into cause of death begins Friday   \n— 🐬 @𝗼𝗻𝗲𝗷𝗼𝗯𝗹𝗲𝘀𝘀𝗯𝗼𝘆 (@OneJoblessBoy) September 27, 2023      \n\nHe also alleged that Mohbad struggled with suicidal thoughts while he was alive.\nHe said, “There was another time when I was in America and his girl called me to say he locked himself in the toilet and he wanted to kill himself or something like that. So, I called him from there and recorded the conversation, asking him: “Why did you want to kill yourself? You are a king, if your family is stressing you out(because this time, he was with his family and all his family was around him) just tell them to chill, you can do what you want to do, do not stress yourself, if you kill yourself now, what do you want people to say.\n“I was so concerned so I called him to try to give him rest of mind, if your family is stressing you out, leave.”\n“He wanted to commit suicide, in the video, I was just trying to find out what was wrong with him.”",
    "Food prices jump by 31%, says NBS": "Ebonyi and Abia states led as food prices jumped by 31 per cent within in 12 months from July 2022 to July 2023.\nThis is according to an analysis of the ‘Selected Food Price Watch,’ a report published on a monthly basis by the National Bureau of Statistics.\nThe selected food items include staples such as rice(1kg), beans(1kg), bread (500g), tomatoes, beef, wheat (2kg), garri(1kg) and palm oil (1 bottle).\nAccording to the reports, the highest food price increase was recorded in the price of yam, which jumped by 42 per cent, from N389.75 in July 2022 20 N539.41 in 2023. \nThis was closely followed by the price of one kilogram of rice, which increased from N467.80 to N653.49 within 12 months.\nIn the same vein, the price of palm oil went up by 35 per cent, from N890.67 to N1208.62 during the period in review.  Related News   FG earned N4.3tn from oil in 2021 – Report  Global debt hit $307tn in H1 – IIF  ‘Imported food prices rise by 89% in four years’   \nOther staple foods which contributed to the food price hike included Garri (1kg), which increased by 33 per cent, from N323.17 to N429.89. 500g of sliced bread also increased from N486.27 to N651.78 (+34 per cent).      \nA kilogram of tomato (N446.81 to N557.96), Wheat (2kg) (N1094.72 to N1419.14), and Beef (N2118.84 to N2758.13), also accounted for some of the staple food items which recorded significant price spikes.\nFurther analysis of the report showed that South-Eastern states, led by Abia and Ebonyi recorded the highest food prices during the twelve-month period.\nOn the other hand, states within the North Central (Kogi, Niger, Benue) recorded the lowest food prices during this time.\nIn its latest Consumer Price Index, a report which measures inflation, the NBS had said food inflation rate in August, which was 29.34 per cent, was the primary factor which pushed headline inflation from 24.08 in July to 25.80 in August.\nThe NBS said, “The rise in food inflation on a year-on-year basis was caused by increases in prices of oil and fat, bread and cereals, fish, fruit, meat, vegetables and potatoes, yam and other tubers, vegetable, milk, cheese and eggs.",
    "Women demand more roles in maritime sector": "Women are often relegated to the back bench, especially in the maritime sector with the notion that they do not possess the physical and mental strength to wade through the rigours associated with the business. ANOZIE EGOLE writes that the women folk are ready to compete with their male counterparts for leading roles in the industry\nOftentimes, women are considered as weaker vessels and as such, not fit enough to handle some jobs or contracts, especially in the maritime sector. This explains the fact that in the Nigerian maritime industry today, women actively involved in the clearing processes are less than 20 per cent of the total licensed agents in the sector. Most of them operating around the ports axis are the ones, involved in point-of-sales services, sales of recharge cards, food vendors, and phone calls among others.\nThis can be attributed to how society perceives women to be people who do not really have the physical strength or mental capabilities to carry out some tasks even though in the real sense of it, there is practically nothing a man can do that a woman cannot do.\nFindings have also shown that the recent development in the maritime sector shows that most ship-owners do not like having female seafarers on board their vessels, a development that has left many qualified female seafarers jobless while their male counterparts are allowed to work even when some of them may not be as qualified as some of the females. \nMeanwhile, findings have shown that most women have proven to be more diligent and committed to assigned duties and responsibilities than their male counterparts when given the opportunity.\nSome of the challenges the maritime sector is facing could be a result of women not being given the opportunity to contribute their quota in the industry.\nIn a recent chat with the PUNCH in Lagos, the Nigerian Chapter Chairperson of Women in Maritime Africa, Mrs. Rollen Macfoy, spoke on the need for women to also be given equal opportunity in the sector like their male counterparts.      \nShe appealed to the new Minister of Marine and Blue Economy, Adegboyega Oyetola, to ensure capacity building for women and consider the women in his appointments, adding that by so doing, women will be more productive to drive the sector forward.\nMacfoy laments that African women in maritime are not being encouraged and so they are very few. ‘’We are women of substance, we are courageous and we are experienced in different areas or sectors in this industry. We want to tell our new minister that we are ready to cooperate with him and put our shoulders on the wheel with him to drive this new ministry. We also want to crave his indulgence to consider women in his appointments, being gender sensitive.”  Related News   Trucker blames hoodlums for 65% drop in haulage  Nigeria, Korea collaborate on shipbuilding  70% global trade done through maritime – FG   \nFight with ship-owners\nAt the 2023 Lagos International Maritime Week, the Vice President of the Female Seafarers Association of Nigeria, Damilola Adebimpe, raised the alarm on the level of denials the women face in the sector.\nAdebimpe who was represented at the event by Louis Njoku, said the opportunities are not always there for women to function like their male counterparts in the sector.\nShe said, “Some Nigerian ship-owners do not take female seafarers. That is what we are trying to do; we are trying so much to speak to ship-owners to let them know that a woman is the same thing as a woman. What men are doing these days can’t be compared to what women can achieve. The ships themselves are not built in such a way to allow women. They will tell you they only have facilities for males; there are no facilities for women so we can’t take women. So it is a great challenge and that is what we are facing but we keep advocating, we will keep talking until our voices are heard,” She said.\nMacfoy, however, reiterated the need for women empowerment in the sector to be able to function optimally.        \n“For WIMA, we are a gender advocacy group and we engage in mainstream participation and we cannot do this without empowerment. Just a few days ago, one of us had issues about license renewal which will cost her N1m. We rallied round her and raised N2m for her to travel to the Philippines for that purpose. On her return back to Nigeria, we also facilitated how she got a job.\nMacfoy also disclosed that her association is offering scholarship to children in secondary schools that want to pursue a career in maritime. ‘’And we have been instrumental to many of them entering the Maritime Academy of Nigeria, Oron, and Oceanography. I personally visit Oceanography to sensitize them.”\nOn the other hand, the Nigerian Chapter Chairperson of Women in Shipping and Transport Africa, Eunice Ezeoke, advocated for women to take the leading positions in different government agencies, especially in the maritime sector.\nShe said, “On the issue of women advocating for the clearing of the waterside, I have nothing against that however, there is a cost to that. At WISTA, one of the challenges we are having is that everything we do we sponsor it by ourselves. It is not easy for women to undertake such projects that would have been sponsored by the local, state, or federal government. And even some government agencies. The function of women especially in a professional association like this is not just to clean the waterways. We want to be policymakers, we want to be in boardrooms, and we want to head agencies and corporate organisations. We can also speak and would also want to be on the other side of the table. So we must take note of that. While we are cleaning the beaches and the environments, we would also want to be in the board room as well.” Ezeoke concluded.",
    "Marketers urge FG to address rising gas prices": "The Nigerian Association of Liquefied Petroleum Gas Marketers has called on the Federal Government to find ways to ensure stability of gas prices and make it available to the common Nigerians. The NALPGAM National President, Abideen Olatunbosun, made this call during the 36th annual general meeting/conference of the association, with the theme, ‘Expanding gas utilisation beyond imagination’, in Ibadan, Oyo State, on Tuesday. He explained that if nothing was done to the increase in price, gas would soon be a commodity for the few rich. Olatunbosun said, “It is very vital for me to say that the galloping hike in the price of gas in recent times stands as a big challenge to LPG marketers. The government need to find ways to ensure the stability of gas price as well as make gas available to the common Nigerians. If nothing is done to the increase in price, gas will soon be a commodity for the few rich in our society.” “As a country, we need to improve on our gas utilisation level. If we adopt gas, it will save our forest, improve quality of our lifestyle and the economy will grow. The hike in price of gas is a concern to all.” In his lecture, the Guest Speaker, Prof Sunday Isehunwa of the Department of Petroluem Engineering, Faculty of Technology, University of Ibadan, identified changes in demand, changes in supply, natural gas production and consumption, changes in price and electricity pricing as some challenges facing LPG market in the country.",
    "First start, first goal!": "•Iwobi scores as Fulham edge Norwich\nAlex Iwobi scored on his first start for Fulham as Marco Silva’s side beat Norwich City to reach the Carabao Cup fourth round.\nThe Nigeria midfielder finished off a fine team move in the second half after Carlos Vinicius’ first-half opener at Craven Cottage.\nNorwich had more shots on target and reduced the deficit through a debut strike from Borja Sainz, but the Championship side could not find a goal to take the tie to penalties.\n\n\n  \nVinicius put Fulham ahead on 12 minutes with a close-range finish from Willian’s free-kick for his second goal in three games.\nThe Brazilian almost doubled the lead for Silva’s side just before the break, but his first-time finish from Fode Ballo-Toure’s pass was dragged just wide.\nAs Norwich lost possession in their own half, Fulham worked their way around the Canaries’ box and Iwobi eventually scored their second in the 72nd minute with a tidy finish into the bottom corner from Harry Wilson’s lay-off.      \nJackson hands Chelsea win\nA Nicolas Jackson goal saw Chelsea beat Brighton in an intense game to reach the Carabao Cup fourth round at Stamford Bridge.\nThese two sides have dealt with each other a lot in the past 12 months with 10 members of staff having moved to Chelsea for around £200m – and the match carried an extra edge than you’d usually get at this stage of the competition.\nJackson’s winning strike came in the 50th minute after a good move.\nIan Maatsen played the ball to the excellent Cole Palmer – impressive on his first start – who put the ball through Jan Paul van Hecke’s legs for Jackson to sweep home into the bottom corner.\nSolly March had the chance to get Brighton level late in the second half when he was left unmarked but his header was straight at former Seagulls keeper Robert Sanchez.\nJackson’s goal was the first Chelsea had scored for four matches and gave them a much-needed victory as boss Mauricio Pochettino looks to get his project moving in the right direction.          Related News   \nRamsdale impresses in Arsenal win\nAaron Ramsdale returned to the Arsenal starting line-up as Reiss Nelson’s goal sent the Gunners into the Carabao Cup fourth round at Brentford’s expense.\nMikel Arteta has opted to start David Raya ahead of Ramsdale in the last three games.\nBut the England international caught the eye on his return with a crucial second-half save from Yoane Wissa.\nNelson struck what proved to be the winner after just eight minutes, firing in after a poor back-pass.\nRamsdale had started the season as Arsenal’s first-choice goalkeeper, but Arteta caused a stir by replacing him with Raya for the 1-0 win against Everton on 17 September.\nIt was a quiet start for him as Brentford struggled to create opportunities in a first half where they didn’t manage a shot on goal.      \nBut the hosts were much improved after the break and Ramsdale was called upon to superbly push Wissa’s shot on to the post before the rebound was cleared.\nSzoboszlai stunner in Reds win\nDominik Szoboszlai’s stunning second-half strike helped Liverpool come from behind to beat Leicester City in the Carabao Cup third round.\nKasey McAteer gave Leicester the lead just three minutes in as the Championship team hit their Premier League hosts on the counter-attack.\nLiverpool pushed hard for a leveller and, after being denied by Conor Coady’s goalline clearance, Cody Gakpo was the man who got it with a well-taken finish just after half-time.\nSzoboszlai edged them ahead when, moments after being introduced as a second-half substitute, he arrowed an unstoppable shot in off the crossbar.",
    "Ekiti athletes get new kits, state Assembly probes officials": "Team Ekiti on Wednesday unveiled their new kits at the ongoing National Youth Games in Asaba in what is a reparation for their show of shame at the opening ceremony of the Games on Saturday, where viral pictures online showed their athletes during the march-past wearing different shades of pants and slippers on white T-shirts.\nThe new kits will be used by the athletes during the closing ceremony on Saturday.\nThis comes as the Ekiti State House of Assembly began investigation into the kits scandal that rocked the state’s camp in Asaba, the Delta State capital.\nThe Chairman, House Committee on Youths and Sports, Idowu Odebunmi, expressed the House’s dissatisfaction with the negligence of the sports council officials resulting in the misrepresentation of the state.\n\n\n  \nOdebunmi, who said at the Parliamentary Session on Tuesday evening that the probe was initiated to ensure accountability, transparency and adherence to standards in representing Ekiti State, assured that the House would follow it to logical conclusion.\nThe committee, however, directed the state’s sports council general manager, Adekuble Adeyemi, to come back with all his senior officials  upon their return from the event.\nThe chairman stated that the committee’s report would be submitted to the House after the conclusion of its investigation for further legislative action.      \nAdeyemi, who was recalled from the games following the outcry in Ekiti that greeted the kits scandal, apologised for the embarrassment caused the state at the opening ceremony.\nThe GM, however, stated that the sports council would continue to do its best to move sports forward in Ekiti.\nHe thanked the Governor Biodun Oyebanji administration for support to the sports council, stating that N20m was promptly approved for the Games by Governor Oyebanji, less than 24 hours after submitting the approval.\nMeanwhile, following the show of shame, more revelations have emerged on the poor preparations of the contingent ahead of the Games, The PUNCH reports.\nThe PUNCH learnt from sources within the team’s camp in Asaba and Ado-Ekiti, the Ekiti State capital, that the 100 athletes representing the state were not camped prior to the Games while they had poor or no facilities to train at all.\nThe athletes shabby outfits led to the General Manager of Ekiti State Sports Council, Adekunle Adeyemi, being recalled by Governor Biodun Oyebanji on Sunday, while the Ekiti State House of Assembly also summoned him and top officials in the sports council to appear before it on Tuesday (today).  Related News   Nigerians pour encomiums on late Ekiti Speaker  Ekiti Assembly writes Magu, threatens him with contempt over arrest of state officials  Ekiti House suspends another member for 101 days   \nWhile the sports council boss and his officials are under fire, the athletes have continued their business in Asaba by progressing in their respective events.        \nGolfer Abdulrahman Fatai won the first gold medal for the state in the golf event on Monday. They won their second gold in golf courtesy of Abdulrahman Mustapha, the younger brother of Abdulrahman Fatai. The younger Abdulrahman defeated his counterpart from Borno in the final. His elder brother, Fatai, also won a silver medal for the state in golf as well.\nSome of their other athletes have also dazzled in the table tennis and handball events at the early stages of the competition but their inadequate preparations might cut-short their potential, according to an official.\n“We had no camping at all before the Games. There was nothing to prepare us for the games and the athletes are just being paid part of their allowances, days after we arrived here (Asaba),” the official told The PUNCH.\n“There was even no provision for kits during the opening ceremony. The state has a colour and they used to provide ceremonial wears for that purpose, that has been the tradition, but athletes had to wear different kinds of pants and slippers with the white T-shirts that were donated by a bank,” he added.\nAn athlete, who represented the state at the Edo 2020 National Sports Festival in 2021, Niyi Ogunleye, as well as an Ado-Ekiti-based journalist, Qasim Oladapo, also revealed that the facilities at the Oluyemi Kayode Stadium, Ado-Ekiti were nothing to write home about, although the present administration in the state had promised to rebuild its gymnasium.\n“The performance of these athletes are not usually about the resources. You will see Ekiti athletes winning medals in some sports they don’t have facilities. For example, gymnastics is our fortress but we don’t have facilities. We don’t have weightlifting and even athletics, the only thing they can boast of is the tartan tracks,” Oladapo said.\n“The football pitch is the only one that gets attention. Most of us use private gyms where we pay from our source. We don’t have good facilities, we don’t have indoor halls and gymnasts have to train on the runway of the long jump area. They just bring their apparatus there and train. Even our table tennis athletes train in a primary school near the stadium,” Ogunleye told The PUNCH.      \n“Aside that, there is another place we call Pavilion along Iyin Road, where volleyball and basketball players train.”\nThey also said no athlete, except players of Ekiti United FC, are under the payroll of the state government, hence the athletes only get paltry allowances during national events or any other competition they attend.\nIt was also gathered that the sum of N20m was approved for the participation of the state at the 2023 Youth Games, which is the second highest amount of money any of the state’s contingent will receive for participating at any national event.\n“For the Governor to have released N20m for the Youth Games, it means he is really committed to sports in the state because the highest money we have received ever was N23m or thereabout during the Eko 2012 National Sports Festival. I remember we protested before we got N2m for 32 athletes during Abuja 2018 festival,” Yusuf Ismaila, the Chairman of Ekiti State Athletes Association, told The PUNCH.\n“So, for me I believe the state government will do its best for sports development in the state but it’s up to our administrators to do things accordingly,” he added.",
    "NFF retains Danjuma as Falconets coach": "The Nigerian Football Federation has retained the services of Christopher Danjuma as the head coach of the women’s U-20 team,  PUNCH Sports Extra reports.\nThe decision comes after Danjuma and other applicants underwent a screening and interview exercise by the federation’s Technical Committee.\nAccording to a statement from NFF Director of Communications, Ademola Olajire, Danjuma’s appointment was approved by the NFF Executive Committee.\nDanjuma will be assisted by the trio Mansur Abdullahi, Effioanwan Ekpo and Yahaya Audu.\n\n\n  \nAbdullahi was previously an assistant coach with the U-17 and U-20 women’s team.  Related News   WAFCON qualifier: NFF confirms Sao Tome withdrawal  NFF to hand Waldrum new Falcons one-year deal  NFF approves new NPFL name   \nFormer Falcons’ midfielder, Ekpo, on her part, represented Nigeria for a decade between 2000 and 2010, featuring at the 2003 and 2007 FIFA World Cup finals in USA and China respectively.\nShe also featured at the 2004 and 2008 Women’s Olympic football tournaments in Athens and Beijing respectively, the 2007 All-Africa Games in Algiers, Algeria and was a three-time Women Africa Cup of Nations winner.      \nAudu, who has been the goalkeeper trainer of the team, also returns to his position.\nThe Falconets will commence their 2024 Women’s World Cup qualifying campaign with a second-round, first-leg encounter against their counterparts from Mauritius in Saint Pierre on October 8, with the return leg scheduled for the MKO Abiola Stadium, Abuja on Saturday, October 14, 2023.\nColombia will host the 2024 U-20 Women’s World Cup finals.",
    "Medlin Couture: Elevating Nigerian Fashion on the Global Stage": "Lagos, September 27th, 2023 – Medlin Couture, a renowned name in the fashion industry, has embarked on an extraordinary journey from Lagos to the prestigious London Fashion Week, solidifying its position on the global fashion platform. This remarkable achievement not only underscores the brand’s unmatched craftsmanship but also highlights its steadfast commitment to showcasing the rich heritage of Nigerian fashion to a worldwide audience.\nMedlin Couture has always been synonymous with innovation, authenticity, and an unwavering passion for fashion. Seamlessly blending contemporary and traditional Nigerian aesthetics, the brand has consistently pushed boundaries, reshaping the global fashion landscape.\nThe brand’s debut at London Fashion Week stands as a testament to its pursuit of excellence and artistic expression. The collection, titled “An Ode to Victoria,” pays homage to the late muse, Victoria Yina, whose presence radiated strength and joy. This collection encapsulates the brand’s philosophy of seamlessly merging tradition with modernity while celebrating the essence of Nigerian culture.\nIn a world where fashion transcends borders, Medlin Couture proudly embraces its heritage and culture, transcending geographical constraints. The brand’s creative prowess knows no limits, captivating fashion enthusiasts and connoisseurs around the world. \nThe Medlin Couture showcase at London Fashion Week is proudly sponsored by Optiva Capital Partners, a prominent wealth management firm specializing in investment immigration, investment advisory, and insurance services. This partnership underscores the brand’s commitment to collaborating with forward-thinking organizations that share its vision of promoting Nigerian talent on a global scale.\nAbout Medlin Couture:\nMedlin Couture is a prominent fashion brand celebrated for its unique fusion of Nigerian and international aesthetics. Committed to showcasing Nigerian culture and heritage on a global stage, Medlin Couture has established itself as a trailblazer in the fashion industry. The brand’s designs pay homage to tradition while embracing the dynamism of contemporary fashion.\nFor inquiries, or further details about Medlin Couture      \nPlease contact: @medlinboss on Instagram\nAbout London Fashion Week:\nLondon Fashion Week is among the world’s most prestigious fashion events, providing a platform for leading designers and brands from across the globe to present their collections to a global audience of fashion enthusiasts, buyers, and media.\nAbout Optiva Capital Partners: \nFor over a decade, Optiva Capital Partners Limited has been a beacon in the Investments Immigration industry. Supported by a rich network of elite international partners in specialization Investments Immigration, Investments services, advisory, Wealth Management, and Insurance Services, Optiva has established a reputation for excellence with a broad base of knowledge and experience from years of providing solutions to thousands of families.\nFor inquiries about Optiva Capital Partners please contact:\nwww.optivacp.com",
    "Oyexious Designs Studio: Crafting Digital Masterpieces That Define Brands": "At Oyexious Designs Studio, we are not just a creative design agency; we are the artisans behind the digital masterpieces that breathe life into brands. Founded and spearheaded by the visionary Johnson Oye, who is equally the CEO of 3001 Autos, our journey has been a testament to the power of artistry, innovation, and unwavering passion.\nWith a B.Sc in Sociology from Kogi State University and a wealth of certifications, including Adobe Certified Associate (ACA) and UI/UX Design Specialization, Johnson Oye has carved a niche for himself in the world of design, branding and automobiles. His journey into the realm of design was driven by an innate love for art and creativity. As he states, “I love playing with arts and colors, right since I was young. I never saw it as a source of income. It was just based on the passion I have for arts.”\n\nOyexious Designs Studio is more than just a team; we are a close-knit family of creatives, designers, and web/app developers. Together, we embark on a mission to create beautiful and engaging digital experiences. Our expertise spans various domains, from logo designs to web development, app development, and video effects. We craft brands that don’t just exist but stand for something and, more importantly, stand out from the crowd. \nOur dedication to excellence and innovation has not gone unnoticed. In 2020, Johnson Oye was crowned the “Best Graphic Designer of the Year” by AGDA, a testament to his commitment to the art of design. As Johnson Oye humbly puts it, “So far, getting to a point where I get to decide who I want to work with and not the other way round” is one of his greatest accomplishments.\nWe believe in giving back to the community, and that’s why we’re currently working on creating a learning studio (Academy) for young people interested in creative designs. It’s all part of our vision to take Oyexious Designs to a global level.\n      \nFor those aspiring to follow in Johnson Oye’s footsteps, his advice is simple yet profound: “Be Consistent and Intentional in whatever you do. Always know what you want and go for it.” He emphasizes that with determination and a touch of creativity, anything is possible.\nCheckout Oyexious designs Portfolio here.\nContact Us\nReady to embark on a design journey with us? Connect with Oyexious Designs Studio today through the following channels:\nTel and WhatsApp: +234 806 227 3947\nInstagram: @Oyexiousdesigns\nInstagram: @3001Autos        \nWebsite: www.oyexiousdesigns.com\nYouTube: Oyexious Designs\nEmail: [email protected]\nJoin us at Oyexious Designs Studio, where artistry meets innovation, and together, we redefine what it means to stand out in the digital landscape.\nhttps://photos.app.goo.gl/aoXcou377zcvu2PA7",
    "Smirnoff celebrates the power of the collective in the Big Brother Naija All Star Season": "Smirnoff, the world’s number one vodka brand announced the launch of its vibrant new campaign WE DO WE earlier this month. The new campaign aims to champion the power of the collective and celebrate the magic power of ‘WE’ that is created when different people, ingredients, and flavors come together!\nLast Saturday, 23rd of September 2023, Smirnoff Vodka partnered with Multichoice Nigeria for Big Brother Naija All Star Season Smirnoff task. The Big Brother All Star housemates made up of two teams; Team Smirnoff Ice and Team Smirnoff Vodka got to show Nigerians the power of the Collective in an Art and Cocktail challenge.\n\nThe Art task was created by Saga Adeoluwa, a former Big Brother Naija Housemate. In a post on his Instagram page, Saga talks about the collaboration with Smirnoff‘Just like art, when we bring colours together, we create something more beautiful and vibrant, a spark. Art is a WE thing!’. \n\nIn the  Art challenge, everyone was provided with a puzzle piece canvas to create something that represents their identities and experiences. Upon assembling their puzzle pieces, each team discovered the masterpiece they created was a bottle design of the iconic Smirnoff vodka bottle.\nIn the cocktail challenge, both teams; team Smirnoff Ice and Smirnoff Vodka where able to demonstrate that inside every bottle of Smirnoff, whether it’s the classic 21 or Intense Chocolate there are so many different cocktail recipes to satisfy everyone.      \nThey created cocktails inspired by their individual personality and experiences in the Big Brother house. Some interesting cocktail creations made by the housemates were Pinaland- a sweet cocktail representative of the queen of highlight Mercy, Nwadiora inspired by the two sides of Ceec, Sweet Baddie by Ilebaye, The Wrecker by Pere, a cocktail shaken not stirred, Nobody’s mate- inspired by Venita, Angels Knockout, Crossed Eyes, Immunity Card  and Crime Fighter.\n\nAt the end of the Smirnoff, WE DO WE task, team Smirnoff Ice emerged winner. The team has won N3M in prize money and 1 year supply of Smirnoff- Congratulations to Ilebaye, Adekunle, Soma, Angel and Cross.\nSpeaking about the Smirnoff WE DO WE task, Mark Mugisha, Marketing and Innovation Director said: ‘Our fundamental brand philosophy is 1 + 1 = 3. Our partnership with Saga Adeoluwa further reinforces the Smirnoff belief that inclusivity drives creativity. When we bring our unique “me” to the collective “we”, we create a brighter, more ingenious world. When we embrace these differences in collaboration, we create something bigger and more beautiful than any one of us could.’\n\n‘The campaign message around bringing people together feels more relevant and timelier in the Big Brother Naija house. Prior to the Smirnoff task, there had been a lot of tension in the house, as a team we were worried about how the task would be received by the housemates, but we saw this as our opportunity to truly dramatize our WE DO WE brand purpose, that champions the power of the collective and we are glad we took up this challenge. Despite their individual differences, diverse backgrounds and identities, they all united to create magic. As the world’s number 1 Vodka, all we do is about that.’’ Senior Brand Manager Smirnoff Trademark, AbiIpaye.\n        \nThe WE DO WE campaign will continue to evolve over the coming months, bringing the collective spirit to life through a series of events and partnerships spanning music, lifestyle, and entertainment, embedding Smirnoff in the heart and minds of our target audience whilst driving recruitment at scale.\nFollow @Smirnoffng on Instagram and Twitter and @Smirnoffnigeria on Facebook for updates and trends.",
    "Tinubu, Nigerians await your power sector plan": "THE collapse of the national electricity power grid several times in the last one month accentuates the country’s ongoing energy sector crises and raised questions on President Bola Tinubu’s response. The last grid collapse saw power supply crash from a peak of 3,594.6 megawatts to 42.7MW, leading to a total blackout and impacting socioeconomic activities nationwide. Nigeria’s power sector is a disgrace. Everyone therefore expected Tinubu to get cracking solving it immediately on assuming office. He should spell out his rescue plan and begin implementing same without delay.\nBeyond his electioneering promise to “transform” the power sector, reiterated recently at an event in Abuja, and another by the Power Minister, Adebayo Adelabu, pledging to raise output to 20,000MW by 2026, and 60,000MW by 2060, no detailed programme has come from the administration.\nNigeria can ill-afford the inertia. This month, the grid failed twice within five days; and again, twice within six hours, media reports said.\nIn the eight years to mid-2015, the national grid collapsed 99 times. The country struggles to transmit 4,000MW despite a claimed wheeling capacity of 7,652MW by the state-owned Transmission Company of Nigeria, and almost 13,000MW total generating power. Manufacturers say as costs rise, many firms are forced to lay off workers, or close outright. SMEs are devastated. \nPrevious governments failed. Olusegun Obasanjo (1999-2007) provided massive funding to expand generation, transmission, and distribution. Results however did not match expenditure, and massive looting of funds was uncovered.\nUmaru Yar’Adua 2007-2010, also planned to increase power supply to 50,000MW by 2015 with Siemens of Germany as partner. This ambition was short-lived as he succumbed to illness and death.\nGoodluck Jonathan, 2010-2015, inherited and concretised the liberalising Electricity Power Sector Reform Act, and birthed the Electricity Sector Reform Road Map. Fatally, the 2013 privatisation of the 11 distribution companies and six generating companies de-coupled from the former state-owned monopoly was marred by cronyism. Ill-prepared local consortia with little knowledge of the power business won the bids. Global players stayed away.        Related News   Chicago academic record: Atiku plans fresh suit against Tinubu  Nigeria moving to era of concrete roads, says Umahi  Ministers to face quarterly performance review   \nThat treacherous auction has helped doom the industry and the country to underdevelopment and mass poverty. Since then, futilely, the government has injected N3 trillion of taxpayers’ funds in direct intervention. This defeats an objective of asset sales to free government from such expenditure. Other objectives of attracting foreign direct investment, creating thousands of jobs, and stimulating economic growth are also unrealised.\nMuhammadu Buhari’s (2015-2023) Nigeria-Siemens plan to deliver 25,000MW, train 5,000 engineers, and enhance transmission and distribution, faltered.\nTinubu should be different. The World Bank says power outages cost Nigeria $28 billion economic losses annually. The African Development Bank said Nigeria would need to invest about $1 trillion between 2016 and 2030 to close the power gap.\nHe needs to rally technical, financial and international expertise to revive and implement the inherited reforms and a new road map.\nThe 2013 privatisation should be revisited with the objective of attracting FDI and technical competence. The government should relinquish its own stakes in the GenCos and DisCos and encourage the current majority owners to do so too.\nIt should concede majority equity in TransyCo to a reputable multinational through transparent targeted bidding. It should open bids for additional national grids, push through the recent reforms encouraging regional, state-wide, mini and micro grids. Like in other federations, the state governments should compete to attract foreign and local investors to build generating, transmission and distribution infrastructure and businesses.\nNigerians eagerly await Tinubu’s plan, and even more eagerly, its effective implementation.",
    "Gusau varsity students’ abduction, bad omen": "THE abduction of female students at the Federal University, Gusau, in Zamfara State, proves that banditry remains a serious security menace to Nigeria. On September 22, bandits invaded female hostels near the institution in an early morning raid. They captured 30 students, traumatising the victims and their families. It is also a national humiliation. Beyond issuing statements, President Bola Tinubu should implement new strategies to permanently end the perennial security breaches.\nEmploying their familiar tactics, scores of bandits on 50 motorcycles stormed the female hostels in the middle of the night, and escaped thereafter into the forest with their 30 human trophies. As usual, there was no security presence to deter them. Such serial security failures partly explain why banditry persists in North-West Nigeria.\nBy Monday, 13 of the girls had been rescued, although two escaped by themselves. Like his predecessor, Tinubu ordered the military to rescue all the students. These repeated presidential statements ring hollow, as banditry has metastasised. Instead of junketing all over the world while his house is on fire, Tinubu needs to confront that harsh reality or end up a failure like Muhammadu Buhari before him.\nBandits and Islamic terrorists have made a sport of kidnapping students en masse since Boko Haram insurgents abducted 276 schoolgirls at a secondary school in Chibok, Borno State, in 2014. The terrorists also abducted 110 schoolgirls at Dapchi, Yobe State, in 2018. After releasing the others, the terrorists have held on to Leah Sharibu for refusing to renounce her Christian faith. \nThe bandits exploit Nigeria’s vacuous security architecture. In the 15 months to April 2022, UNICEF said bandits kidnapped 1,436 schoolchildren in the North, with Zamfara, Kaduna, Katsina and Niger the epicentre. It said 200 schoolchildren are still in captivity though hefty ransom sums were paid.\nThe Armed Conflict Location and Event Data Project said bandits killed 2,600 Nigerians in 2021. This advertises Nigeria as a failing state. The Fund for Peace listed Nigeria 15th in its Fragile State Index 2023. It is currently the world’s eighth most terrorised country, says the Global Terrorism Index.\nBandits have brought down Nigerian Air Force aircraft in Zamfara and Niger states and attacked the Nigerian Defence Academy, Kaduna. The Institute of Economics and Peace said Nigeria lost 8.0 per cent of its GDP to banditry January 2021 to June 2022.        Related News   Zamfara Varsity: Stop playing politics, appreciate our efforts, FG tells Gov Lawal  Police vow to rescue Zamfara kidnapped students  Probe security lapses enabling Zamfara abductions, Amnesty urges FG   \nNigeria’s centralised policing system facilitates insecurity. Of its 371,000 police personnel, majority are deployed in guarding VIPs. This leaves many communities devoid of police presence. Bandits and other criminals exploit the vacuum.\nMoreover, Zamfara is a hotbed of banditry because illegal mining thrives there. The Institute of Security Studies said 80 per cent of mining activities in the North-West is carried out illegally and on artisanal basis, where banditry is used as a cover for illegal mining. Government should wipe out illegal mining.\nThe deployment of the military in all the 36 states has not worked. Only devolution of policing along with new strategies and wielding strong political will by the national and state governments can neutralise insecurity. \nSwiftly, Tinubu and the state governors should mobilise the National Assembly and the state assemblies to amend the 1999 Constitution to facilitate state policing.\nThe locals must also have a security system they can trust. There are reports that when the locals give information to the security agents, the bandits, who number about 120,000 in the North-West, return to wipe out the concerned villages. Security agents should look into this. There should be joint civilian and security arrangements.\nTinubu should set performance targets for the heads of the security agencies. Instead of hunting regime critics, the Department of State Services should provide actionable intelligence for field agents. The Acting Inspector-General of Police, Kayode Egbetokun, should fulfil his pledge to withdraw the officers attached to VIPs and redeploy them to field operations.\nNigeria must protect its citizens from the rapine of terrorists, bandits and other criminals.",
    "NNPC, supply crude to local refineries": "THE Dangote Petroleum Refinery’s admission that it missed its August target date to commence production because it could not get crude oil from the Nigerian National Petroleum Corporation Limited reflects how Nigeria’s oil industry is being grossly mismanaged. In an interview with S&P Global Commodity Insights, an Executive Director of the Dangote Group, Devakumar Edwin, explained that it was already importing crude and would begin refining between October and November. This is another national embarrassment. Beyond its lame excuses, the NNPC must ensure that local refineries receive adequate crude supplies.\nIt baffles Nigerians and the rest of the world how successive administrations since 1999 entrench the country’s continued dependence on imported refined petroleum products despite being a major producer and exporter of crude. The NNPC which owns and has run aground four refineries relishes this iniquitous role despite its devastating impact on the country.\nAll hopes of Nigeria ending decades of prohibitive fuel imports pinned on the 650,000 barrels-per-day Dangote refinery located in Lagos now appear misplaced. Edwin said the refinery would process crude imported from Angola! More worrisome, the company will reportedly initially concentrate on diesel, and lubricants, ignoring petrol, whose prices have spiked and created further hardship for Nigerians.\nAt peak production, Nigeria is Africa’s largest crude producer. Relying on multiple sources, Yahoo Finance ranks her the world’s 15th top producer, and Angola 16th. Nigeria’s production currently hovers between 1.22 million barrels per day and 1.5 million bpd. It has an OPEC quota of 1.78mbpd and capacity for much higher. \nNNPC has no defensible excuse not to supply the Dangote Refinery, all the established and upcoming modular refineries, as well as its own four comatose refineries in Port Harcourt (two), Warri, and Kaduna with combined capacity of 445,000 bpd. The government and the NNPC upturn the country’s comparative advantage and inflict misery on Nigerians.\nBelatedly, NNPC, which owns a 20 per cent stake in the Dangote Refinery, says it will start supplying the facility crude in November.\nIt should immediately start supplying the modular refineries too. The Crude Oil Refinery-owners Association of Nigeria says that its member-companies are barely surviving because NNPC does not supply them crude, leaving their refineries idle.        Related News   Dangote refinery imports crude as NNPCL swaps oil for loans  Nigeria loses 14.94million oil barrels worth N703.96bn –Reports  Crude nears $70, raises fear of federation account depletion   \nThe NNPC’s inability to supply the domestic market is linked to the decades-old industrial scale oil theft undermining Nigeria’s production capacity. The National Security Adviser, Nuhu Ribadu, said recently that Nigeria is still losing 400,000bpd to oil thieves, representing about $4 million lost daily. That is enough to meet the needs of the four moribund public refineries. NEITI said Nigeria lost N1.96 trillion to oil theft, sabotage, and production adjustment in 2021.\nPresident Bola Tinubu should clean up this mess. Realising self-sufficiency in refined products should be adopted as a national emergency. This should be private sector-led, with the government selling the four refineries immediately in transparent, corruption-free, and cronyism-free auctions to reputable investors to attract foreign investment and foster competition in the downstream oil sector. Tinubu should halt the continued waste of public funds on futile turnaround maintenance contracts.\nSurprisingly, Tinubu, like his predecessors, appears comfortable with the current absurdities. The National Bureau of Statistics said Nigeria spent N16.9 trillion importing petrol between June 2015 and October 2022. The NNPC’s crude swap arrangements for refined products gulped N2.6 trillion in 2021, NEITI reported. Subsidy on imported products cost N4.39 trillion in 2022, and N3.36 trillion in the first half of 2023. The effects on the economy are shattering.\nOther countries manage their resources and run their national oil companies more rationally. Saudi Aramco made a profit of $110 billion in 2021. Brazil’s Petrobras closed 2022 with a profit of $36 billion. Both are major crude producers as well as major refiners.\nTinubu should shrink NNPC into a holding company, and an investment subsidiary, while privatising all its midstream and downstream assets, and restrict the government to industry regulator.\nEverything should be done to provide domestic refiners with crude; Tinubu should see to this.",
    "PUNCH Panorama: Dealing with curses through hard work": "A young man posted on social media about how someone cast a spell of death on him but he didn’t die till date. This is the reality with most people. They deal with many curses in their lives but most of them get stalled with those curses and they don’t move on. However, it is important to focus on one’s natural talent and work hard, no matter the curses or spells cast on someone. It is said that if focus is placed on the spiritualities of life, one may be too scared to face the realities. Do you agree? Please listen and share your thoughts.",
    "PUNCH Panorama: Why people marry from within their cultures": "Adaora, the daughter of Anambra State Governor, Prof Chukwuma Soludo, recently got engaged to her partner, Arinze, in Morocco. From their names, one can tell that they are from the same region of the country, which is the South-East. With reference to their union, we will discuss some of the reasons why some people decide to marry from their culture. Please listen and share your thoughts.",
    "PUNCH Panorama: Being resourceful in marriage and dating": "A young man posted recently on social media how his fiancee was not resourceful enough and he had to push her on what to do. He loves the lady who comes from a good background but feels she’s not well self-driven enough. In our world, it seems many people think they have to guide ladies and women, especially, when it comes to dating and marriage. Many people tend to push the girl child or female gender into what they want them to be. But is this right? Please listen to our podcast and share your thoughts.",
    "Tribute to Dare Adeleke at 60": "In a world filled with remarkable individuals, there are certain people who etch indelible marks on the sands of time.\nIt is not surprising that the drum beats of activities leading to this remarkably blessed day, September 28, started over a month ago in honour of the man who is a beacon of hope to his community, the people of Oyo and indeed so many others whose paths and lives have been illuminated by the shining light of Oyo. Today, on this unforgettable diamond jubilee, the people of Ibadan, the indigenes of Oyo and all Nigerians have gathered to pay tribute to a man whose achievements prior to this significant milestone are gargantuan and worthy of all accolades.\nDare Adeleke is a resolute believer in humanity and he has poured in resources, time and wealth impacting on everyone around him and anyone who encounters him. Though born a prince from a royal and respected ancestry, a lineage of wealthy warriors and kingship, Adeleke’s humility surprises those who have met him.  His kindness and empathy for humankind is legendary. Having spent time in Europe in his early youth, Adeleke was filled with a burning desire to serve his country and hence began the birth of an untainted political career.\nWith the return of Nigeria to democracy after several years of military rule, the young Adeleke involved himself in the formation of the new party, the Peoples Democratic Party, and became the first Youth Leader of the South-West zone. The PDP went on to win the election by a landslide. Adeleke, whose passion for the grounding principles of the party is not hidden, has remained in the PDP since formation. A man of formidable willpower and convictions, Adeleke has never deviated from the party and has been with the PDP through thick and thin, serving in different capacities on state, zonal and national levels, actively involved in crises management on every level and at all times, however rocky the boat became. \nAdeleke, while shying away from holding elective positions, has always thrown himself into the electoral process, fully participating, supporting and giving his all to candidates who emerge as officers and standard-bearers of the PDP. Some may call him a kingmaker but Adeleke would rather say he is a simple party man. Known as a grassroots mobiliser, politicians are wise to the fact that with ‘Dare Power’ in their corner, the job is already half done.\nYet, humbly, Adeleke trudges on asking nothing, expecting nothing, accepting the vagaries of politics with pride, dignity and integrity, and never compromising on honour. Those who know him know that for Adeleke, a good name is better than silver, gold and diamonds: a value he has instilled in his children, both biological and adopted.  Related News   Kaduna crash: Fiancée of about-to-wed NAF pilot pens emotional tribute  Kamala Harris pays heartfelt tribute to late mother, American women  Kanayo, Bob Manuel, Uche Jombo, Ezuruonye, others pay tributes to Chico Ejiro   \nA firm believer in education, Adeleke holds bachelor’s and master’s degrees. Our hero today, on this landmark diamond jubilee, is a fulfilled man basking in the good memories of times past,  achievements that are lasting legacies, and looking forward to a future of new exploits and exploration in the service of God, the people, Oyo State and Nigeria.      \nToday, let us reflect upon the life of this extraordinary being, an angel amongst men, a man who stands by his friends through thick and thin, a warrior like his forebears who fears no one but respects everyone, a man of wisdom and a large heart who has shaped countless lives and inspired us all.\nLet us learn from his triumphs, his challenges, his belief in giving and his mantra of good over evil, his unwavering courage in the face of the most daunting foe, his loyalty to friends, his unwavering resilience and courage. These are the attributes through which he has emerged stronger and more noble, even in the face of adversity.\nLet us now clink our glass in honour of a man to whom honour is due, the most accomplished Dare Adeleke.\nWe wish you a very happy birthday, long life, prosperity and more and more of God’s blessings.\n\nMoji Danisa writes this piece",
    "Developing technology for national productivity": "Nigeria grapples with a myriad of problems bordering on underdevelopment. The infrastructure deficit across the country and low human capital development index demonstrate the country’s backwardness. Past administrations of the country, including the military, enunciated development plans but to no avail. Rather than moving forward, the country keeps retrogressing, as it fails to embrace key factors that influence development –experiential education, science and technology. We pay lip service to the development of science and technology.\nWe need to rejig our educational system and stop the unproductive system of education that Paulo Frieire describes as a “banking” system of education that encourages the dumping of content on the students while they just memorise without processing before internalising it. This “banking” system of our educational sector discourages purposeful enquiry. We have to move away from the idealistic approach to traditional education and from the behavioural theories of learning. James Bruner in his influential book, “Towards a Theory of Instructions,” makes the point that the purpose of education is to stimulate inquiry and skill in the process of acquiring knowledge. He asserts that “knowing is a process, not a product.”\nWe must discourage Nigeria’s “banking” system of education. The new normal in our educational system should be “experiential,” which is the process of learning by doing. This can be achieved by engaging students in hands-on experience and reflection in such a way that students are able to connect theories and knowledge learnt in classrooms to problem-solving in real-world situations. There is a serious need for technological courses in our secondary and tertiary education institutions. The government must ensure the provision of state-of-the-art technological equipment that will aid effective knowledge production and acquisition in our schools.\nThe teeming youths in the country (both secondary school leavers and graduates) can be trained and retrained to become self-reliant by creating centres for innovative studies across the country, possibly, in each senatorial zone, to enhance their knowledge of ICT for micro economic revolution. For instance, if every National Youth Service Corps member is mandated to undergo this type of training for at least three months out of the 12 months, it will be an effective way of taking them off the streets after their mandatory service. This will equip them as job creators and not job seekers.   Related News   Embrace technology, TRCN tells teachers  Akinses: A couple united by love, technology  ‘Coding skills make children globally relevant’   \nNigeria needs to develop the required technology to drive both the depth and diversity of its revenue, promote job creation, and ultimately improve the living standards of its citizens.\nNigerians are looking up to the Minister of Science and Technology, Uche Nnaji, to lead the way in our quest for infrastructural and human capital development. Going by his antecedents in the private sector, he has the know-how to manage the ministry and guide the country in harnessing the benefits of science and technology. The ministry has 17 agencies, mostly research-based, and therefore positioned to contribute to the development of local content in all areas of the economy. In the pursuit of science and technology for innovation and development, different countries formulate policies geared towards domesticating and harnessing the benefits of science and technology. In Nigeria, we are yet to see meaningful innovation and development anchored on science and technology.\nThe 2012 Science, Technology and Innovation Policy was designed to resolve practically the long standing disconnect between economic planning and science and technology. However, the country remains underdeveloped, not because the various agencies of the ministry are not inventing products through research and development, but because of the disconnect between the ministry and the organised private sector that should commercialise the research results. This disconnect must be reversed to ensure that the private sector relies on our research institutions for technological solutions. This reliance will motivate the private sector to invest in research institutions and sponsor research as it is done in developed nations. Nnaji comes from the organised private sector, and we are confident that he will bridge the gap between the research-based agencies and the industrialists/entrepreneurs to facilitate the commercialisation of the research results.      \nPresident Bola Tinubu made the best choice in appointing Nnaji as a minister. The portfolio he has been given to man suits his credentials. One can say unequivocally that Nnaji is a round peg in a round hole.\n\nNnaji Onovo writes via jekwuon[email protected]; Dele Ugwanyi writes via [email protected]",
    "Nigeria on path to greatness again": "Today, the National Assembly, the truest custodian and guardian of Nigeria’s democracy, resumes plenary after a 49-day annual recess. Contrary to what most people believe, annual recess is not a period of recreation or vacation for us as representatives of the people across 109 senatorial districts and 360 federal constituencies nationwide. Rather, it is a time when we go back to our constituencies; render account of our representation and aggregate inputs from our constituents.\nThat was exactly what we committed our energy, resources and time to between August 8 and September 25 when we were on annual recess. Again, we have resumed plenary, prepared, ready and armed with first-hand feedback central to the development and progress of Nigeria, a federation that exudes the hope of black nations beyond the shores of this continent.\nWe recognise that we are at a critical time, a truly challenging time when our economy is inherently susceptible to a vicious global economic crisis that does not even spare the world’s greatest economies. We note with concerns foreign exchange instability, which has been driving up prices of goods and services nationwide. We also understand insecurity, especially in the North and its implication for food production, affordability and sufficiency.\nJust after our inauguration, both chambers have been busy, indeed hard-pressed, responding decisively to our national challenges one after the other. We also have considered and approved different requests from President Bola Tinubu aimed at resolving these challenges. We have been treating all these requests consistent with our mandate under Sections 4 (1-4) and 147 (2) of the 1999 Constitution. \nAs representatives of the people, we are utterly committed to these provisions, bringing the bills that were duly enacted by the National Assembly to the President for assent. This has led to the signing of the Electricity Act, 2023; Data Protection Act, 2023; Judicial Officers Act, 2023 and Access to Higher Education Act, 2023. Each of these legislations is designed for the purpose of addressing our inherent internal challenges in one area or the other.\nBesides, we promptly considered the request of the President to extract N500bn from the 2022 supplementary budget aimed at cushioning the effect of subsidy removal and providing palliatives for the vulnerable. We also treated with a sense of responsibility the request of the President to screen ministerial nominees that now constitute the Executive Council of the Federation in line with Section 144 (5) of the 1999 Constitution. While screening the nominees, we were sitting from morning to dusk, sacrificing our comfort, leisure and free time in pursuit of the general welfare of our people.\nBy these interventions, the President has been able to constitute the Executive Council of the Federation and initiate pro-people reforms that his administration has been implementing. This is a clear demonstration of robust executive-legislative collaboration, which we must, cautiously and consciously, culture and nurture for the purpose of deepening our democracy, attending to issues of national interest with speed and creating a socio-political environment that will truly place Nigeria on the pedestal of greatness.      \nSo much has been achieved so far between the time we embarked on our annual recess and now. A lot more is expected to happen now that we have returned from constituency assignments. We have come back with feedback from over 220 million constituents nationwide. We are now prepared to process them already aggregated nationwide. We are equally ready to mainstream the feedback into various development, economic and fiscal policies that the Tinubu administration will introduce in the near future.\nThe coming days promise to be truly engaging and even hectic for different reasons. First, we are expecting the President to present the 2024 appropriation bill, which we all believe, will chart a clear part to national peace, progress and prosperity. We strongly believe the bill will come with empirical and practical antidote to all our challenges. After the presentation of the bill, every committee of both chambers will be busy scrutinising and vetting the budget proposals of all ministries, departments and agencies consistent with Section 80 of the 1999 Constitution.\nSecond, we are equally under obligation to interrogate and screen former Chairman of the Board of Directors of Citibank Nigeria, Dr Oluyemi Cardoso, whom Mr President recently nominated for the position of the governor of the Central Bank of Nigeria. Mr President has nominated Dr Jamila Ibrahim and Mr Ayodele Olawande respectively as the Minister of Youth and the Minister of State for Youth. Each of these ministerial nominees is required to be meaningfully engaged before they can serve in the Executive Council of the Federation.\nAs pointed out earlier, Nigeria is obviously at a critical moment given circumstances that place households under economic pressures and diverse issues that still complicate insecurity, especially in the North and South-East. In spite of the internal challenges we may be facing today, the world is waiting for Nigeria, not just as Africa’s most populous country, but also as its largest economy and democracy. As a nation of purpose, we too can no longer wait for the world as shown in recent foreign trips from which the President just returned.\nAgain, investors – domestic and foreign – are excited with the gradual emergence of a new political and economic order in Nigeria, the kind that prioritises the people; that incentivises the investors and that places the highest value on human dignity, shared prosperity of our people and the rule of law. This is evident in the outcomes of Mr President’s foreign trips to the 2023 G-20 Summit held in New Delhi, India between September 9 and 10, 2023.\nAt this historic summit, Nigeria is perhaps the biggest beneficiary as indicated in the resolutions of different bilateral meetings held on its sidelines. The President led a team of passionate leaders comprising ministers and captains of industry to this summit with an unambiguous purpose. At the end, Nigeria graciously secured significant investment commitments. India’s conglomerates and multinationals alone signed pledged $14bn in investments.  Related News   Nigeria, Benin lose AFCON 2027 joint bid  National Assembly budget stagnant for 13 years — Speaker  Nigeria loses AFCON 2027 hosting right bid   \nThis does not include what Canada and South Korea also pledged at the historic summit that sparked endless arguments at home on whether the G-20, an intergovernmental forum of 20 largest economies in the world, is complete without Nigeria, especially when South Africa and the African Union have been accorded the permanent membership status. I will not dig deeper into this aspect of our national life due to paucity of space.        \nBesides the G-20 summit, the President just returned from the United States where he attended the 78th United Nations General Assembly. His speech at this summit brought back Africa, not just Nigeria, to the epicentre of global conversation again. The takeaway from the UNGA is loud and clear: Nigeria, indeed Africa, can no longer wait for the world to solve its myriad of internal challenges.\nBut the global actors, as the President canvassed, must stop the heinous exploitation and pillaging of Africa that has been ongoing since the European invasion of Africa in the 19th century and its integration into the global capitalist order subsequently. This message is clear enough. The world has heard us well. Nigeria, the indisputable giant of Africa, is standing with other nations to redefine our history from crisis to calmness, from despondence to development, from dictatorship to democracy and from penury to prosperity.\nBeyond the benefits of the foreign trips, the President has initiated ambitious economic reforms, which aims at opening up Nigeria to the world; attracting foreign direct investments and creating limitless opportunities for our people irrespective of where they reside. This, I believe, will take the centre stage in the 2024 expenditure framework that Mr President will soon lay before the National Assembly for consideration.\nEven before then, the reforms have been reflected in the review and realignment of MDAs. Unlike predecessors who worked at different fronts to make Nigeria great, the President has prioritised the blue economy by creating the Ministry of Marine and Blue Economy. To our critics, this initiative is not the priority of Nigeria to turn away the tide of penury and unemployment.\nHowever, secondary statistical evidence reveals the contrary. First, according to the World Bank, the blue economy annually values $1.5tn globally, provides over 30 million jobs and supplies a vital source of protein to over three billion people. By 2030, based on the recent forecast by the Organisation for Economic Co-operation and Development, the blue economy will double in volume to $3tn.\nSecond, Nigeria sits directly on the South Atlantic. By implication, Nigeria runs an economy that largely depends on the sea. Apart from accounting for over 65 per cent cargo in West Africa, our oil production mainly takes offshore. Aside, our maritime space hosts several oil, gas and communication installations with huge contributions to our GDP. This space, I strongly believe, deserves more than passive interests. That is what Mr President has already shown by creating a ministry to supervise the activities of the maritime actors and leverage the sector to further create opportunities for our teeming population\nThe same applies to the Ministry of Arts, Culture and Creative Economy, which Mr President created to harness the energy of our youths. As shown in recent reports, our creative industry currently values over $10.4bn with the potential to grow to $14.8bn in 2025. Aside, this industry employs over 4.2 million people and will create 2.7 million more jobs by 2027. These figures simply suggest that the creative economy is a way to go and certainly deserves special attention that the President has already accorded it.      \nAll these statistics obviously justify all the pro-people and progressive reforms the President has been initiating and pursuing since his assumption of office. As a people of purpose curiously yearning for real economic development and opportunities, the presidency needs our support as much as our prayers to pull Nigeria out of doldrums and place her on the path to greatness and progress that cannot be reversed or truncated.\nAs the representatives of the people, we also recognise all the reforms that the President has been promoting. We also recognise that some of these initiatives will require the input of the National Assembly by way of legislation. As we resume plenary today, we are under obligation to consider all the requests that the presidency will be initiating henceforth with due diligence and not dissension, with collaboration and not conflict, and with shared responsibility and not rascality.\nI am confident all the members of the National Assembly across the political divides are ready to objectively support all the reforms of the President with a view to resolving diverse internal challenges confronting us as a federation; creating vast opportunities for our teeming young population and charting a sure path to greatness for our fatherland in all ramifications.\n \nBamidele, Leader of the Senate, writes from Abuja",
    "How failed transactions, unreversed funds  frustrate bank customers": "In this report, VICTOR AYENI examines how poor services, failed transactions, and blocked accounts are frustrating many bank customers and why Nigeria’s current structures are not sustainable for efficient digital banking\nOn a hot Wednesday afternoon in July, Folasade Ayoka, an administrative manager in a multinational firm in Ikeja, Lagos, rummaged through her bag looking for her Automated Teller Machine debit card.\nHer firm’s Managing Director had just returned from a foreign trip and needed to take some lunch before going to a meeting.\nWith a sense of urgency, Ayoka picked up her debit card and walked briskly to a restaurant close to the office to purchase food for her boss. \nNarrating her experience with Sunday PUNCH, she said the food purchased was worth N6,000 but when she gave her debit card to the food vendor, she ran into a snag.\nShe said, “When she inserted my card into her Point of Sale machine, it didn’t indicate that it had deducted the amount. The lady told me that the PoS was indicating that my transaction had declined and she told me to go withdraw money from the nearest ATM to pay her. Meanwhile, the food I bought was already getting cold.\n“I ran to the nearest machine to withdraw cash but it was showing that it was temporarily out of service because there was no more money in it. Then it occurred to me to make a transfer through my phone but there was no network too. It was as if everything was just against me.      \n“I went outside, changed my standing position, and did all I could, yet my bank app was not opening. I stood there that day with the sun licking my head and my phone rang as my colleagues called me to ask what happened, reminding me that my boss was hungry and the time for his meeting was close.”\nWhen Ayoka returned to the restaurant and pleaded with the lady to allow her to deliver the food first and make the transfer from there, she complained that she had lost much money to customers who would promise to make transfers at home due to bad bank services but would often fail to honour their promises.\nAyoka continued, “I gave her my name and the department where I worked and assured her that I would return to pay for the food. She gave me an account number and I made a transfer when I got to the office. I also thanked her for her trust and notified her that I had made the transfer.\n“Later that day when I went to check my bank app, I realised that the transaction that she said was declined had gone through. My N6,000 was deducted. I sent her screenshots to inform her that I had made two payments to her due to poor network. She replied to me sending her a screenshot that the first transaction was declined but on my end, I saw that the money was credited to her account twice.\n“The issue led to a heated argument on the phone. She told me to go to my bank to refund the first money I sent, but that didn’t make any logical sense because I had evidence that I was debited twice.”\nWith the issue left unresolved, Ayoka called the eatery again the next day, but this time, the owner of the restaurant overheard the back-and-forth argument.\n“The woman took the phone from the lady and I explained to her what happened and she advised me to send an email to my bank because a similar thing had happened to her too.        \n“I sent an email to my bank and surprisingly, after 10 minutes and assured me that they would revert after tracking the transactions. They asked me to give them seven days. After a while, the money was paid back to my account,” Ayoka added.\nLike Ayoka, a Lagos-based content creator, Femi Gbadebo, also told our correspondent about a not-too-pleasant experience he had with banking software which was eventually resolved by emails.\nGbadebo said, “I transferred N10,000 to a friend using the app of a particular bank and it showed me that the transaction was declined yet I was debited of that amount. I quickly sent a mail to the bank I use but I didn’t get any acknowledgment or response from them so I just assumed that the issue was going to be rectified.\n“Three weeks later, my friend called me on the phone to tell me he never received the money I transferred. It was then I remembered the failed transaction was not refunded by my bank.\n“I resent my mail and they credited me the money and the transfer went through. It took the bank three weeks to resolve this issue and I believe if I had not resent an email that would have been the end.”\nPressure on banking services\nIn an era of digital banking, both Ayoka and Gbadebo’s experiences with faltering bank apps and service glitches resulting in failed or double transactions are not farfetched.      \nThese complaints have reached a crescendo of daily customer feedback on the platforms of many Nigerian banks across social media.\nFollowing the directive of the Central Bank of Nigeria for the swapping of old naira notes for new notes in January, many banks shut out their customers and disabled their ATMs and over-the-counter operations.\nMany Nigerians became cash-strapped and opted for mobile banking. Customers lamented increasingly erratic digital services and failed monetary transfers or taking 48 hours or more to deliver.\nAside from the bank apps, pressure also mounted on the Unstructured Supplementary Service Data, an alternative transaction channel, which led to an increase in failed transactions on the channel.\nA report by The PUNCH in February showed that Nigeria’s mobile banking usage surged by 230.72 per cent year-on-year in January according to data from the Nigeria Interbank Settlement System, despite multiple reported failures.\nExplaining why banking apps failed, the Chairman, Voriancorelli and Cofounder Cellulant, Bolaji Akinboro, noted that while Nigeria’s technology and payment system is vibrant, the country still needed to invest in its infrastructure.\nHe said, “The way I will look at it is this: what are the failure points? Because there are the payment apps and the digital payment services; the ones we all use to access all this stuff. I think these can carry the pressure.  \n“The question is the route. If you want to use your app, you need to ride on the mobile backbone. The real issue to me is not the banking layer, it is the communications backbone. Regarding the communications backbone, Nigeria is not investing right in terms of infrastructure.”\nMonths later, with the availability of naira notes, several bank customers still have sad stories to tell about failed banking services.\nSpeaking with our correspondent, a pharmacist, James Uche, said, “I have experienced non-refunded monies on several occasions but presently it is no longer as bad as it used to be. Recently, I made a transfer of N1,500 to a friend and I was debited, I saw the alert but the person didn’t get the money.\n“This problem has been recurring and I don’t have the luxury of time to go to my bank to complain each time it happens. As we speak, I have about N5,000 that I have been debited but the people I sent them to didn’t receive them and there has been no reversal.\n“There was a day in 2021 when I bought some medicines worth N8,000 for a family member. I was debited and it was reversed. Do you know that two years later, out of the blue, I was debited that same money whereas I made no transaction? I think this is their way of pilfering people’s cash because when they take N1,000 from one person and N2,000 from another, they get more profit while the customers are losing.”\nRecalling another experience that happened a few years ago, Uche added that he was debited N4,500 which was the last money in his bank account.\nHe said, “I stayed hungry for almost a week because I had to resort to borrowing money. I went to the bank to complain but they told me they couldn’t track who deducted the money from my account.      \n“It wasn’t until I stormed there in anger that they traced where the money went and refunded the money the next day. This particular bank improved its services for some years until this year when its services started failing again.\n“There are two other banks that I use currently whose services are like instruments of torture. They frustrate and exploit their customers. The only ones I think are reliable are two recent ones commonly used by POS owners,” he added.\nAn entrepreneur who gave her name simply as Juliet described how a withheld transfer has put her at loggerheads with one of her clients.\n“I used a bank app to transfer N27,000 to a client as a business transaction. She didn’t get that money, but my app showed me that it was sent. This issue has led to bitter arguments and verbal exchanges. Why is this bank frustrating me?” she queried.\nScam codes and alerts\nNarrating her experience to our correspondent, a fashion designer, Folake Adeleke, said she had gone to a cake shop with her sister one Saturday when she had a failed money transfer.\nShe said, “We bought a cake of N13,000 and my sister used my ATM card to pay, but the store said they didn’t see the money but my account was debited. We had to make another transfer.        \n“I was hoping that my bank would reverse one of the transfers by Monday but that didn’t happen, so I complained to their customer service. I went to Twitter (now X) to drop a message for them, unfortunately, I didn’t know the people who replied to me posing as the bank customer representatives were scammers. One of them told me to chat with them on WhatsApp.\n“I chatted with the number on WhatsApp and lodged my complaint and they asked me when I made the transaction and I gave them the details they needed. The person on the other end told me that I should dial a code that would help them trace my money and send them an OTP that would be sent to me. I did as instructed.\n“The network was bad that day so by the time I sent them the OTP, they said it had expired. Not knowing their true intentions, I messaged them the next day and they asked me how much was in my account and I told them I had N5,000. They repeated the process and immediately after I sent them the OTP, I got a debit alert.\n“The N5,000 remaining in my account was removed! That was when my eyes opened. The number blocked me immediately. Someone then gave me the correct customer care number for my bank and I was left on the call with a song until my airtime got exhausted. I was frustrated.”\nNot one to throw in the towel, Adeleke called her bank the next day and lodged her complaints. She was assured that the transaction would be rectified within five working days.\n“They told me that those scammers would no longer have access to my account but after five working days, I didn’t see any change. The next time I called them, I was angry so I spoke harshly to them on the phone. My money was refunded after four working days,” she added.\nCriminals have also been known to use Short Message Service disguised as transaction alerts from banks to defraud unsuspecting victims, especially small-scale traders and PoS operators.        Related News   Customers worry over deposit safety despite bank fraud decline  Bank customers lose N472m to fraudsters in three months –Report  Bank customers get N115bn, $22.7m refund for failed transactions   \nOur correspondent gathered that certain software applications which include Lofty SMS App, Millionaire Fake Bank, Flash Fund App, Money Prank Pro, and Pro and Fake Alert Maker for Android, are used by scammers to make it seem that a person’s account has been credited or debited.\nA shoemaker in Ketu-Ikosi, Lagos, Mr Niyi Babajide, said, “I make sandals for sale. This thing happened to me during the period of naira scarcity, when banks had problems with failed transfers.\n“Someone came here to purchase sandals to the tune of N15,000 and he claimed to have sent the money to me but he was lying. He showed me his debit alert and kept saying I was the one who hadn’t received the alert.\n“Eventually, I took his phone number in good faith because he tried to convince me that it was my bank that didn’t send me the alert. Till today, I never heard from him again. I am sure this is his tactic of scamming people. People use these fake transactions especially if they have your phone number, they will compute a false text message and send it as if it’s coming from your bank.”\nBabajide added that many business owners prefer to check their bank apps to be sure they have received a credit or debit alert. “These bank apps are what have been helping people instead of relying just on text message alerts,” he noted.\nAn egg seller in Magboro, Ogun State, Mrs Bunmi Somoye, also told our correspondent that she was scammed with a fake alert by a customer.\n“Someone came here to buy five crates of eggs and lied that it was my bank that didn’t send me an alert. This man sounded so convincing that he had been debited and he showed me his alert.      \n“When he was becoming petulant, I took down his number so we could call him if I didn’t see the alert. Both the credit alert and the eggs have remained unseen since that day. The phone number he gave me also became unreachable.”\nA woman who operates a pub in Isolo told Sunday PUNCH that she no longer accepts transfers from customers since the time of the naira scarcity due to the losses she incurred through scam alerts.\n“I don’t accept bank transfers anymore. During that period, many people made away with my money under the guise of failed bank transfers and scam alerts.\n“I understand that technology can be unreliable sometimes, but our people too are too dubious. It was by God’s grace that my business didn’t go under. It was so frustrating because these people would come with sweet tongues but they are robbers. I have cursed all of them,” she said.\nIn a recent report, the Nigeria Inter-Bank Settlement System Plc said there was a need for citizens to check out for misspellings in the credit alerts they receive.\n“Check the credit alert you received if it contains your bank. The real bank alert will show you how much you had before the alert and after the alert; have a precise knowledge of how much was in your account.\n“If you get an email alert, check the email source and ensure it comes from your bank’s official account and check the authenticity of the mobile app used,” it stated.      \nLocked accounts \nDescribing her frustration with her former bank, a medical worker in Benin City, Mrs Abidemi Awopetu, told our correspondent that her account was locked by the bank after she transferred N150,000.\nThe mother of two added that while she got a debit alert on her first account, there was no notification that her other account was credited.\nShe said, “There wasn’t even any indication that it was blocked. I received no message. I only noticed that they deducted N1,000 and I thought it was the maintenance fee that the bank deducted.\n“Three weeks later, I went to withdraw some money from that second account because my children wanted to travel for the summer holiday and I needed to buy some things for them and I needed some money for personal use. I desperately needed the money but my bank told me that my account had been blocked.\n“They explained that it was probably because I had not used the account for a while and it was a current account. I asked them for the process to unblock the account and they gave me some forms to fill out and look for referees that will stand in for me to re-open the account.\n“Almost every day for a whole week, I was going there and returning their forms and they would give me another form to fill out. I couldn’t withdraw or transfer from that account and I kept asking them about the account that was blocked, and they started to give me excuses that I would have to wait because there was no network.”      \nAfter two weeks and nothing was achieved, Awopetu insisted on seeing the bank manager and began to raise an alarm in the banking hall.\n“This was the time when my salary wasn’t even coming in so it was so traumatic for me. After they eventually opened my account, I found out that I couldn’t transfer more than N20,000 so when would I withdraw N100,000?\n“Two weeks ago, I just went there and withdrew all my money from my account there. That bank’s service is really poor,” she added.\nOn his part, an Abuja-based teacher, Charles Thomas, said he had four bank accounts which he opened with four new-generation banks, but lamented that the services provided are often discouraging.\n“My problem with these banks is unseen alerts. Money will be sent to you and you will not see an alert but as soon as one withdraws the money, the alert will come in.\n“There was a time when about N80,000 was sent to my fourth account. I needed that money that same day to give it to my business partner but the bank froze the account saying that the money was too big for the account.\n“The issue caused me a serious problem with my business partner. I thought that if the money was ‘too big’ then why couldn’t they return it to me? But they kept my money against my wish. It was a sad experience,” he told our correspondent.      \nExperts lament weak tech facilities\nA report by the Sunday PUNCH in June highlighted the effect of mass resignation and emigration of tech workers on financial institutions across Nigeria.\nMany banks have been reported to suffer from poor mobile services as a result of having lost workers to the exodus of tech talents out of the country.\nThe Chief Executive Officer of Sterling Bank, Abubakar Suleiman, in a meeting with journalists in 2022 lamented, “So many of our very experienced talents especially in the area of software engineering are either leaving the industry or leaving the country.”\nHowever, tech experts point to the need for more digital platforms that would serve as sufficient backbone for more efficient bank services.\nA United Kingdom-based software engineer, Mr Henry Erabor, in a phone interview with Sunday PUNCH, explained that many banks are connected to middlemen.\nHe said, “Some of the issues with mobile apps used by banks in Nigeria have to do with failure in transactions, particularly when you are trying to do a transfer from one bank to another. The issue often boils down to the medium for sending transactions being faulty. These are called Application Programming Interface.      \n“When a transaction happens, there is an API that manages it within the banks in Nigeria. If the recipient bank does not have a proper connection to the middleman, then the transaction could hang in the air or you end up not getting an acknowledgement on whether the transaction went through or not. It all depends on how the banks interface with these bodies.\n“Another problem could also be with the bank’s server. In this case, the only transfer that will be mediated is within the bank but it will fail if it’s going to another bank.\n“Maintenance of digital infrastructures could also be another problem. If the infrastructure setup or API is poor, other banks will not be able to connect with them, which will lead to challenges for customers.”\nA Fintech expert, Ayo Festus, in a chat with our correspondent, said banks in the country needed to adopt a broader digital framework.\nHe said, “First of all, the banking industry needs to adopt the framework of the digital economy to enable them to give their customer pool a seamless service. We need to invest more in our digital local content. The majority of these banks lack compliance from Customer Manage Relationships to Enterprise Resource Planning.\n“All these need to be looked into in other to allow the technology driving the banking industry to succeed. For example, NIBSS which provides the infrastructure for automated processing, settlement of payments, and fund transfer instructions gets overwhelmed because of traffic from client servers, so we need more platforms to act as backbones.”\nHowever, a senior banker in a new-generation bank, Jonathan Osagie, explained to our correspondent that the government should be blamed for the limited digital infrastructures that many banks are compelled to work with.      \nHe said, “All the banks in the country are under the CBN and as commercial banks, we have to adhere to rules and regulations to avoid being penalised. So, if there are failed transactions and poor services, the first blame should go to the government.\n“There are some facilities and machines that need to be replaced in Nigerian banks but when the government fails to provide them or when you submit your proposal requesting for these facilities for efficient services and the government doesn’t supply all you need, there is nothing you can do than to manage what is available.\n“What happens in the banks is that limited resources and infrastructures are managed. The banks have experts who handle their different sectors and when there are not sufficient tools to work with to keep the portals up and running, the effects are far-reaching.\n“Most of the time, in the morning when you come to work, the portal is good, that’s between 6 am and 8am, but when you start approaching noon, the portal shuts down, and there is nothing you can do except to wait for the portal to come up again. Then when you have hundreds of people trying to access one portal to transact at the same time, there will be problems.”\nOsagie added that the government should create an easily accessible and strong digital portal that hundreds of people can utilise for their transactions.\n“If the portal is down, the best you can do is to manage the customer. It is not our fault, it is the best we can do,” he added",
    "Okada riders defy Sanwo-Olu, return to prohibited routes": "Despite the total ban on the operations of commercial motorcycles on some major roads in Lagos State, some operators are devising ways of returning to the roads, Ajibade Omape writes\nOut of the blue, motorcycles became a mode of transportation in Lagos State. The activities of commercial motorcyclists started from the suburbs and gradually extended to major roads. Motorcycles became a choice mode of transportation for all categories of people, especially when they needed to beat the gridlock that characterised the major roads. From the mainland to the island, they became one of the features of a mega city.\nLargely unregulated, the mode of transportation gradually acquired a life of its own, attracting all manner of ills to the city. In its trails were many residents who lost their lives in accidents that characterised the deadly activities of motorcyclists who operate on major roads side-by-side heavy-duty vehicles and cars. Some who managed to escape were left with broken arms and legs among others.\nBesides this, the motorcycles also became ready tools in the hands of criminals who needed to operate and flee the scenes without being held down by traffic jams. They compounded the city’s security situation. \nIrked by these and more, the state government decided to wield the big stick.\nThe ban\nIn May 2022, the state governor, Babajide Sanwo-Olu, banned the operation of commercial motorcycles on highways in six local government areas and local council development areas. The governor announced that the ban is “indefinite and total.”      \nThe six local governments listed by the governor were Ikeja, Surulere, Eti-Osa, Lagos Mainland, Lagos Island, and Apapa. The ban followed the February 2020 restriction placed on the activities of commercial motorcycles.\nSanwo-Olu said the government decided in line with the State’s Transport Sector Reform Law of 2018 to immediately address the chaos and menace created by the operations of Okada in the listed areas. He told the police to enforce the order without compromise.\nIn August 2022, the governor extended the ban to four more local government areas and five local council development areas. The additional councils where the total Okada ban was pronounced included Kosofe Local Government, Oshodi-Isolo Local Government, Shomolu Local Government, and Mushin Local Government. Others were Ikosi-Isherri LCDA, Agboyi-Ketu LCDA, Isolo LCDA, Bariga LCDA, and Odi-Olowo LCDA.\nWith the ban, security agents went after defaulting motorcyclists, arresting them and impounding their motorbikes, most of which were later crushed. Sanity suddenly returned to the roads.\nGradual return\nOne year down the line, however, it appears some motorcyclists are already making a return to the roads, daring the government and security agents.\nThis reporter visited some of the affected local governments and noticed the gradual return of the motorcyclists, although they still operate with fear of being apprehended. It was also observed that in some of the places visited, security agents in mufti were the ones operating the commercial motorcycles with the confidence that the principle of esprit de corps would not allow their colleagues in uniform to arrest them. It was however noticed that compliance was still very high in some other areas.        \nThe areas visited included Ikeja, Surulere, Oshodi, Mushin, Eti-Osa and Lagos Island.\nAt the popular Computer Village area in Ikeja, commercial motorcyclists were seen operating unhindered when this reporter visited. Their huge presence was noticed around the new bridge in the area. They were seen conveying passengers from one end of the new bridge to the other and other locations close to the Computer Village.\nNone of them were willing to speak with our correspondent out of fear that he might be an undercover security operative.\nOn the popular Oba Akran Road in Ikeja, however, our correspondent noticed that no commercial motorcycles were operating on that axis. Although, he saw a few motorcyclists who sped past without stopping to pick up passengers.\n“Bikes are very scarce in this area. Many of them won’t even stop to pick up passengers. Anytime they stop, they will charge you exorbitant fare and you will have no choice but to take a bus instead,” a resident simply identified as Adebimpe told our reporter.\nFear of policemen\nDuring a visit to the Ajah area, our correspondent noticed commercial motorcyclists operating around the Ajah and Addo areas of Eti-Osa Local Government. They were however in constant fear of policemen and task force officials.      \n“We work with fear; policemen are always impounding commercial motorcycles. Even when you decide to give them money, they will still impound the bikes and threaten you with arrests.\n“Since the government said we should not work, we don’t make money like before and the union leaders still ask us to pay fines for working,” a commercial motorcyclist, Ajayi, managed to tell our reporter before he zoomed off.  Related News   Jandor kicks as tribunal dismisses PDP, LP petitions against Sanwo-Olu  Sanwo-Olu pledges support for judiciary  Tribunal dismisses PDP, LP's petition against APC, Sanwo-Olu   \nAnother motorcyclist, Adamu, who had just dropped off a passenger, indicated his interest in speaking with our correspondent after listening to Ajayi speak.\nHe said, “It’s not easy but we try to escape the police every time. I have a wife and two children, and I am the only one who provides for the family, the police will not let us work in peace.\n“I know that the government says we should not work, but we have families that need food. The police and the government should please consider us because we need the money to feed our family. I will stop this okada work if I secure another work.”\nSurulere\nIn the Surulere area, our correspondent noticed a few commercial motorcycles moving within the streets with passengers. No commercial motorcycle was seen on the major roads.  \n“The bikes rarely work; they are mostly inside communities like Marsha-Kilo, and Aguda. When any commercial motorcycle got caught by the police, their motorcycles got seized.\n“These motorcyclists usually collect money before any trip so even if they get caught halfway, they would have been paid the fare,” Peter, a resident of Aguda, who spoke told our correspondent.\nCompliance in Mushin\nWhen our correspondent visited the Mushin area, only a few motorcycles that were seen were not conveying passengers.\n“Commercial motorcyclists have not been working since the ban. Sometimes, you see them pass and you try to stop them, but they refuse to stop for fear of police and Lagos task force officials,” a resident who identified himself as Olajide said.\nNight operations\nOur correspondent learnt that commercial motorcyclists operate in the night on the island.      \n“Since the ban on okada, it’s been difficult to go to places within the area; it is not every time you want to take a bus. Some riders usually wait till it’s dark so they can operate without being arrested but it’s on rare occasions because they have not been working,” a lady who identified herself as Amarachi told this reporter.\nLagos Taskforce\nContacted, the Director of Public Affairs, Lagos State Task Force, Raheem Gbadeyanka, said although his men impound motorcycles every day, there will always be some riders that will want to play smart.\nGbadeyanka said, “We impound bikes almost every day, and it’s not possible to have a crime-free society, so you will still see a pocket of them being smart. You can see that their activities have reduced now. In fact, over 80 commercial motorcycles were impounded around Lekki last week, and another 20 were impounded around the Apogbon side last week as well.\n“To arrest one okada is more difficult than catching an armed robber. They don’t take into consideration the safety of their passengers. We operate in patrol vans and it is not easy to maneuver like commercial motorcycles.\n“We have had a situation where a passenger fell from a bike because the rider wanted to escape. So, we have to be very strategic. We are at Fagba, we are at Mushin, we can’t be everywhere at the same time. Sometimes when you see a truck of goods coming into Lagos from neighbouring parts, they hide these commercial bikes under the goods they bring in and it’s not our duty to stop those vehicles. Please help us relay the message to the public that commercial motorcycles are banned and they should not risk their lives.”\nPolice command        \nWhen contacted, the state Police Public Relations Officer, Benjamin Hundeyin, who said he was in a meeting, referred our correspondent to the Nigerian Police Force Complaint Response Unit.\nAn official of the CRU who identified himself simply as Oluwafemi said, “The state police command is working round the clock to effect the ban on commercial motorcycles.\n“The state commissioner of police has instructed that on no account should any policeman be seen using his motorcycle for commercial purposes.”",
    "MFM honours Ogun anthem composer with concert": "The great pianist and composer, late Dayo Dedeke, has been described as a musicologist whose songs have remained popular and evergreen for decades.\nThe Abeokuta-born music teacher composed the popular song which promoted agriculture, ‘Ise Agbe, ni ise ile wa’ (Farming is our culture) in 1953 to commemorate the inauguration of the Farmers’ Cooperative Society in the defunct Western Region.\nMany of Pa Dedeke’s choral works were published in a volume titled ‘Ma Gbagbe Ile,’ by the Oxford University Press in London in 1963.\nIn 1976, he composed the Ogun State Anthem, ‘Ise Ya’, which has become the celebrated wake-up call to all indigenes of Ogun State. \nDedeke also composed the first indigenous Christmas Carol, Keresimesi, Odun De (Christmas is here), popular Yoruba church hymns as well as numerous popular Yoruba folk songs.\nThe composer who died in 1994 was recently honoured with a posthumous concert at the Mountain of Fire and Miracles Ministry headquarters in Yaba, Lagos State.\nPresent at the event themed ‘Ma Gbagbe Ile,’ where Dedeke’s choral works, music and arts were showcased was the General Overseer of MFM, Dr Daniel Olukoya, and his wife, Shade.      \nSpeaking on behalf of the family, the deceased’s daughter, Mrs Yemi Dedeke-Olanrewaju, described her late father as a music icon who inculcated good norms into children.\nShe said, “I want to appreciate our General Overseer, Dr Olukoya, and his amiable wife. I have always admired them from afar. I had to travel in for this programme because my siblings were not around. I know wherever my father is in the heavenly choir, he would be smiling down at us.\n“I don’t know how to thank you. I appreciate you for remembering my father. He was a selfless person, who went around the whole of Nigeria to teach music, trying to inculcate good norms into our children, unlike the music we have these days where even people singing spiritual songs sing party music and they say they are evangelising. But I heard good music today.\n“Music is an opium whether we want to want to accept this or not and it is a good way of reaching our youths. A lot of people had forgotten about Pa Adedayo Dedeke but I know he is happy where he is.”  Related News   MFM returns relegated football club to ex-owner  MFM General Overseer seeks prayer against famine  MFM probes pastor for operating ‘deliverance’ centre   \nDescribing his last moments, Dedeke-Olanrewaju said the late musicologist had foretold his demise months before it happened.\nShe added, “It would be 30 years next year when he left us. Before Pentecostal singing became popular, about six months before his death, he introduced choral music in Government Houses and he was the first person to conduct 300 choirs in Obisesan Hall.\n“He called my siblings together just before Christmas. I wasn’t there because I had married by then. He told them ‘God told me I should tidy my books.’ Everybody was crying and my brother said, ‘You are always hearing from God, you are going to spoil Christmas for everybody.’        \n“Nobody knew he was passing the message. Five months later, he was gone. That time, if you came to see him and you were going he would just say ‘bye bye’ and that was the way he left. Something tells me that he is with God.”\nIn his speech, Olukoya said the concert was part of the effort of the Mountain Top Conservatory in music to showcase and appreciate the works of music luminaries who have contributed immensely to nation-building.\nHe said, “To the members of the Dedeke family, we are happy to associate with you on this matter and give your father an honour. When I approached them and told them we needed to honour somebody, most of them didn’t know who I was talking about. It was when I sang the first and second songs. They knew the songs but they didn’t know the composer. This was why we held this concert.\n“I am particularly a fan of Pa Dedeke simply because of the simplicity of his compositions; they were without complexities, straightforward and delightful tones both in the sacred and the secular idiom. My wife and I are astute lovers of music who have been patrons to many budding and excellent musicians in this country.\n“We have a vibrant music programme at the Mountain Top Conservatory in music and we have a strong Department of Music in the Mountain Top University. These are the channels we use in promoting the works of these masters in Nigerian music. This particular concert is part of our efforts to appreciate and showcase the works of those musicians who have paid their dues in the music industry and nation-building.”\nIn 2019, the Ogun State House of Assembly passed a resolution to ask Governor Dapo Abiodun to name the Ogun State Museum after Dedeke.\nThe Speaker of the Assembly, Olakunle Oluomo, said one of the cultural monuments in the state should be renamed after the late artiste as a way of appreciating his laudable contributions to the state.      \nOluomo had stated that the gesture would further encourage and promote patriotism and dignity in labour among the people of the state.",
    "I was threatened for not allowing workers misuse UNIOSUN’s resources – Ex-VC": "Former vice-chancellor of the Osun State University, Prof ‘Labo Popoola, talks to BOLA BAMIGBOLA about his disagreement with the leadership UNIOSUN branch of the Non-Academic Staff Union during his tenure and the controversy that ensued \nNot much has been heard from you since you left UNIOSUN as the vice-chancellor. Did you take up another job?\nI have been busy as usual. I was busy before going to UNIOSUN, and for the five years that I was there, I was busy. I completed my five-year tenure on November 4, 2021, and the following day, I was back in my office at the University of Ibadan. So, I resumed in my office at UI on November 5, 2021, and continued what I love doing most – teaching, research, and attending to those I supervised. In any case, I was doing all of that, even when I was the vice-chancellor (of UNIOSUN).\nYou faced opposition from workers at UNIOSUN when you were there as the VC. For example, the then chairman of the Non-Academic Staff Union, Isaiah Fayemi, was reported to have accused you of using your position to deny workers their rights and making sure some of them were sacked unjustly. Is that true? \nI am publishing a book and many of the facts will come out. Which rights is he talking about? Did I owe anyone salaries? I was there for 60 months and I paid (salaries) for 60 months, on the 25th day of every month, and at times, even earlier, depending on the season. Was any worker deprived of their promotion? You didn’t have to come and lobby me before you got promoted. Promotions were carried out as and when due. Did Fayemi miss a promotion despite his hatred of me for reasons best known to him? The records are there. (In terms of) capacity building, what we had during my period was something they never had before. People who deserved training were trained across the board and even outside the country. So, I don’t know what he meant. The guy had his issues with me and I will publish them.\nPeople hide under unionism to commit atrocities. That you are a president of a union doesn’t make you the owner of the union or a lord over members of the union. I know that the majority of the workers at UNIOSUN were happy with me. Many of them still reach out to me with expressions of love, even after 22 months of leaving the university. Having a motley crowd abusing the use of social media does not tell the whole story.\nYou said they were happy but many of them celebrated your exit. What is your reaction to that?       \nHow many? I doubt if they were up to 10. They said they were performing rituals. This is the problem we have with the Nigerian media. What about all the celebrations before my exit? The students organised a symposium in my honour. The management and staff did their own. The governing council did theirs. The students pulled me out gloriously. Because somebody decided to be notorious does not reflect reality. He (ex-NASU chairman) was like a lord before I came to UNIOSUN, but I am happy I demystified him. Those that I came to serve appreciated me and they still appreciate me till tomorrow. So, ask him to define whatever he meant by depriving workers of their rights. I am not a vindictive person.\nPeople were shocked when we were processing the papers of those who were giving us problems, including himself. But I insisted that matters be separated. Yes, I did not allow people to abuse the resources of the university the way they used to. So, if that is what he meant by right, maybe right has a different definition. I did not permit indolence, frivolities, and cheating as the vice-chancellor.  No apologies for that.\nAs a university administrator who didn’t enjoy the support of some of the workers at UNIOSUN, did you face physical hostility or threats to your life?\nDon’t say, workers. I know the number of workers that I inherited and I know the number that I left. We only recruited people that we needed. Also, what do you mean by hostile workers? Workers were not hostile to me. The fact that two or three people got themselves together, made some noise, and went to the press does not mean workers were hostile. I think the media would need to be circumspect on some of these issues.\nIt will be published in my book for you to know it was beyond unionism. I know that I blocked leakages and it is like the then chairman of the (UNIOSUN) Governing Council, Mallam Yusuf Alli would say, “Labo, you are a reformer and you should expect all these attacks. How do you expect those who were benefitting unjustly from a commonwealth to love you now that you have blocked that avenue?”\nWere there threats to your life?\nThere were threats. At a point in time, the Department of State Service had to attach someone to me to follow me about. I later told them that it was not my lifestyle and I wanted to be free. I had a domestic driver by the letter of my appointment. That driver had to plead with my wife and me to allow him to be deployed out of my premises because people were giving him instructions to do something untoward to members of my family. I had to accept his plea to get him posted out of my place. He said he got to my family and found out that all that Fayemi and co were saying about me was not true.        \nYou said in an interview that nice guys don’t run the university system in Nigeria. Don’t you think being nice is an attribute that can endear a leader to their followers in a university and promote harmony between a VC and the different unions? \nNo! When people say to you, “Bobo yen nice,” you know what that means in Yorubaland. It means you are a fool. Those who know me know that I can be so meek. The students ended up loving me so much, even though Fayemi and co almost turned them against me but they failed because the students got to know that I was doing everything in their best interest. How can Fayemi have any good thing to say about me when some collected TEFFund travel grants and did not make the journey even after some two years? Of course, when I could I made sure every kobo was retrieved and we reported the same to TETFund.\nSo, when I say nice, it is not in the sense that people are putting it. Nice in the sense that approving everything that was presented without scrutiny because you want people to hail you is definitely not part of good administration. Feigning ignorance of malfeasances cannot be good for a system either. It is nice in the sense that there is an infraction and you overlook it. That’s what I meant. Otherwise, the workers knew that they had it better because none of their rights and entitlements were denied them.\nWhen we reviewed fees upward, I was the one who took it to the governing council that every member of staff of UNIOSUN whose children were enrolled in the university should have a 50 per cent rebate in fees subject to a maximum of four children. In the first congregation meeting I had, I made a statement and somebody decided to misinterpret it, but he later came to me and said he misunderstood me.\nWhat did you say?\nI said I would step on toes, but it did not mean that toes in the right places would be stepped on. If you go beyond your bounds, you should be ready for the consequences. Could I have denied workers their rights if I put in place a health fund for workers, not workers like me, not professors but ordinary workers? This money was pooled from sources that some people normally benefitted from unjustly. From the money we saved from our first post-Unified Tertiary Matriculation Examination test when I came in, there is a building cropping up around the Odi Olowo area (in Osogbo). We used part of that money to procure the land on which that edifice is.  Related News   Workers allege nepotism as PSC boss constitutes recruitment board  Otti sacks workers employed in last eight months  Ekiti pays N150m gratuities to ex-council workers, teachers   \nWas that idea welcomed by the workers?      \nSome people would not like it because that was the kind of money they normally shared. The building was almost completed before I left. What do they have to show from the revenue they earned from post-UTME tests before we came in? The first examination conducted when I came in cost the university over N15m. I ended up spending less than N5m to conduct the examination, and that was prudently maintained all through my tenure.\nWhere were the differences in the costs going in the past? Private pockets! Records must be put straight, and there are several such tangible outputs of our prudent management of the university’s resources. Facts have stamina. They don’t get tired. This is Nigeria. I don’t want to generalise, but we have mean human beings here. It is so easy to blame governments and politicians but the kind of things that go on in our backyard are unimaginable.\nWhen I came in as the VC, they had already approved money to buy SUVs for the pro-chancellor and vice-chancellor. At that time, they were anticipating the coming of the VC and at my first council meeting, I saw the document and they were saying the value of the naira was depreciating so the price had gone up. So, they were going to buy the SUVs for the pro-chancellor and VC at the cost of N89m and I just scribbled a note to the pro-chancellor saying that it was impossible.\nHow much did it eventually cost the university to buy the SUVs?\nWe ended up buying the vehicles at N65m. I was not the VC when they cooked the scheme, but I busted it. Where was the difference going to go? They had put the cost of the SUV for the vice-chancellor at N55m but I ended up buying it at N39m. For God’s sake, why would anybody want to buy something at N89m when it could be bought with N65m or something at N55m when we could buy it with N39m? Where was the difference going? So, it is natural that some people would not like me, but do I care? I thank God that I had a good council. I didn’t have a council that came to ‘eat’. Of course in Nigeria, people equate an opportunity to serve as an opportunity to ‘eat’. I even learnt that some people were saying that it was good that the noble council was dissolved because they had ‘eaten’ enough. Sad!\nThe then leadership of NASU accused you of financial misappropriation. What is your reaction to that?\nAs VC, I never took any extra kobo beyond my entitlements. I would even return unspent duty tour allowances. We know how some of our colleagues do these things but I never did because my upbringing didn’t allow it.  \nHow much influence did you have in the choice of your successor?\nThere is a general saying that success without a successor cannot be defined as a good success. So, it would be out of place to say that I wasn’t interested in who would succeed me. Who that person was probably would be a matter for conjecture, but we had criteria that were queried and I wouldn’t know why. It is the council that advertises the vacancy for the position of vice-chancellor, not vice-chancellors, but the VC as a member of the council can give an opinion.  I wouldn’t call that influence because it was an open advertisement and you see, we often make some mistakes about some of these issues.\nEvery advertisement is supposed to put some people at a disadvantage. Every advertisement is supposed to eliminate some people, otherwise, someone with a school certificate result, or a diploma will also apply for the position of the vice-chancellor.\nHow did your successor emerge?\nSomebody needs to tell me that the man who eventually emerged did not have all those criteria that were advertised. With those criteria, I learnt that they had interviews with about eight candidates in three areas of competency, and the person that came first did so in all three areas. The CVs were assessed; there was a computer-based test, there was an oral interview and the person who came first led in all. Similarly, the person who came last did so in all the areas. Being a professor does not automatically make you a potential vice-chancellor. It’s like a football league; you have divisions three, two, and one.\nDid he merit the position? I think that is the question we should ask. His person is a different thing entirely. You can never know people 100 per cent. Don’t forget he worked with me and a good administrator will know the capacity of people who work with him or her but to say that I influenced it, I couldn’t have.\nDid he not face any opposition?      \nThere were other issues that could have dropped him. There were petitions against him. It has happened before in the Nigerian university system when someone came first and did not have the approval of the Visitor to the university because of petitions that turned out to be spurious. In his case, the pro-chancellor played his role properly by encouraging the then-visitor, Governor Adegboyega Oyetola, to approve the selection process as properly conducted. The rest as they say is history.\nThe important thing is that the man satisfied all the known and seen conditions. Other things like personality, character, and approach to issues are different things entirely. There is no way you will know that until the person gets on with the job. In any case, I have never seen a perfect person. I am not one. But in terms of the basics of the job, he was the best.\nYou were known as a vice-chancellor who did not consider strikes as an option to address industrial disputes. What other measures do you think could be used instead? \nI do not know of a VC that would encourage strikes. I have moved around the world, and not in the last two decades have I seen a country where people would go on strike for 10 months and almost indefinitely and yet feel comfortable doing so. Some people have analysed the number of months that universities have been on strike in the last 20 years. It is worrisome. This is not happening again elsewhere. Weaponising strike is not in vogue. It is outdated. This is what our colleagues don’t want to hear. Of course, I have had issues with them but I don’t bother. I have to speak my mind. We are ruining lives first and foremost. They may think they are fighting the government but they are ruining lives.\nIn a programme of four years, a student spends seven or eight years not because they failed. I guess that is why the labour law was applied, and the court upheld it. I was already back in UI when the last strike started. I didn’t believe in the strike and I couldn’t have joined the strike but like the Yoruba will say, “Won ko eran mo ero,” (animals were packed with human beings). So, I was an unwilling victim but I am happy that the court has settled the matter.",
    "How drunk driver crushed my adopted daughter to death – Niger evangelist": "An evangelist, Danladi Galadima, tells CHIKA OTUCHIKERE how his 23-year-old ward, Priscilla Daniel, was killed in the Shiroro area of Minna, Niger State, on August 30, 2023\nWhat is your relationship with the deceased?\nMy name is Evangelist Danladi Galadima. I am from Tafa in Niger State and I have been in Tafa for over 30 years. I am the coordinator of Freedom Deliverance International Ministry. In the organisation, we take care of orphans, the underprivileged and some who are into cultism or witchcraft. After deliverance, we rehabilitate them and we take them back to their parents or wards. Sometimes, the parents tell us to take care of their children for them, so we take care of them and enrol them in school.\nSo, about four years ago, we organised a programme, a crusade in the Tafawa Balewa Local Government Area of Bauchi State. I have a friend who is a pharmacist there. At the crusade, I met the girl, Priscilla, who was said to have lost her father and mother and she looked dejected, unkempt and helpless. The person she was living with had her children so, I told them that if she had become a liability they could allow me to take her and help her. \nThey agreed. I brought her to Niger State, enrolled her at Gbamgbabi Primary School and also paid for her to learn sewing. She had some spiritual problems too. I delivered her. She said I should change her surname so she could bear my name, but I told her I would not do that. Eventually, last year, we went for a holiday in Bauchi, and I carried her along so that her people could see her. They were very happy that she had changed, was robust and had grown up. I told her to stay back with her people but she said she would like to return to Niger State with us.\nCan you explain what happened to her?\nOn the fateful Wednesday, August 30, 2023, she came to our place. Sometimes, she slept at home and sometimes she slept in the church because we have accommodation there. After having her breakfast, I told her to go to the place where she was learning how to sew. Just 20 minutes after she left, I got a call and when I picked it up, the caller told me to go to the highway. I went to the place and I couldn’t see anyone I knew. I saw a lot of people and I asked some people what happened. I saw a police officer in charge of traffic control and he told me to follow him to the general hospital in the area.      \nWhat happened when you got there?\nWe saw her there. She was already dead. When I asked what happened, the traffic officer explained to me.\nWhat did he tell you?\nHe said Pricilia had already crossed the first road near a power station, and that she was just waiting to cross to the other side of the dual-lane road when a vehicle knocked her down and an incoming truck smashed her head while trying to carry out a manoeuvre at the roundabout. That was how she died on the spot. That was how people told me the incident happened because I was not at the scene when it happened.  Related News   Three escape death as container falls, crushes car in Lagos  What killed our colleague, Michael Umoh – LUTH-ARD  How sliding gate crushed my three-year-old daughter to death – Mother   \nWhat happened to the driver who knocked her down?\nLater, the police said the driver confessed that he was drunk.\nWhat did the police do afterwards?        \nThey took the two drivers to Tundu Wada Police Station where the officers were investigating the matter. You can’t say the trailer was speeding because it was negotiating the roundabouts.\nDid you inform her relatives?\nI was communicating with her relatives in Bauchi because one of them is a divisional police officer and another is an army officer. I could not do anything about the corpse because the girl’s body was in bad condition and because of the bad economy, I felt it was better for her to be buried in Niger State. So, we went and paid some money at the mortuary and on Friday,  September 8, she was buried.\nDid anyone advise you to seek legal redress over her killing?\nThe issue is that if they are asking me to go to court, which one would I face? Going to court or carrying out evangelism? I lost a relative and it has taken a lot of my time and money. Knowing the Nigerian situation, if you are fortunate, you may get justice, and if not, you may not get justice. Where she has gone, I just pray that she has seen Christ because nobody has been there and returned. If the police want to do anything, I don’t think that I can advise them. They are the law enforcement agency.\nWhat is the latest the police have told you about the case?\nThe police asked me whether I wanted to go to court, but I told them to give me the corpse so I could go and bury her. Death is a necessary end which will come when it will come. This is what God has hidden from us, we don’t know the secret. Everybody is going to die. God has already done it so. It is true that there was carelessness in the accident, but if she was destined to die that day, she may have died at home and we would have opened the door and seen her corpse. So, I don’t have much to say as long as they have given me the corpse and I’ve buried it. I thank God she was rehabilitated; we want to trust God that she’s with Him. It is not how long you lived but how well you lived. I don’t have time to pursue the case in court or even the money. So,  I leave it to God.      \nMy concern was for them to give me the corpse which I have buried. I don’t have the time to go to court. As an evangelist, before the year runs out, I would have covered not less than 80 communities. How will I have the time to do that and still go to court? The police can follow up the case to its logical conclusion.",
    "Fake drug traders deserve life imprisonment – Registrar, Pharmacy Council": "The Registrar, Pharmacy Council of Nigeria, Babashehu Ahmed, speaks with LARA ADEJORO on efforts to curb the illegal sale of medicines, brain drain in the pharmaceutical sector among other issues\nMedicines are part of many people’s everyday life, how easy or difficult has it been regulating that sector?\nRegulating the pharmaceutical sector is a big responsibility, from the highest to the lowest level; including the manufacturers, importers, distributors, wholesalers, retailers, hospitals, pharmacies and the vendors. I said so because each of the departments that undertake these various responsibilities, based on the licence issued by the Pharmacy Council of Nigeria, have the responsibility of ensuring that standards are met, inspections are appropriately conducted and the facilities meet minimum standards. Also, we ensure that at the lowest level where people access these medicines, through retail facilities or the patent and proprietary medicine vendors, which are supposed to sell only over-the-counter medicines, they stock drugs that are registered by the National Agency for Food and Drug Administration and Control.\nWe also ensure that the conditions in which these medicines are kept or stored are appropriate; that there are appropriate personnel to attend to clients or customers, as the case may be, and to ensure that they give out appropriate information. Some drugs require special storage conditions, like control medicines, which of course people abuse these days, meaning that when you must dispense them, it must be based on a prescription and you must also record it appropriately in accordance with the Poison and Pharmacy Act. This is an overview of our responsibilities in ensuring that drugs are available to the citizens and the drugs are of high quality, safe and obtained from facilities that are registered by the PCN. We have a lot of illegal facilities that are out there, and it is based on this that we go out for enforcement. \nWhat are the short- and long-term implications of the proliferation of such stores?\nThe short-term implication is very clear because we are already seeing its effect. The proliferation of unregistered premises creates an opportunity for people to access medicines that ordinarily should not be accessed. I just spoke about the issue of controlled medicines. The issue of insecurity that we are seeing today, of course, is associated with access to these kinds of medicines, because these are medicines that promote crime. By the time people take them, they hallucinate. They use them as confidence-boosters and begin to do things their normal senses wouldn’t have been able to do. They feel on top of the world and do all kinds of dirty things.\nWhat about the long-term effect of it?      \nThe long-term effect of it, which we are working hard to avoid, is that you have a situation where population is increasing, settlements are increasing and these people will begin to have their way into the hinterland. We no longer have a situation where we can say with the highest level of confidence that the medicines we are buying are genuine, and what that means is that people lose confidence in the health sector because drugs are the cornerstone items that you get out of the health system; after everything, they end up with medicine. When the health of the citizens is not appropriately taken care of, it affects everything, including the wealth and the economy of the nation. Essentially, the long-term impact is that people will access medicines that will not only fail in delivering the expected outcome, but could also cause some injuries such as organ failure, which becomes a problem for the society. Morbidity also becomes very high leading to a tremendous increase in mortality.\nMany Nigerians are not aware of the products that require prescription, and the practice has continued because some of the stores are manned by unlicensed persons, what is the PCN doing to educate the public on this?\nOn the issue of prescription, we are working with the Federal Ministry of Health so that we can have a prescription policy that is approved by the ministry, and which will specify the roles and responsibilities of different cadres within the health care team. Once that is achieved, I can assure you that nobody will prescribe medicines except the person that has been authorised. Nobody will dispense medicine or be involved in the sale, disposition, or disposal of medicine, except the person that is licensed to. I know the work started some time back, and I’m sure it will be concluded, such that when you walk into a facility or a pharmacy to buy medicines without a prescription, they will tell you categorically that the policy is that you must come with a prescription and there is no other place you can go to, including hospitals. I know with that delineation of roles and responsibilities, it will really bring to the fore what medicines we can access without prescription and those we can access only when they are prescribed.\nSome years ago, the PCN lamented the scarcity of pharmacists in the health sector, does Nigeria have a sufficient number now, and what is the implication of this shortage for the health sector?\nCertainly, we don’t have the numbers. As I’m talking to you now, the number on the register is about 33,000. When I say the number on the register, I’m talking about the number that is actually on the register from the creation of the council, which was 1936. From this number, we have a register that is called the register of deceased pharmacists, because you cannot reallocate their numbers; people who are also in other sectors of the economy, like those who are in banking, telecommunications, non-governmental organisations and even those who are outside the country but are pharmacists. But when you talk about those who are actively available to practice pharmacy now, there are about 19,000. I mean those who have been licensed to practice. So, you can see that there is a serious shortage. The World Health Organisation’s requirement is that for a population of 2,000, you should have one pharmacist. Now, what is the population of Nigeria? Over 200 million people. So, how do you want to put the ratio of that to 19,000?\nThe implication is exactly what we are seeing, whereby some of those available are not working in systems or structures where medicines are directly offered to the public. Some of us are working in the regulatory set-up, some are in the administrative set-up like the ministries, some are in the NGOs. What that means is that you now have other people who are not pharmacists coming to occupy positions pharmacists are supposed to be primarily, and that is establishing facilities for people to access medicine from, but even as establishing manufacturing facilities, importations and what have you. So we have other people, especially at the retail end, you have people doing all sorts of things, establishing premises that are illegal or unregistered.\nHow worried are you about the brain drain challenge?        \nI am very worried. I can tell you that the brain drain is of serious concern to us, because if I’m to give you the statistics in terms of brain drain, you will be concerned too. From January to July this year, 270 pharmacists left the country. Last year, we had 472 who left the country. In 2021, 783 left the country. In 2020, maybe because of Covid-19, only 300 left. In 2019, 550 left. In 2018, 480 left. So, by the time we deduct this from the number of registered pharmacists, from the 19,000, almost 3,000 are out. That is a big problem.\nBut what is the council doing about it?\nThe issue of brain drain is an issue that affects virtually every profession, especially within the health sector, maybe because of what they see as greener pastures out there. So, the best we can do is to continue to improve our environment, provide an enabling environment, and this we can only do through sanitising the space through enforcement, largely, so that the environment, as it were, can be good enough for people to remain so they can also take advantage of available opportunities.\nFor many drug manufacturers, it was learnt that it is cheaper for them to import than manufacture locally because of the harsh business environment, is the government aware of this situation?\nYes, the government is aware and a lot of things are happening to change that. The Federal Government is partnering with M&B to promote vaccine production locally. Also, on the project called IMPACT, they are working with the Federal Ministry of Health to strengthen five local manufacturers to make them have the WHO qualification. When that happens, it means you will have people from outside the country or WHO partners and UN agencies coming here to buy drugs. However, one of the critical things affecting local manufacturers here is what is affecting the industrial sector generally – the issues of power and infrastructure. In addition to that, in the pharmaceutical industry, we also have the problem of access to funds and the fact that we don’t have an industry that specialises in the production of active pharmaceutical ingredients. So, I’m sure the ministry is currently working with the pharmaceutical manufacturers group in the Manufacturers Association of Nigeria to see how that can be improved upon. Of course, access to forex is also key for manufacturers to be able to survive. So, we will appreciate it if that can be made easy for them so that they can be able to access it easily, and at low rates, because if they get it at a high rate it is going to affect the input, and the price of the goods at the end of the day. So, we want easy access to forex for the manufacturers. It will go a long way to reduce their challenges.\nThe vision of the PCN, according to your website, is to create an enabling and regulated environment for the provision of quality pharmaceutical services for sustainable healthcare delivery. In what ways can pharmaceutical companies be supported for them to be more efficient?\nOne way we can support them is through regulatory mechanisms, one of which is undertaking routine inspections, monitoring inspections and capacity building. Recently, we sent out notices for capacity building for pharmaceutical sales representatives and medical sales representatives, and we are doing this in conjunction with the Nigerian Association of Industrial Pharmacists. Apart from that, other ways we can support them is by sanitising the pharmaceutical industry, because even if you are in the process of production, and somebody is faking your medicine, that fake product can compete with the genuine one because the cost will be low and people will patronise the fake one than the genuine one. So, we will continue to talk about enforcement to provide an enabling environment just as you have seen in our mission statement.      \nA law was passed in 2022 to check quackery, to what extent has the law helped to check the menace because it is a problem till date?  Related News   Vulcaniser bags life imprisonment for defiling 15-year-old girl  59-year-old man gets life imprisonment for raping two daughters  Businessman bags life imprisonment for defiling three underage daughters   \nWe must give credit to the National Assembly for the law passed in 2022. We must also give credit to the last administration led by President Muhammadu Buhari, who signed that bill into law on August 16, 2022. Also, we must give credit to all the leaders within the pharmacy sector; who stood firmly and many organisations like the Nigerian Law Reform Commission and the National Drug Law Enforcement Agency, NAFDAC, who all came together to support the passage of this law. With the Act, we are now known as the Pharmacy Council of Nigeria and no longer the Pharmacists Council of Nigeria, where people used to think that the council was for Pharmacists. Now, it is a council that regulates the pharmaceutical sector. It has brought on board the Director-General of NAFDAC as a member, and that has strengthened the collaboration between the two agencies. The PCN is also represented on the board or council of NAFDAC. Also, with the passage of that law, there is a regulation of the online sale of drugs because that has been existing without any regulation. So, the law brings all the stakeholders on board, including those who operate in the open drug market like Onitsha overhead bridge, Kano Sabon-Gari market and Idumota in Lagos. Everybody has now been brought under the regulatory body, and with that I can assure you that gradually, the law will catch up with everybody and the entire sector will be effectively sanitised and you can be sure that quackery will be taken off.\nNDLEA has consistently lamented the extent of drug abuse in the country. What is the PCN doing about this challenge?\nWe cannot stop talking about enforcement. Now, when you talk about drug abuse, what are the sources of the drugs? Where are they coming from? In fact, specifically, they mostly come from unregistered facilities. One of the most contributing centres is the open drug market. That is why we are making every effort and reinforcing our commitment to ensure that we get the national drug distribution guideline fully implemented, wherein these markets and all unregistered facilities would be closed down.\nIt seems the unregistered stores keep springing up across the country, does that bother you?\nWe are also getting more committed, and I can assure you that we will win this.\nTo laymen, Nigeria has a lot of natural herbs that can be developed and converted into safe medicines, why has this not been sufficiently explored for the benefit of the citizenry?  \nYou are right, and I can say that it has not been explored. I think it is because people are not aware of what the government is doing. That was what necessitated the establishment of the Traditional Complementary and Alternative Medicine department in the ministry. I can also tell you that the National Institute for Research and Development has been working with the Nigerian Association of Pharmacists and the academia to explore a lot of herbs and to see those that have medicinal value so that they can bring them to the fore. So, a lot of work is ongoing. There is this component of pharmacy training that is called pharmacology. It is a field of pharmacy training, which of course, focuses on what is called phytomedicines; medicines sourced from plants. So, it is a full-fledged field in pharmacy, right from undergraduate. You can also specialise in it at the postgraduate level and even become a professor in it. So, one of the checklists that we look out for when we go for accreditation is to ensure that each faculty of pharmacy has a herbarium and a farm where students are taken to learn basic plants that have some medicinal value in our environment. I can tell you that we already have some schools who through this process have even produced some medicines from these plants and are ready for use.\nIf they are ready, what’s stopping the use of those medicines?\nWell, the issue is to be able to do it in commercial quantity, and you know it goes through processes. It has to go through the validation of NAFDAC. It has to go through clinical trials. We have some that NAFDAC has already listed and I’m sure that in no distant time, we will have many more, because there are many more on the line that are being explored. We will get to the level of listing and registration and become available on the shelf for use.\nFrom your activities, would you say the proliferation of illegal and unlicensed stores in any way aids the distribution of illicit drugs and substances?\nYou have just said it rightly. The answer is yes. Registration essentially means that a facility has been certified to have what it takes to offer quality effective service delivery. So, once there is no registration, anything goes in there, and why is there no registration? It is because the person wants to evade the process of policing. That is essentially why they exist. And of course, one of the top things they look out for in terms of attempts to evade policing is economic empowerment, I mean, using those facilities to sell medicines, especially the drugs they abuse, which have become commonplace these days.\nThere have also been incidences of fake and expired drugs, who is to blame for the importation of such drugs into Nigeria?\nI think the issue of products squarely lies with NAFDAC and I do know that NAFDAC has introduced what we call track and trace, and they are working with PCN now. NAFDAC is also in the process of activating the task force which has gone moribund for some time, to improve the oversight in this particular area of fake and counterfeiting, because you know the task force comes under the law of fake and counterfeit medicines and unwholesome processed food. So, it is entirely a task that deals directly with the issue of fake and counterfeit, and by the time it is activated and energised, we can be sure that they would be able to do a lot.      \nWhat do you make of suggestions that sellers of fake and expired drugs deserve the death penalty or stiffer penalties because their activities could lead to death or cause serious damage to people?\nCertainly, I recommend stiffer penalties. Before now, the sanctions were very watery, but now they have been strengthened. But even in a court of law, if it is possible, for somebody who is found trading in fake and counterfeit drugs, we will want the person to face stiffer penalties like life imprisonment.\nAt the moment, how many pharmacies and patent medicine stores are licensed in Nigeria?\nAs of last year, we licensed 18,431 pharmacists. It is an annual activity. So, for this year, I can say it is still ongoing, but as of today, we have crossed 11,000 licenses so far.\nWhat is the latest on the open drugs market relocation in Kano, which the PCN is insisting must be relocated to the Coordinated Wholesale Centre?\nThe so-called stakeholders took us to court after the commissioning, with the hope of trying to withdraw that particular process. They were waiting for the court to enforce their ‘fundamental human right’ they should not be moved out of the market. But good enough, the court has said fundamental human right does not apply to individuals who want to stay in the markets to sell medicines. The project was commissioned on February 10, but because elections were around the corner, we decided to wait for the elections to take place for the swearing-in to be done. By May 29, everything about the election was over, and swearing-in was conducted. They quickly rushed to court to stop us from the enforcement, and by June 30, the court made a pronouncement and threw away their case. In August, they went to court again to institute another case. The court has fixed October for the ruling. Let’s wait for that ruling, and then we will take it from there.\nSince the PCN does not have armed personnel to enforce its rules and guidelines, to what extent has this hampered your operations?        \nYou know we work effectively with the office of the IG as well as the Director-General of the NSCDC, so any time we need security cover for our operations, they are always ready to make men available for us, so we don’t have problem with security cover for our operations.",
    "Acapella set for Canada tour": "A comedian, Benneth Daniel, aka Acapella, is set for a Canadian comedy tour tagged, More Than a Legend 2023 Tour. Speaking on what the show has to offer, Acapella told Sunday Scoop, “Let me start by recognising the grace of God on my life and career. 2023 has been great year, with several highlights; one of which is about to be witnessed in Canada. “Although I have always been connected with my fans across the globe, this particular tour means a lot to me. It’s not because it is holding in Canada or because of some of the other heavyweights on the tour, but because I consider it special anytime I have the opportunity of connecting with my fans in person. Trust me, I do not take such moments for granted.” The tour, which is powered by Prince George Entertainment, will feature other entertainers such as I Go Dye, Oritsefemi and MC Morris.",
    "Learn from Mohbad, sign proper contracts, lawyer tells artistes": "The controversial death of singer, Ilerioluwa Aloba, aka Mohbad, has continued to dominate public discourse. Among the topics that generated several reactions were the questions on who will get the royalties on his songs. In an interview with Sunday Scoop, a legal practitioner, Idris Balogun, stated that the beneficiaries of those royalties were dependent on the kind of contract signed by the deceased. Balogun said, “Who will get the money that Mohbad’s music is still making depends on the contract signed between the artiste and the record label. It also depends on the dictates/wishes of the late artiste.” Speaking on the exploitation of artistes by record labels, the lawyer said, “Exploitation is a general pandemic, and it cuts across all sectors. “For record labels, the only way this can be resolved is if a contract is duly executed by the artiste and the owner of the record label. Artistes should always get lawyers to prepare contracts for them, and advise them.” On the guidelines surrounding the late singer’s property, Balogun said, “The wife can be protected is if she is named as a beneficiary in the will (if there is one). But if there is none, she is automatically a beneficiary by virtue of the marriage (Sunday Scoop cannot independently confirmed that they were married) between her and Mohbad. “More so, if the property is in her name (or if it’s brought in her name and that of Mohbad), it belongs to her, and no one can lay claim to it.”",
    "Why I can trust my brand with Emperor Geezy – Kizz Daniel": "A popular singer, Oluwatobiloba Anidugbe, aka Kizz Daniel, has said that he can trust his brand with his former record label, G-Worldwide’s CEO, Festus Ehimare aka Emperor Geezy, whom he recently appointed as the CEO of his label, Fly Boi Inc. Speaking during an interview with a media personality, Adesope Olajide, Daniel said, “He is one of the people that I can trust the Kizz Daniel brand with. When we were fighting, he still used to text me to caution me whenever I did something he felt was wrong. He is a good guy, and he loves the Kizz Daniel brand. “ Speaking on how his family has always encouraged him to invest his earnings well, the ‘Buga’ singer said, “When I released my first song, my dad and I thought it might be my only hit song, so he encouraged me to invest. As a matter of fact, when I lost my dad in 2015, my uncle started showing concern. It seemed they had already spoken about it. He was constantly on my case, and always asked me what I was investing in.” Advising younger artistes, Daniel said, “Though priority differs, younger artistes should learn to invest their energy in anything they feel would matter to them in the long run.”",
    "Not administering vaccine worsening diphtheria among children –UNICEF rep": "United Nations Children’s Fund Representative in Nigeria, Ms. Cristian Munduate, in this interview with GRACE EDEMA appeals to the Federal Government to prioritise children\nUNICEF was the first foundation to inform the world that Nigeria has possibly the highest out-of-school children globally. Do you think we have made an effort to reduce the number?\nThere has been some efforts but it is not enough. I think there should be an acceleration of how to have the capacity in the country to provide education and access to school for all children. Right now, we are talking about ten million children or a bit more if you add up from primary school and secondary school children. There should be very intentional decisions and measures to bring down the numbers because every year around eight million children are born in the country and community. This needs to stop. But honestly, I think that as a country and society, we can make a social agreement where of course the government at Federal and State levels can agree that each year these are the X number of children that will be brought to school. I think with that certainty and clarity, you can move ahead. It is not just enough to raise the numbers and to highlight the problem, what is needed is to solve the problem.\nCan you give a step-by-step action plan that the government must embark on to solve the problem of out-of-school children, especially now that we have a new government? \nI think that one of the opportunities in Nigeria is that it is a centralised country, meaning you have the government on the Federal level, and on the State level you have the state governors. Nigeria is a big country. This is one of the countries with the largest population in the world. At times, a state can be equal to another country in the entire part of the continent or the world. So, it is not a small issue. I think that in terms of what to do technically the answers are there; UNICEF has developed and approved different ways that can help bring children back to school. This is what we are already working on with the education authorities on how to take this upscale. One of the things that must be done at the state level is more budget for education; more equipment for education should be discussed. When you go to schools, you see the schools just breaking apart. So, we must make sure that whoever decides at that level, at the local government level makes decisions that will benefit children and all. Education is important for the country. It ought to be seen as an urgent matter. It is not something that can just be left aside. We need to understand that if we are talking seriously about setting the basis for development, education has to be at the same level for example as the economic agenda of the country or the security agenda of the country.\nThere is this opinion of encouraging students to take up vocational and technical skills. What do you have to say about it?\nI think it is important to create skills in a competitive world. We cannot continue thinking of giving skills, like poor skills to poor people. This shouldn’t be the goal. We are talking about a world where we need more technological skills, where you need to compete with markets, in a country where part of the economic discussion is on how to increase industry, agro industry, etc. For that to be a reality you need young people to be prepared for this. We are setting programmes to become a tailor or a carpenter which is good because these types of jobs are needed in communities. You also need to see how you can massively prepare this young generation to go to these other jobs that will be inclined. I truly believe that this can be taken from the most left behind. You know children going back to be out of school, adolescents and young people that never went to school, basically are illiterate. Will you teach them extensive data? No. You can give skills for them to make a living but how many tailors does the country need? Will you have everybody being a tailor in a community, is that what is needed? This is what I am saying and that is why I am placing education and skills development by preparing for jobs at the same level of the economic agenda. There should be a very intentional employment policy in the country. So, you can plan what you need, and you can develop what you need but you cannot say okay we will develop in this area; we need the workforce for it. This is where things have to come together.      \nWhat are those issues about children’s health that you think are critical?\nFirst, I would like to say that we will congratulate this government on priority on food security and nutrition. The fact that we have too many children suffering from severe malnutrition is a concern. We are talking about more or less two million children. Malnutrition happens in the early months of life- the first thousand days.   This is the precise time when the brain is being developed, and this touches the brain and impairs you for life. That is why it is critical in terms of health; there should be a stronger plan for primary health care attention in all the parts and corners of the country and to do preventive health. You don’t need to wait until the child is about to die to provide health. You need to prevent, and preventing is to provide all the vaccines that are needed. It provides all the information that women should have in breastfeeding their children because some beliefs work against the health of children, and also food security. I think you would have covered the news on outbreaks of diphtheria. If you have noticed, the outbreaks are not in babies, they are in children from seven or eight plus years. Do you know why this is happening to these children? It is because they did not get the vaccine when they were supposed to get the vaccines. The point is that in terms of health, there should be a major effort to reach as many children as possible through prevention and primary healthcare attention. Corrective health is important but the majority of adults and children who get sick can be prevented. You don’t need to go to the hospitals and have medical intervention if you do diligence in health prevention.  Related News   Diphtheria: UNICEF advocates widespread vaccination  Only 7% Nigerian youths have ICT skills, says UNICEF  UNICEF equips 30 Kano schools with solar power   \nWhat is your general advice for the Nigerian government knowing we got new ministers two weeks ago?\nMy plea is for them to prioritise children. I know they will have to make hard and very difficult decisions and priorities. Some of the priorities that will be set by the federal government through the president are in the right direction. We ask that children should be prioritised.\nThe birth certificate is an issue you have an interest in, what about it?\nThe challenge is that there are millions, like 20 million plus children who do not have a birth certificate, meaning that they do not have a legal name in the country. Why birth certification is important is because talking about health and education, having birth certification can help provide necessary access to schools and health. That is why we are trying to see how this can become a priority so that this problem can be completely solved in two years. This is a quick win.\nIs there any part of the country you noticed this more?        \nEverywhere. For these places, I can give you the breakdown by state for what we have done. For example, this year, it is the government that needs to lead. UNICEF doesn’t sub-change the government; we contribute to the government efforts and other sectors’ efforts. This year we want to see how we can see at least eight million children registered within the country. Right now, in some states, some LGAs already have registration stands in health facilities. It is run electronically. The birth certificate is given to the mother. This can help with follow-up, help the child get his immunisation, and help the child with how he goes to school.  It is important to have them with this identification. It is not good that you get your identification card once you reach 18 years, then you become a citizen of the country. Children are also part of the country and the society. So, they should have their legal identification and identity.\nDo you have challenges getting data in Nigeria?\nYes. For that, it was unfortunate that the censors never became realistic because the country has been living on projections for the past years like 20 years or so. No developed nation plans in assumptions. You need to have clarity on what is the problem, and how you plan to address the problem. So, this starts by having information and data.",
    "Mayhem in Sagamu, blood-thirsty cultists engage in deadly clashes, residents live in fear": "The atmosphere in Sagamu town has been tense lately due to clashes by rival cult groups, causing residents to live in perpetual fear, Bankole Taiwo writes\nThe incessant cult clashes within Sagamu, the headquarters of Sagamu Local Government Area of Ogun State, with the attendant loss of lives is already becoming a source of worry and frustration to the residents of the town who felt that the government and the security forces have to be more decisive in curtailing this ugly incident\nBetween January and September, Sagamu has reportedly recorded at least four bloody cult clashes during which about 30 souls perished.\nIn March, the governor of the state, Dapo Abiodun, had directed the state Commissioner of Police; the Commander, 35 Artillery Brigade; and the Director, Department of State Services, to relocate their operations to the Sagamu area of the state and apprehend those involved in the recent cult activities in the town. \nAbiodun had issued the statement through his former Chief Press Secretary, Kunle Somorin, on the heels of a bloody cult clash in the town during when eight lives were reportedly lost in a supremacy battle between the two rival cult groups of Eiye and Aiye confraternities.\nSimilarly in April, around Agbowa, behind Ewusi Palace, Makun, and Sagamu two precious souls were confirmed dead when these same cult groups of Eiye and Aiye confraternities clashed again.\nEyewitnesses told The PUNCH that sounds of gunshots rented the air during the clash between two rival cult groups, forcing the residents to scamper for safety and by the time the dust settled two dead bodies were found.      \nTwo months after, that is in June, there was another confrontation between these blood-thirsty groups around Ijagba when another life was cut down in his prime.\nThe most recent which occurred less than two weeks ago lasted four days and it was said to have been the most callous and brutal with the number of the dead put at 20 out of which many were said to be innocent and just victims of circumstances police have however said that only eight people died.\nSpeaking with our Correspondent, the Odofin of Sonyindo, Sagamu, Oba Gisanrin  Lasisi confirmed that there had been reported cases of about four cult clashes in Sagamu this year and that the recent one was the most deadly as the cultists operated as if they were engaged in guerrilla warfare.\nOba Gisanrin said “When you heard that these boys have struck somewhere and you are still trying to gather your thoughts, somebody is telling you that there is another killing again somewhere. This last incident was terrible and horrible. All hands must be on deck to forestall a reoccurrence”.\nPressed to give clue to what he thought could have been responsible for the rising wave of cultism and cult clashes in the town, Oba Gisanrin said though it has been discovered that many of these cultists are strangers from States like Osun and Oyo, the root of this growing evil stands on three tripods of growing broken homes, increase in drugs and substance abuse as well as the prevalence of the yahoo boys who are into cybercrimes.\nThe royal father said “Many of these cultists are products of broken homes; many of them are not getting the desired support from their single mothers or fathers and they left home to stay with their friends who are cultists. Those who habour them will be responsible for their upkeep, giving them food, buying them clothes after which they will introduce them to cultism and that settles it.’’\nFor the yahoo boys, almost all of them are members of cult groups. The reason is that they always want one kind of security or the other because whenever they win big from their fraudulent ways, some established ones want to have a bite or a percentage of such money, so to ward off intimidation and harassment like this they will join a cult group that can always be there to defend them.        \nAccording to Oba Gisarin, another side to this growing disturbance is the influence of drugs. The amount of drugs in circulation now in Sagamu is huge. ‘’ One thing that is quite clear is that many of these cultists wouldn’t have been able to slaughter fowl talk less of stabbing or killing someone if not because of the drug influence. This is another major area the government has to work on to stem this orgy of senseless killings.’’\nAnother resident of the town who pleaded for anonymity said one other vital factor making this problem look intractable is the involvement of the politicians and alleged compromise on the part of the police.\nThe source said these cultists were armed by the two major parties of the All Progressives Congress and the Peoples Democratic Party during elections and that none of the parties could claim to be saints on this subject.\nThe source said “This is the reason why when these cultists are arrested; they are back in town after few days because the politicians would have made some moves to get them out of the police custody”  Related News   Sagamu cult killings: DSS grills APC lawmaker, LG chair  Police arrest suspected Sagamu cult leader, 18 others  Ogun APC, PDP trade words over Sagamu cult killings   \nA clergyman in the town, Pastor Oluwatoyin Awofeso said that erosion of key family values of integrity, discipline, fear of God and godly parenting are part of the reasons why this challenge of bloody cult clashes had persisted.\nPastor Awofeso said “It’s a shame that many parents have abandoned their God’s given duties over their children nowadays. We now have parents of anything goes, all that they are interested in is to see their children hit it big, riding big cars without any tangible source of income.\n“Many parents are afraid to ask their children questions. Have they forgotten that they will actually give an account of stewardship over their children to God? We all need to go back to God. Remember, the Bible says the fear of God is the beginning of wisdom.”      \nOba Gisanrin said he was always troubled each time he saw able-bodied men staying in groups and just chatting away early in the morning when others would be making efforts to go to work, adding that the challenge of unemployment must have also significantly been lending helping hands to this problem of cultism.\nMeanwhile, there was a twist to the worrisome event last week Thursday, when it was reported that the operatives of the Department of State Services (DSS) in a sting operation;  arrested Hon Damilare Bello, representing Sagamu Constituency I at the State House of Assembly alongside six other alleged cultists said to have been involved in the Sagamu bloodbath.\nActing on tip-off, the DSS reportedly barged into the official residence of the lawmaker within the Legislative quarters, Abeokuta around 12am on Thursday and found him to be housing six suspected cultists allegedly said to have been fingered in the Sagamu violence.\nThe media report alleged that guns and some dangerous weapons were found during the DSS raid on the lawmaker’s apartment.\nThe Peoples Democratic Party has however described the arrest of the lawmaker and a member of the party as nothing but sheer intimidation and harassment from the executive arm of Ogun State government.\nThe party in a statement by its Publicity Secretary, Akinloye Bankole, said among other things that the arrest of Hon Damilare Bello as well as the hasty allegations that guns were found on him when the security agency was yet to be done with its investigation amounted to giving a dog a bad name in order to hang it.\nThis is just as Abiodun is also threatening to enact a law that would pronounce the death penalty for cultism offences in the state.  \nThe governor issued this threat last week when he visited the palace of the Akarigbo of Remoland, Oba Babatunde Ajayi, following days of cult-related clashes in Sagamu, which left many dead and others injured.\nAbiodun said the decision which also included having a special court to handle cultism-related offences as well as an amnesty programme for cultists was part of the fallout of the security meeting his government convened to chart the way forward and deal decisively with the issue of cultism in the state.\nHe said “Our primary focus was on establishing a special court, forming a joint operational force comprising various security agencies, and implementing a death penalty for cultism offences.\n“In addition to these measures, we also deliberated on the possibility of introducing a period of amnesty. This would allow individuals who wish to surrender their weapons and renounce their affiliation with any cult-related groups and activities the opportunity to do so without fear of prosecution.\n“As an administration deeply committed to fostering a peaceful and violence-free society, we are dedicated to providing the Special Court and Joint Anti-Cultism Security Task Force with the necessary logistics and tools to support their operations effectively”.\nSimilarly, the Commissioner of Police, CP Abiodun Alamutu, has also vowed that the state command will never fold its hands and allow free reign of lawlessness saying that anyone caught disturbing the peace of the state would be dealt with decisively.\nAlamutu traced the recent Sagamu killings to an attempt by a rival cult gang to share in the money someone who sold a land had given to another group hence the attack and counter-attack leading to the loss of eight lives while nine suspects have been arrested.      \nThe residents however believed that the cult killings in Sagamu would be reduced to barest minimum once there were no forms of interference from any quarters whenever these cultists were caught. They insisted that the overt and covert support these blood-thirsty groups are getting from the politicians is a major challenge to winning the battle against this malady"
}