{
    "Sagamu killings: No sacred cows in ongoing probe, says DSS": "CP Ogun Security Operatives in Ogun State, yesterday, said there would be no sacred cows in the ongoing investigations into the causes and persons behind the recent cult clashes in the Sagamu area of the state. Sources in the Department of State Service (DSS), explained that the ongoing investigations are being conducted without bias, even as one of the sources added that suspects so far questioned in connection with the recent mayhem have given very useful information that will assist in unraveling the kingpins and their collaborators. A source close to the agency confirmed inviting high-profile persons for interrogation, stressing that both the remote and immediate causes of the mayhem are being thoroughly examined. The source assured the public that the agencies were determined to get to the roots of the cult activities in the ancient town and its environs. “We had questions for two individuals and we invited them accordingly. They were invited as part of our investigations into the cult killings. They honoured our invitations. They were thoroughly questioned. They have been released after we finished questioning them.\n“They provided very useful information that will greatly assist us with our task of unraveling the reasons and people behind the incessant cult clashes in Sagamu\n“Inviting legislators or local government administrators must not be seen as an exception. We are focused on the task of ending cultists and cult-related executions.\n“Our resolve is absolute and we will not be phased by snide talks. We have invited various personalities who are also bona-fide members of the community.\n“Remember, we earlier said that based on the directive of the governor who invited us to join in this exercise, there will be no sacred cows.\n“We have broadened our investigations. We are working with resolve and determination and we are even widening our nets as we continue,” the source added. It was further learnt that more high-profile personalities are going to be invited as the investigation unfolds. Meanwhile, the state Governor, Prince Dapo Abiodun, has directed security agencies to get to the bottom of the Sagamu killings with a view to resolving the perennial crisis once and for all.",
    "Woman kills 65-year-old husband with pestle in Ondo": "CP Asabi A mother of three, Tayelolu Solomon, has allegedly killed her 65-year-old husband, Felix Solomon, with a pestle in Ondo town, headquarters of the Ondo West Local Council of Ondo State. The incident, which occurred in the couple’s residence located in the Government Reserved Area (GRA) of the town, has plunged the community into a state of mourning. The Guardian gathered that the couple had a prolonged domestic dispute, with the suspect at different times, threatening to take her husband’s life and flee. The deceased’s son, Ibukun Solomon, who was present during the incident, said:  “My mother killed my father with a pestle and took to her heels. She used the pestle to hit his head when he was asleep. “Earlier on the fateful day, a minor argument ensued, and resulted in a fight between them. After the fight, my father went to rest on the chair, and my mother hit his head with the pestle.\n“He became unconscious in the process and fell down from where he was sleeping. My mother used the pestle to hit my father’s head three times.\n“When my mother saw that my father was already unconscious, she hid the pestle at the back of our house and ran away. I alerted some of the residents, who rushed my father to the hospital. But, he later died. His remains have been deposited at the morgue. My mother had three children for my father, and I’m the last child.” It was gathered that the deceased was in a coma when members of the community arrived at the scene, after which they called the police for help. A member of the deceased’s family said they were making efforts to settle the incessant fights between the couple before the tragedy. He said: “The woman had been threatening to kill her husband whenever they were fighting. And the deceased informed us about the threats. But we never knew she would carry out the act. “This time, she took laws into her own hands and killed our brother for nothing. She must be arrested and prosecuted accordingly.” Meanwhile, the police in the state said an investigation has begun, adding that the suspect would soon be apprehended.",
    "Court remands 13 suspects for killing village head in Niger": "Gavel Justice Aisha Bawa Wodu of a High Court sitting in Suleja, Niger State has remanded 13 people in Minna Correctional Centre for their alleged role in the killing of the village head of Lammbata, Alhaji Mohammed Abdulsafur. The suspects were arraigned by the Niger State Attorney General and Commissioner of Justice office on five-count charge, bordering on culpable homicide, disturbing public peace, inciting disturbance, voluntarily causing grievous hurt by dangerous means, and mischief by fire. They were earlier standing trial before Magistrate Hajiya Fati Kabir of a Minna Senior Magistrate’s court, who held a preliminary charge before they were properly arraigned before the court. The five-count charges, according to the Assistant Chief State Counsel in the State Ministry of Justice, Mohammed Galadima, were punishable under Section 79 of the Joint Act, contrary to Section 221 of the Penal Code. Twenty-nine of the suspects were charged to court, out of which 13 physically took their pleas, while 16 of them were said to be at large. Also, two others still in Minna Correctional Custody are to be brought in court on the next adjourned date to take their pleas. Those in court were Umar Ilyasu Sarki, Hamza Umar Sarki, Dauda Umar Sarki, Abdulkareem Dantani, Yusuf Chaska, Zubairu Dabaka, Donbitso, Jibrin Garba Dende, and Ibrahim Mohammed.\nOthers include: Ilyasu Dantani, Yakubu Bisalla, Musa Mohammed, Adamu Yusuf, Yunusa Ibrahim Abdullahi Umaru, Musa Abubakar, Danladi Dashi, Mohammed Atiku, and Usman Habib. However, when the five-count charge were read and interpreted for them, they all pleaded not guilty. Consequently, the defendants’ counsel, Ahmed Baba, applied for their bail.\nIn the bail application, supported by a 14-paragraph affidavit, Baba urged the court to grant the defendants’ bail and assured that “if granted bail, they will provide a reasonable surety that would stand for them and will abide by any of the bail conditions.” Responding, Galadima, told the court that he had filed a counter-affidavit to object to the bail application as moved by the defence counsel and requested the court to adjourn the case to commence hearing into the matter. After listening to both parties, Justice Wodu, adjourned the matter to October 17, for commencement of trial. She also remanded the suspects in Correctional Custody pending the ruling on the bail application.",
    "Police debunk alleged removal of corpse’s eyes in Gombe morgue": "Nigerian Police Gombe State Police Command, yesterday, dismissed an allegation by a deceased family over removal of a corpse’s eyes at the Federal Teaching Hospital’s morgue. Spokesperson for the Command, Mahid Muazu Abubakar, on Wednesday, said an autopsy revealed that all the deceased’s eyes were intact, dismissing the reports as false and unfounded. He said:  “On Tuesday, September 26, one Bilyaminu Dogara Campbell, (m), of Tumfure quarters Gombe, went to the Gombe Divisional Police Headquarters and reported that his aunt, Halima Ibrahim, 61, who died while receiving treatment at the Federal Teaching Hospital, Gombe on Friday, September 22 with her corpse deposited at the said hospital mortuary for preservation. “On the same day, the deceased’s relatives claimed that they went to prepare the corpse for burial, but discovered that blood was coming out from the deceased left eye, which raised suspicion that the eye might have been removed at the hospital’s mortuary.” He added that the Commissioner of Police (CP) Oqua Etim, directed the Divisional Police Officer (DPO) to conduct discreet investigations to ascertain circumstances surrounding the incident. According to him, the Command deployed police operatives at the hospital’s gate to protect the facility and prevent breach of public peace. “The management of the hospital appealed to the aggrieved persons for calm and conducted an autopsy on the deceased body in the presence of relatives, and the result shows that all the two eyes were intact. “This has doused the tension and the crowd who gathered outside the hospital’s gate dispersed peacefully, having noticed that the allegations were baseless. The allegations are false and unfounded, and the tension was orchestrated by mischief makers to incite disturbance of public peace in the state,” he said. He said the police are investigating the perpetrators of the false alarm to bring them to book.",
    "Police nab 92 suspects for cultism, kidnapping, armed robbery in Enugu": "CP Kanayo Uzuegbu The police in Enugu State have arrested over 92 suspects for cultism, kidnapping and armed robbery between August 16 and September 25. Also, the Command rescued 12 abducted victims from various parts of the state within the period under review. The suspects were arrested for cultism, robbery, murder, kidnapping, and unlawful possession of firearms. The State’s Commissioner of Police (CP), Kanayo Uzuegbu, said four AK 47 rifles, 66 other firearms of different calibres, 333 live ammunition of different calibres, 25 vehicles and several other incriminating items such as charms and phones were recovered from the suspects. The CP, who addressed his maiden press conference since his assumption as the 28th Commissioner of Police in the state, said the suspects include one Kelechi Okwara, 27, from Ohafia, Abia State, who last Saturday, September 23, conspired with his brother, that works as a security man in a house in Trans-Ekulu Enugu to kidnap his brother’s master’s mother in-law, his nanny and little baby. Okwara and his brother, who is now at large, had taken the victims to an unknown destination, on September 23, at about 8:00p.m., demanded and obtained N3 million ransom from the said master.\nThey used the proceeds to buy a red coloured Toyota Corolla car, which was recovered upon his arrest last Sunday, September 24, at about 6:30p.m. The suspect was nabbed at Nokpa/Ezimma Nike boundary point, by police operatives in Abakpa and Trans-Ekulu Police Divisions, with assistance from Neighbourhood Watch Group. “Also recovered, is a Toyota Camry car the suspects had carted away upon the kidnapping of the victims. Further discreet investigation is ongoing,” the CP said. Uzuegbu, who said the task of effectively policing the society is daily becoming daunting, however, said since his assumption of duty, he ensured that the right policing strategies are devised to tackle existing and emerging security challenges in the state. He said: “These strategies are subsumed in my grassroots-driven, proactive, people-oriented and problem-solving policing thrust, which is in line with the policing vision and mission of the acting Inspector-General of Police (IGP), Kayode Adeolu Egbetokun. “In view of this, I have met and interacted with critical security stakeholders, including local government chairmen, traditional rulers, heads of other security agencies and many others, on the best ways to collectively tackle security challenges in the State. “These engagements, I must tell you, have started paying off, as we are making remarkable progress in tackling violent crimes of kidnapping, armed robbery and the activities of subversive criminals. “It is a known fact that it is humanly impossible to totally eliminate crimes in human society. However, I want to assure the good people of Enugu State and visitors that we remain committed to ensuring that maximum security and tranquility are maintained in the state.”",
    "Lagos shuts Oke-Odo market over filth, infractions": "Oke Odo Market .Lagos shuts Oke-Odo market over filth, infractions In continuation of its pushback on filthy markets in the state, Lagos Waste Management Authority (LAWMA, yesterday, shut Oke-Odo Market, near Ile-Epo, Abule Egba, for reckless waste disposal and gross environmental abuse. Managing Director of LAWMA, Dr Muyiwa Gbadegesin, said the move became necessary to make them comply with environmental laws and regulations, and to warn defaulting markets around the state, to do the needful or risk a closure. According to him, the closure of Oke-odo Market underscores LAWMA’s commitment to ensuring that public spaces meet the required cleanliness standards. “We will not compromise on the health and well-being of residents,” he stated.\nGbadegesin emphasised that the decision was a significant stride in the agency’s efforts to sanitise the state, ensuring that public spaces are conducive for business activities and safe for all residents, adding that the closure of the market served as a stark reminder that adherence to cleanliness standards was not negotiable. “This action is part of a broader initiative by LAWMA to create awareness and enforce sanitation regulations across various markets in the state. Markets that do not meet the prescribed cleanliness standards will face similar consequences as Oke-odo Market. Market operators and stakeholders are urged to take this as a wake-up call to institute robust cleanliness practices within their premises. LAWMA remains dedicated to providing guidance and support to markets striving to comply with the sanitation regulations,” he said. Meanwhile, Lagos Environmental Sanitation Corps (LAGESC) also known as Kick Against Indiscipline (KAI), has arrested three suspects for obstructing and attacking operatives with dangerous weapons and stabbing its operative. The suspects, Taiwo Abeeb, 53; Ismaila Adeniji, 35 and Akeem Kelani, 40 were arrested during the close down of Agbado Oke-Odo market over environmental infractions. Corps Marshal of the Agency, Gbemisola Akinpelu, said the suspects will be charged to court for onward prosecution. The retired Commissioner of Police emphasised the need for markets to maintain a high level of hygiene through appropriate dumping of refuse via approved PSP operators, adding that the setbacks and lay-bys of external market premises must not accommodate street traders and hawkers. According to her, street trading remains banned in the state and there will be no hiding place for street traders and hawkers as part of a renewed drive to enforce environmental laws.",
    "Three killed in twin Dutch shootings": "Members of apecial units of the police and the fire brigade gather at a fire in a building on Heiman Dullaertplein, after shootings in Rotterdam, on September 28, 2023. – Twin shootings in Rotterdam on Thursday have resulted in an unknown number of fatalities, police said. A gunman dressed in combat gear opened fire in a flat in the Dutch city then burst into the Erasmus University Medical Center (Erasmus MC). Fires broke out in both places but were later extinguished. (Photo by Marco van der Caaij / ANP / AFP) / Netherlands OUT / NETHERLANDS OUT",
    "Nigeria at 63: FG declares October 2 public holiday": "Minister of interior,  Dr Olubunmi Tunji-Ojo PHOTO: Twitter/Olubunmi Tunji-Ojo The Federal Government (FG) has declared Monday, October 2, as a public holiday in commemoration of the 63rd independence celebration in Nigeria. The announcement was made public on Thursday by the Permanent Secretary, Ministry of Interior, Dr Oluwatoyin Akinlade, on behalf of the government. The Minister of Interior, Dr Olubunmi Tunji-Ojo, through the statement issued by Akinlade, congratulated all Nigerians at home and in the Diaspora on the occasion.  Tunji-Ojo, in the statement, also assured Nigerians of FG’s continued commitment to tackling challenges facing the nation. “It is today a known fact that difficult Socio-Economic and Security challenges are global, and Nigeria is not isolated,” the Minister said in a statement signed by Akinlade.  “The government is making efforts to confront the numerous challenges with all the might available until respite comes the way of the country.  “The eminent position of Nigeria in the comity of Nations and the greatness ahead of the country is achievable if we all work together in unity.” According to the Minister of Interior, Nigeria would remain Africa’s pride and beacon of hope for the Renewed Hope of President Bola Ahmed Tinubu. Meanwhile, the Federal Government on Monday revealed plans to mark Nigeria’s 63rd independence anniversary on October 1 in a low-key way. The Secretary to the Government of the Federation (SGF), George Akume, said this during a press conference in Abuja, with the FG also not inviting any world leaders. Akume further told journalists that the decision not to invite any world leaders for the 63rd independence anniversary was taken in line with the government’s option for a low-key celebration.",
    "Burkina's military govt says foiled coup attempt": "(FILES) In this file photo taken on March 2, 2022 Lieutenant-Colonel Paul-Henri Sandaogo Damiba, President of Burkina Faso, arrives to his inauguration ceremony as President of Transition, in Ouagadougou. – Military officers announced the removal from office of Burkina Faso’s junta leader on September 30, 2022. The dismissal of Lieutenant-Colonel Paul-Henri Sandaogo Damiba, who came to power in a coup last January, was announced in a statement read out on national television. (Photo by OLYMPIA DE MAISMONT / AFP)",
    "Lax PIA implementation leaves NNPCL, NUPRC, NMDPRA in disarray": "Lax PIA implementation bites hard • Mergers of regulators, boards of NNPCL, slack workforce worry stakeholders\n• Oil sector remains vulnerable as implementation of host community fragment lingers\n• Operators face tougher environment amidst challenging economic outlook  The projected gains expected from Nigeria’s oil and gas sector following the passage of the Petroleum Industry Act (PIA) have remained a mirage as poor implementation leaves principal actors in battle for supremacy and revenue. The rent-seeking attitude of the Federal Government, bribe demanding officials and bureaucratic process, which is clouded in secrecy, multiple taxation and a crisis rocked regulatory outlook were a few phrases used yesterday by stakeholders to describe the state of the country’s oil and gas industry, a development similar to the pre-PIA era. With a political board, which is now suspended and the inability to list at the stock market, the commercialization of the Nigerian National Petroleum Company Limited (PIA) and a change of attitude of the workforce of the oil and gas agencies and parastatal according to industry players, who spoke with The Guardian are bottlenecks that must be urgently addressed if the country would progress in harnessing the benefits of the much-trumpeted legislation. Most stakeholders appeared to also be voting in the direction of a single regulator as they canvassed for merger following the loopholes and battle for supremacy being witnessed between Nigerian Upstream Petroleum Regulatory Commission (NUPRC) and the Nigerian Midstream Downstream Petroleum Regulatory Authority (NMDPRA). This comes as the Nigerian Extractive Industry Transparency Initiative (NEITI) insisted that the provision in section 64 (m) of the Petroleum Industry Act (PIA) that makes NNPC the supplier of last resort and that all associated costs to be borne by the Federation is capable of being misinterpreted as it was in the old practice of deducting from revenue source. The agency noted further that section 64 (C) and 9 (4) of the PIA that provides for 30 per cent deduction from profit oil and profit gas by NNPCL for frontier exploration fund and NNPCL management fee, does not provide clarification as to what percentage goes for frontier exploration fund and NNPCL management fee. “The federal government should consider reviewing the deductions from oil profit to ensure they are clearly delineated. If the intention is to have one 30 per cent retention that covers both the management fee and the FEF, the wording should be rephrased to reflect this clearly. Alternatively, if separate 30 per cent retention is required, the language should be revised accordingly,” NEITI said. Despite the criticism that greeted the allocation of three per cent of oil companies’ operating expense to host communities in the oil and gas producing region, stakeholders, while expressing concerns on the fiscals of the deep water assets, said the inability of NUPRC to implement the host community fragment is a serious case for concern and a snag for investment. While President Bola Tinubu had recently dissolved the boards of government agencies including that of NNPCL, the industry players insisted that the political board would not deliver the needed reform at the state oil firm, adding that until NNPCL is listed on the stock market and the board appointed by shareholders instead of government, the national oil company would still remain like a corporation. In August 2021, former President Muhammadu Buhari signed into law the PIA, which had been in the making for over two decades. Although the implementation committee includes, Executive Secretary, Petroleum Technology Development Fund-Secretary as head of the Coordinating Secretariat and the Implementation Working Group, Buhari became the first hindrance to the legal framework as he delayed ‘removal of fuel subsidy for his party to win election.’ This is coming at a time that fossil fuel, Nigeria’s key economic mainstay, is in a race against time despite the country’s economy challenged by rising poverty, inflation and foreign exchange crisis fueled by the fall of the oil and gas sector. Energy Scholar at the University of Ibadan, Prof. Adeola Adenikinju said implementation of key components of the PIA has been slow, and timelines have not been adhered to as contained in the Act. “Much of the expectations of stakeholders are yet to be met. There are still regulatory overlaps between the two industry regulators. The process of getting approval is still slow, deliberately hindered and costly. “I will support the merger of the two regulators. That will reduce the current battle for supremacy between the two regulators and help operators to cut down on moving between the two regulators,” Adeola said. According to him, the government must do a lot more to ensure that the vision of a virile petroleum sector is realized. The scholar said unless the NNPCL is listed on the stock exchange and its board appointed by shareholders instead of the government, the commercialization of the oil firm would not bring needed gains and transparency. Adenikinju decried the delay in the removal of subsidy by the previous administration, stating that the move sent a negative message towards the implementation of the PIA. “PIA was suspended for almost two years. The host community fragment has been delayed for over two years. The investors would be worried,” he said. In the face of mounting inefficiency in the industry, a chain of recent events, among which are oil bunkering and theft, game of wits among the key offshoots of the PIA, especially NUPRC, NMDPRA and NNPCL have seen the nation’s crude oil production and investment portfolio heading towards its record worst. Consequently, revenue from the sector keeps plummeting and is no longer enough to cater to the nation’s multifarious expenditure, amidst rising borrowing and debt stock. An operator, who pleaded not to be quoted, told The Guardian that officials at both regulatory agencies and other agencies still demand bribes to attend to licenses and approvals, adding that the delay in the process and bureaucratic obstacles did not change. Former Secretary of the NNPC and President, Nigerian Association for Energy Economics (NAEE), Prof. Yinka Omorogbe said the implementation is the key problem of the PIA. Omorogbe, who noted that the PIA remained a critical instrument for the overhauling of the oil and gas sector said the law has led to creation of new institutions. The Senior Advocate of Nigeria however decried that the needed reform in the sector is yet to take, adding that the workforce and prevailing situation cannot deliver the projection of the PIA. Omorogbe noted that the idea of having two regulators in the PIA is not much of a problem compared to addressing the issues that bedeviled the functionality of the regulators. “Implementation could be much better,” Energy Expert Henry Adigun said, adding that gaps persisted in the reform. Noting that there have however been significant achievements, Adigun said, “NNPCL still imagines itself as the policy organ of the oil industry. He said unless such a significant issue is properly addressed alongside other loopholes, the gains of the PIA must remain elusive. Speaking on the regulatory framework, Adigun said: “I think a lot of clarity is still required as there is significant overlap in some cases.” He believes that the dual regulatory system would work with time. Adigun expressed concerns over an alleged plan by the current government to merge the gas aspect of the oil sector with the ministry of power, stressing that “gas investments will stagnate if that is done.” A scholar and renowned energy expert, Prof. Wunmi Iledare, said the implementation of PIA has been so slow and short-circuited, adding that the committee implementing the law was sidetracked in resource mapping, especially for the PIA institutions. “The suboptimality of PIA is majorly because the new institutions were indirectly handed over the task of human resources mapping to the defunct institutions; the old Petroleum Products Pricing Regulatory Agency (PPPRA) became the driver of the Authority and the defunct Department of Petroleum Resources (DPR) indirectly drives the Commission,” he said. Iledare noted that the selection process of the board members of NNPCL became driven by political expediency with blatant disregard for the guidelines stipulated in the PIA. According to him, the PIA final fiscal framework also, because of transactional mindedness, blatantly violated the fiscal rules of general applications. Iledare said: “The royalty scheme was truncated and the dual taxation was skewed generously in favour of deep offshore Production sharing Contracts (PSC) assets, perhaps, because of profit petroleum split.” Iledare said the fact that the deepwater assets were exempted from the PIA hydrocarbon tax, violates the dual intention, noting that there was a need to correct the error in the fiscal framework provision. The professor said even if it had to be suspended for a period as a severance tax holiday, the fiscal framework is highly favourable and particularly very generous for deepwater investment.\nIledare supports the merger of the regulators, adding that he aligns with the discomfort expressed by investors. “The original intent was a single regulator with multidimensional commissioners manning each segment of the petroleum valuation chain as per the petroleum policy document. The regulatory institutions in the PIA is a complete departure from the 2017 policy with two regulators.  It is, however, interesting to note that a good policy or bill that does not become an act is nothing but an academic exercise. Time will tell if the error is correctable without an unpalatable cost, judging from the marginal propensity for institutional capture of economic rent by NASS when it comes to anything petroleum,” Iledare said. He believes the regulators are more concerned with revenue enhancement as the basis for enacting regulations, then there is a problem, stressing that the vogue to invoke revenue to fund regulators is bound to increase the cost per barrel in the country. Energy Scholar, Garuba Dauda, who noted that it might be too early to conclude on PIA, said: “The only thing we possibly need to be mindful of is the ongoing development of the energy transition. It will happen as it has been with earlier transitions before fossil fuels, except that we need to exercise caution and balance our responses. It is gratifying that Nigeria is cautious about this already, and has launched an energy transition plan to respond to it. We can have a conversation and (dis)agree about the details of the plan.” Former Chairman, Society of Petroleum Engineers, Joseph Nwakwue insisted that the implementation has so far been slow and inconsistent. “One would have wished for a more focused and speedier implementation given the state of play and the prize at stake,” Nwakwue said. According to him, a review and amendment of the Act may need to be done to minimise overlaps and gaps in the law. Nwakwue disclosed that there is significant over-regulation, which would undermine a key objective of the PIA, especially the attempts to minimize cost of production. Legal practitioner and former management staff at Shell Nigeria, Madaki Ameh said while PIA was promoted with pomp and pageantry as a one silver bullet to cure all ills in the Petroleum Industry, indications have shown that “all the euphoria was misplaced.” According to him, apart from the confusion in the regulatory agencies, where there is uncertainty as to which body to deal with in respect of some of the approvals required to carry out certain activities, there is the issue of weak regulation and lack of experience by the regulators.\nAmeh said: “The much-anticipated upsurge in investments in the Upstream and Downstream Sectors of the Petroleum Industry has not crystallized because of the dislocation in other sectors of the economy which has generally resulted in slow foreign investment inflows. There is an urgent need to review the Petroleum Industry Act in order to bring it in tandem with current realities of the Industry.”",
    "Stakeholders, CHRICED bicker over return of petrol subsidy": "NNPCL • N169.4 billion on PMS not subsidy but NNPC deductions, says Emmanuel\n• Zikirullahi: Tinubu should be courageous to announce return of subsidy payment\n• Where is the money saved, TUC asks FG to account for gains of subsidy removal Following indications that the Federal Government might have returned subsidy payment on Premium Motor Spirit (PMS) due to the fluctuations of foreign exchange and crude oil price, stakeholders in the sector have said the N169.4 billion reported to have been paid for subsidy on PMS as a means to stop the hike in the pump price of petrol is inaccurate. This is on the backdrop of several questions raised on the current PMS price despite worsening exchange rate and international crude price crossing $95 a barrel, suggesting a return of subsidy. On Tuesday, Phrank Shaibu, Special Assistant on Public Communication to former Vice President, Atiku Abubakar, dared the Federal Government to publish the landing cost of petrol as well as the pricing template being used to keep the cost of PMS at less than N640 per litre, adding that government’s claim that the petroleum sector had been deregulated was a lie and subsidy was still being paid. However, stakeholders told The Guardian that the purported return of subsidy was mere speculation.\nChief Executive Officer, Diary Hills Limited, Kelvin Emmanuel, said the N169.4 billion is payment Nigeria National Petroleum Company Limited (NNPCL) deducted for use in reconciling forward contracts on past crude oil swap deals that run until November 2023. He added that sections 206(2)(3)(4) states expressly that wholesalers and retailers are not allowed to transfer live market prices to old stock, until a new stock arrives, which gives the Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) the right to enforce violation of the law on transfer pricing. “Brent crude at above $90 and exchange rate above N1,000 means that prices are going up, but the question that needs answering is this: Is the old stock depleted? And based on transfer pricing rules, are marketers allowed to pass the cost of new stock on old stock?” he queried. President of the Independent Petroleum Marketers Association of Nigeria (IPMAN), Chinedu Okoronkwo told The Guardian that there is no return of subsidy yet. He said in terms of exchange rate, there is government window and parallel market window, noting that NNPCL calculates prices with the government window, which is official. “For me, we are getting products from NNPC and whether we like it or not, 80 per cent or 90 per cent of products that come into the country is brought by them. All these speculations are what is killing this country, especially when we begin to speculate to cause panic within the polity,” he said. Energy economist, Habeeb Jaiyeola, said the Nigeria Labour Congress (NLC) would not want to embark on strike if subsidy has returned, adding that it can only be accepted if an official announcement has been made by the President. He added that the logistics element needs to be looked into to know how much reserve and storage existed, as the logistics might have played well for enough storage to make the price stable. “We all understand the fact that Nigeria doesn’t have the financial muscle to continue to sustain subsidy regime, the price of the product is cheapest in Nigeria and surrounding areas have it higher, hence there would be movement of the product from cheaper clime to a more expensive clime where people will make more money and we end up subsidising the region, if we go back to the decision to return subsidy. “The subsidy is sort of a bitter pill to swallow as a nation, but the benefit would yield fruits when we are able to have more revenue to put in matters that are of value to us to alleviate the poverty of citizens. We need to be focused on what the future entails for us and ensure critical decisions are sustained when taken,” he said. Meanwhile, the Resource Centre for Human Rights & Civic Education (CHRICED) yesterday slammed the Federal Government over lack of accountability and sustainability in its policies on the removal of fuel subsidy. The centre stated that it was difficult to understand why President Bola Tinubu’s administration was taking a contradictory stance, and the motivation behind the government’s approach of flip-flopping on the matter. In a statement by the centre’s Executive Directive, Ibrahim Zikirullahi, he said: “Despite professing for several weeks that it made a courageous and bold decision to end the subsidy regime, it is now evident that the government has reinstated the scheme in a manner that is opaque and lacks transparency. “Regrettably, the price of PMS will not return to what it was before May 29 even with the reinstatement of subsidy payments,” it stated. “At the time, Nigerians who objected to the harshness of the policy were told to make the required sacrifice to save the nation from further financial hemorrhage. The government’s spin doctors were everywhere arguing that the removal of the fuel subsidy would eliminate fiscal constraints, curb corruption and mismanagement in the oil sector, and eliminate the unsustainable cost of the subsidy due to rising fuel prices and a growing population. “In addition, they argued that the removal will ensure market efficiency, promote economic growth and development, and free allocations that can be channeled to the provision of infrastructure such as roads, education, health service, power, security, job creation, downstream sector development, improve our GDP growth, crack down on product theft, pipeline vandalism, environmental pollution, foreign exchange shortages, and enable the provision of basic benefits for the “poor in the society. “However, less than 100 days in office, Tinubu’s government reversal, as evident in the covert reintroduction of subsidy payments, prompted close observers to wonder: what happened to the “spirit of courage” that President Bola Ahmed Tinubu claimed he possessed? Is it because the petroleum subsidy is no longer sham? Could it also be stated that the government no longer has to cope with oil thefts and frauds? Or is it possible that Tinubu’s government is currently being held hostage by the subsidy cabal and forced to reverse its position. “Whatever the motivation, it is disturbing and unacceptable that the same administration, which previously praised itself for sparing the nation from the needless spending associated with subsidies, is now returning the nation to the same path through the back door. This means that the trillions of Naira that the government claimed to have saved by eliminating subsidies are now systematically being conned under the guise of resumption of subsidy payments.” The centre added that the removal of subsidies will be a never-ending process unless the country ends its current absolute reliance on importation of refined petroleum products to satisfy its energy requirements. Also, president of the Trade Union Congress of Nigeria (TUC), Festus Osifo, has urged the Federal Government to reveal how it spent the N1 trillion saved after ending the subsidy on petrol in May. Osifo, on Wednesday, during an interview with Arise News, said the government promised it was going to save substantial money from removing subsidy on petrol. President Tinubu. Photo Credit: Premium Times In July, President Tinubu disclosed that more than N1 trillion that would have been expended on petrol subsidy, had been saved, stating that the funds will be disbursed for the benefit of Nigerians. This was after NNPC raised petrol price from N189 per litre to N568 per litre. The TUC boss therefore called on the Federal Government to provide details on how the money had been spent, as the government shouldn’t be seeking loan after saving such a substantial amount. “The President and Commander-in-Chief on his own came and said the country has saved N1 trillion. The Federal Government went everywhere to announce that if the subsidy is removed, it’s going to save substantial money. “The question we have asked is that where are the money that you have saved from this subsidy. Part of this money that you must have saved, you deploy it on your citizens. That is what we have asked, is that too much to ask? “And so, we don’t expect them to go everywhere and start borrowing money. They told us they are going to save money. So where is the money that you have saved and how have they deployed this money,” Osifo asked. He also reiterated the call for reduction in the cost of governance, saying suggestions have been made to the government on what needs to be done.",
    "Imo guber: INEC will not compromise standard, REC assures Imolites": "The Independent National Electoral Commission (INEC) has reiterated its commitment to conduct free, fair and credible governorship election in Imo State scheduled for November 11th, 2023. The Commission assured the Imo electorate that it will remain an impartial umpire and would resist any attempt to compromise standard during the election.  The Resident Electoral Commissioner, REC, Prof. Sylvia Agu, represented by Mrs. Emmanuela Opara, Imo INEC Head of Voter Education and Publicity Department, gave the assurance while addressing Labour Party members who stormed the Commission headquarters in Owerri, Thursday on a peaceful protest. She said, “there will be free and fair elections in the state. Other Resident Electoral Commissioners, RECs, will be part of the election because it is an off-cycle election. “The BVAs will work, and they will work optimally. Our BVAS have never failed, and I can assure you we will have a credible election in the state,” she assured. During the protest, the LP demanded the removal of the Imo INEC REC while tasking the Commission to conduct a free, fair and credible guber poll in the state come November 11th.",
    "Protest rocks Abuja as Wike's men crush 470 motorcycles": "Nyesom Wike In a bid to prevent their siezed motorcycles from being crushed on Thursday, frustrated commercial motorcyclists in many parts of the Federal Capital Territory (FCT) attacked and threw stones at members of a joint task force appointed by the FCT minister, Ezenwo Nyesom Wike. The Joint task force comprising of men from the DRTS, Police, Civil Defence, DSS and the military, immediately repelled the protesters with shots of teargas canisters. To firmly establish their dominance, the joint task force further chased the assailant into Gosa community while ensuring that the unlucky ones who were caught in the process return to their homes with bruises and swollen faces or worsestill, end up in the clinics. Over 470 motorcycles were impounded in an exercise that started from the popular car wash bus stop in Lugbe, combing through Gosa, Bill Clinton drive, Trademore estate, Lugbe junction as well as the Kubwa and it’s environs. Addressing journalists before the seized motorcycles were crushed at Area 1 round about, the Secretary, Transportation Secretariat, Nya Ubokutom, warned commercial motorcyclists to strictly limit their operations to the areas designated for them. He explained that the Administration’s desire to develop a smart city devoid of all sorts of pollution cannot be achieved if illegalities are allowed to pervade the Federal Capital City. Director, FCT Directorate of Road Traffic Services, Abdulateef Bello said apart from the city centre, commercial motorcyclists are not allowed to operate on any of the territory’s highways noting that the administration is determined to rid the entire FCT roads of okada operators. He further warned that one of the strategies to be deployed towards eliminating commercial motorcyclists from FCT roads is arresting passengers who patronise the business. The operation also witnessed situations where untargeted members of the society became victims due to panic or accident. In some horrific situations, passengers were left seriously injured while one was seen laying almost unconscious after the escaping okada rider flung him across the road at Lugbe junction. Similarly, food vendors and passer-bys took to their heels at Galadimawa round about on sightings the intimidating joint task force team as they arrived to carry out their operation."
}